#pragma once

#include<stdio.h> 
#include<stdlib.h>
#include <windows.h>
#include <conio.h>
#include<time.h>
#include<string.h>



#define 关卡设计 roomdesign()
#define 切图后重置 reroom()
#define 人物操作 movebutton
#define 开场动画 startgame()
#define 开发者调试 if (creater > 0)
#define  空 0
#define  非触发程序 if(0)
#define  一直循环 while(1)
#define  存在 1
#define  玩家 1
#define  已探索 1
#define  台 2
#define  墙 3
#define  箱 4
#define  右门 5
#define  左门 6
#define  前门 7
#define  后门 8
#define  电脑 10
#define  水 14
#define  背景 15

#define 大于9000的id  是村民
#define  怪物总数 10000
#define  房间数量 10000
#define  空格键按下 if (GetKeyState(32) < 0) 
#define  ESC键按下 if (GetKeyState(27) < 0) 
#define  回车键按下 if (GetKeyState(13) < 0)
#define  数字0键按下 if (GetKeyState(48) < 0)
#define  数字1键按下 if (GetKeyState(49) < 0) 
#define  数字2键按下 if (GetKeyState(50) < 0) 
#define  数字3键按下 if (GetKeyState(51) < 0) 
#define  数字4键按下 if (GetKeyState(52) < 0)
#define  数字5键按下 if (GetKeyState(53) < 0) 
#define  数字6键按下 if (GetKeyState(54) < 0) 
#define  数字7键按下 if (GetKeyState(55) < 0) 
#define  数字8键按下 if (GetKeyState(56) < 0)
#define  数字9键按下 if (GetKeyState(57) < 0) 
#define  视角归位   cgy=y+15;cgx=x;
#define  A键按下 if (GetKeyState(65) < 0) 
#define  D键按下 if (GetKeyState(68) < 0) 
#define  W键按下 if (GetKeyState(87) < 0) 
#define  S键按下 if (GetKeyState(83) < 0) 
#define  J键按下 if (GetKeyState(74) < 0) 
#define  K键按下 if (GetKeyState(75) < 0) 
#define  延迟    Sleep
#define  paperx    84
#define 显示屏幕参数 &show,200
#define 绘画底板参数 &picture,5000



//***************
//*声明的全局变量
//***************

//显示屏坐标 

//struct string
//{
//	/*x2					初始化横坐标													y2					初始化纵坐标
//		h1					初始化生命														id					怪物逻辑编号
//		r					怪物寻敌半径													e					是否为逻辑 / 对话
//		die[id]				怪物死亡不在运行标志											i[id]				怪物的实际生命值 + 1
//		x1					怪物横坐标														y1					怪物纵坐标
//		xm[id]				怪物实际横坐标											    	ym[id]				怪物实际纵坐标
//		Vy2					怪物当前速度（整型）											max					最大速度
//		yfork				武器横坐标														xfork				武器纵坐标
//		nice[id]				怪物善恶值													    ato[id]				怪物当前状态为巡逻 / 发现敌人
//		fag[0]				是前往目标的标志												fag[1]				是第一个目标坐标
//		fag[2]				是第二个目标坐标												fag[3]				是怪物是否落地
//		aY[id]				怪物纵向加速度													axmonst[id]			怪物横向加速度
//		actmonst[id]			怪物当前动作模型                                                d[][] = id            怪物在游戏中逻辑层的模型
//		vY[id]               怪物当前纵向速度(浮点数)										Vy2[id]				怪物当前纵向速度（整型）
//		hurteen[id]          怪物受伤标志                                                    dieword[id]         当怪物战斗中途触发的对话
//		axmonst[id]          怪物横向加速度                                                  conmonst[id]        怪物左右朝向
//		V1monst[id]          怪物横向速度（浮点数）                                          V2monst[id]         怪物横向速度整型数
//		meun                 怪物对话深度（层次）                                            acttime[id]         当前动作持续的帧数（时间）*/
//	char con, die, nice, ato, dieword;
//	int xm, i, ym, act, hurteen, acttime, meun, Vy2, yfork, xfork, V2;
//	float axmonst, aY, vY, V1;
//
//}mon[怪物总数];

short int eit, 
xbotton,
ybotton,
xauto,
ydauto,
xboxz,
yboxz,
eid
;

unsigned char
act1 = 0,
act3 = 0,
photodandy,
 firepot,
ato[怪物总数] = { 空 },
die[怪物总数] = { 空 },
dhurt[怪物总数] = { 空 },
boxid[50] = { 空 },
tac[19][39] = { 15 },//拓麻歌子
dieword = 0,
box[怪物总数] = { 空 },
keyhit[100] = { 空 },
shopper,
choose1[10] = { 0 },//抽卡
choose2[10] = { 0 },
age,
key,
board,
handcard1,
handcard2,
hand1[10],
hand2[10],
key1,
jj1,
creater,
hurteen[怪物总数]//受到伤害时效果 
, meun
, trad
, hdso
, vill
, talk
,*deliver
;
unsigned int  ob[100][3] = { 空 };//物品文本以及数量

unsigned int
x,
y,
cgsave,
cg,
cgx,
cgy,
*pt,
tacx = 11,
tacy = 15,
xb[50] = { 空 },
yb[50] = { 空 },
cgend[10000],
xc1,
yc1,
xcar,
ycar,
r[怪物总数] = { 空 },
room = 0,
comp = 0,
i[怪物总数] = { 空 },
xm[怪物总数] = { 空 },
ym[怪物总数] = { 空 },
ai[怪物总数] = { 空 },
xbox[50] = { 空 },
ybox[50] = { 空 },
fag[40][4] = { 空 },
mop[怪物总数] = { 空 },
bladehurt,

st[500][500] = { 空 },
acttime[100] = { 空 }
, talktime,
missx,
missy,
missid,
cgrah
;

float
ab[20] = { 空 },
vb[20] = { 空 },
vxb[20] = { 空 },
aY[怪物总数],
vY[怪物总数],
axmonst[怪物总数] = { 空 },
V1monst[怪物总数] = { 空 },
ayfly[怪物总数] = { 空 },
Vy1monst[怪物总数] = { 空 };
int
V2monst[怪物总数] = { 空 },
Vy2monst[怪物总数] = { 空 },
heart1 = 10,heart2 = 15,
max, con, m1, nice[怪物总数] = { 空 },
ni[怪物总数],
xoc,
yoc,
conmonst[怪物总数] = { 空 },
actmonst[怪物总数] = { 空 },
cooldown[怪物总数] = { 空 }
, visual[50][50] = { 0 }
;
unsigned int
flagx[10] = {0},
flagy[10] = {0},
fstep[10] = {0},
visualstep[50][50] = {0},

a,
b,
c = 0,
e,
f, /*f=1为落地0为空中*/
memory[20] = { 0 },
dx[5][1000][5000] = { 空 },
hearp = 0,
ep,
en = 0,
tme = 0,
numbvill,
time0,
time1,
sart,
sop;
float ax, ay;//加速度
unsigned char *p, h, u
,xtrd,
ytrd;//monst[怪物种类][怪物数量]
unsigned char trd;//可对话角色在每关出现的标志
unsigned char  mison;//任务出现时对话标志

unsigned char f1, f2;//地板
unsigned char down, o2, o3;//comp是地图比较
float L1, R1, V1, Vy1;
int	L2, R2, V2, Vy2;
unsigned char ch1, ch2, ch3 /*任务标识符号*/;
unsigned char n1[10] = "老子";
int   m2, m3, m4, sit, elc, table;/*游戏杂项属性*/
unsigned char i1 = 1, i2 = 0, i3, i4, i5, tip = 0, mps[100], hurttoon;
unsigned int mood[100][100], talkmood[10000], screenx, screeny, monst[100][100] = { 0 }, xmonst[怪物总数] = { 0 }, ymonst[怪物总数] = { 0 };
short visualx[50][50] = { 0 },visualy[50][50];
unsigned int  j2 = 0, j3[100] = { 0 }, j4, j5, tt1, tt2;//任务
unsigned int act2;//人物动作模组
unsigned char day[10], night[10], open[房间数量] = { 0 };
unsigned char tian = 'b', cartoon/*过场动画标志*/, latern = 0/*白天还是黑夜*/, shootgun;
unsigned int k = 0, youhua;/*刷新数*/







unsigned char
oj[60][65] = { "尚方EX龟速宝剑-----按住j键使用",
"尚方EX龟速宝剑-----按住j键使用",
"s2mple最喜欢的小手gun----按k瞄准，按j发射",
"创可贴（回复5体力）----不要贴在奇怪的地方啊",
"手gun子弹----嗯一般不会卡壳"
};








//物品数量

unsigned char txt[60][100] =
{
	"头疼头疼头疼，老子一醒来咋就到这破地方了",
	"头疼头疼头疼，老子一醒来咋就到这破地方了",
	"附近黑咕隆咚的，不像啥好地方，先找找出路吧",
	"哎等等，英俊的老子咋变像素人了，wdnmd",
	"有病没病走两步（a，d键控制方向，按住可用波纹疾走）",
	"停！停！停！停,有东西！（按s可与附近物体互动）",
	"老子一小跳，人类一大跳（按w跳跃）",
	"前面个好像有个人，我去问问他吧（靠近后按住s互动）",
	"一个箱子，一个按钮，当他们到一起。。。。会发生什么? ",
	"怎么感觉走进了一条死路啊？咋连个门都没有 ",
	"算了先不玩了退游戏歇会吧（按ESC键寻找退游戏的方式）",
	"回来了。。。。。。。                                ",
	"还真是安静。。。。。                                ",
	"我的面前为什么会有个死人啊                          ",
	"有点恐怖                                            ",
	"感觉此地不宜久留                                    ",
	"等等……                                            ",
	"你们是谁？                                          ",
	"头疼头疼头疼，老子一醒来咋就到这破地方了            ",//18
	"附近黑咕隆咚的，不像啥好地方，先找找出路吧		     ",//19
	"偶我是被关进来的啊！!!                              ",
	"这些人真是可恶啊！                                  ",
	"门锁上了                                            ",//22
	"得想个办法打开这个门啊                              ",
	"emmmm丢块石头砸到按钮啥的？                         ",
	"试一下呗                                            ",
	"等等！有人来了                                      ",//26
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",


};

//剧情文本


unsigned char montalk[200][80] =
{

	"哇！你是怎么来到这里的? ",

	"哇！你是怎么来到这里的? ",//1

	//"这里很久没有人拜访过了\n     \t\t\t     ",

	"    emmmm看你的样子好像不是本地人把 ",

	"我也不知道怎么就来到了这个世界了，你能告诉我这是哪里吗？（按1）",

	"我最近手头有点紧，你能帮帮我吗？(按3) ",

	"                    溜了溜了~~~（按0继续游戏） ",//5

	"你是谁！为什么会出现在我家！",//6

	"说！你到底是谁！ ",

	"不说的话我就揍你 ",

	" Emmmm你这装扮不像本地人········· ",

	"估计你应该不是王国的走狗 ",

	"但也不排除你不是他们的奸细！",

	"说！你到底是来干嘛的 ",

	"                 我走错了！，我只是来参观的（按1）",

	"                 我是来给小怡送信的，村头小哥让我来的（按3）",//14

	"蛤！这里就是整个大陆最大的明珠！安格斯——浦东！",//15

	"不过看你的样子也不像这片大陆上的人 ",

	"马上这栋房子就要被国王的骑士拆迁了 ",

	"这里据说是国王最喜欢的土地，果然还说要修建——呢啥····· ",

	"偶！对了，叫井屏！咱不是文化人，也不知道那是哈 ",

	"但是我这次一定能得到国王的赏赐成为男爵吧！",

	"                   好的了解~（按0继续游戏） ",//21

	"讲真的我手头上也比较紧 ",//22

	"毕竟骑士拆迁队还没有来过 ",

	"但是任务还是有的 ",

	"这任务比较私密····· ",

	"emmmmmm ",

	"你懂的··········",

	"emmmmmmm ",

	"就是······",

	"啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊",

	"欸欸欸欸你别走啊~！",

	"就是我。。我。。我一直喜。。。。。。。。。。",

	"喜欢我们村的小怡！！！！！",

	"md羞死老子了！",

	"不！许！tm！的！给！老！子！笑！",

	"总之就是这样，给老子把“情书”送给ta！！",

	"事成之后奖励大大滴有！",

	"你问奖励有多少？500金币！",

	"md我堂堂拆二代500金币还是出的起的！",

	"总之就是这样了，信给我拿好",

	"开心接受，有钱不赚是傻子（按1）",

	"大噶口头瓦鲁，老夫可是正人君子！（按0继续游戏）",//42

	"蛤？给小怡的信？",//43

	"我老弟这么出息了吗",

	"我不信",

	"把信给我看看！",

	"。。。。。",

	"。。。。。",

	"。。。。。",

	"还真是我老弟的字!",

	"写的还挺肉麻",

	"什么叫“给这世界上最可爱的小怡”",

	"。。。。。。",

	"蛤蛤蛤，笑死我了",

	"你可千万别告诉他我看过信了",

	"你问我小怡在哪？",

	"那丫头就在我这房子后面的房子里",

	"我俩兄弟打小和ta就是邻居",

	"老熟了",

	"总之就这样吧，一路顺风 ",

	"这份艰巨的任务就交给你了啊，兄嘚！",

	"可千万别被人发现啊",

	"小怡她家就在离这不远处，顺着路走就到了，一路顺风~",//63

	" 正你大爷！你知道了我的秘密，",//64

	"不想去也得去！",

	"要不然，嘿嘿，你就完蛋了~~",

	"哎哎哎大哥别打脸，你就行行好",

	"帮小弟一次吧:)",


	"我的人生幸福可全在你手上拉",

	"有钱赚他不香吗~ ",

	"小怡她家就在离这不远处，顺着路走就到了，一路顺风~ ",

	"还没打算走吗？走吧走吧，走完了就被发现了",

	"我也不知道怎么就来到了这个世界了，你能告诉我这是哪里吗？（按1）",

	"溜了溜了~~~（按0继续游戏）",//74

	"蛤！这里就是整个大陆最大的明珠！安格斯——浦东！",//75

	"不过看你的样子也不像这片大陆上的人",

	"马上这栋房子就要被国王的骑士拆迁了",


	"这里据说是国王最喜欢的土地，果然还说要修建——呢啥·····",

		"但是我这次一定能得到国王的赏赐成为男爵吧！",

		"好的了解~（按0继续游戏）",//80

		"（咂舌）这里可是好久没有来过活人了",//81

		"我！巨人王哈德所，当年可是国王的挚友，为国王立下汗马功劳！",

		"为了击退怪物，我看守这里",

		"不知道外面究竟怎么样了",

		"我其实也不知道，我只是个穿越者（按1）     我可是国王的亲信，你必须得帮助我(按3)",

		"溜了溜了~~~（按0继续游戏）",

		"你好你好你好",//87

		"md终于遇到活人了，这年头生意真不好做，我是这里的商人，请问有什么事吗？",//88

		"welcome！ 啊哈是你啊，咱又见面了。",

		"我需要购买物品吗？（按1进入物品购买）",//90

		"我其实也不大知道",//91

		"但我知道你背后肯定是死路了",

		"如果你想继续往前走，就穿过我身后的这扇门（在门内按住s进入门）",

		"不过据说下面会有可怕的人",

		"当然你也别问我下面会有什么人，lxt就是这么设计的，你问他去",

		"你问我lxt是谁？，emmmm我刚才什么都没说啊:）",

		"好的我说累了（按0继续游戏）",//97

		"总算抓到你了",//98

		"我就说嘛，犯人肯定会回到现场的",

		"少说废话，我说是你就是你，给我把他嘴堵上！",

		"老大，我们终于抓到个替死鬼，可以回去跟国王交差了",

		"哈哈，要不是这货突然闯进来，我还在想咱俩还要不要回去",

		"正好他就蹦出来了,带走带走 （按0继续游戏）",//103

		"你们把最近作乱的妖人抓回来了吗",//104

		"很好！把他拖下去我要亲自审问他",
		"（按0继续游戏）",//106

		"像你这种下贱的替死鬼，是根本不配和我们国王对话的",//107

		"等一会国王来审问你",

		"你大喊‘布只道’这个名字就行，只要你说清楚这个",

		"国王就会明白，你的特殊性！",

		"然后你才有资格向我们国王交流，懂了吧？",

		"国王驾到~~（按0继续游戏）",//112

		"你好啊，杀人魔，那么在我们对你动粗之前你有没有什么要说的",//113

		"“布只道。”（两边用刑的侍卫在盯着你 你没有其他选则 按1继续）",//114 talkf(113,114);

		"嗯看来是不大想说",//115

		"“布值道！”（两边用刑的侍卫在盯着你 你没有其他选则 按4继续）",//116 talkf(115,116);

		"上刑！",//117

		"“布之刀！！！”（两边用刑的侍卫在盯着你 你没有其他选则 按2继续）"//118 talkf(117,118);
		,
		"还嘴硬，我还不信了",

		"“部只道！！！！！啊啊啊啊啊啊！！！！！”（按6继续）", //talkf(119,120);

		"陛下犯人晕过去了！",

		"这么快就晕了？这就是所谓的杀人魔？",

		"。。。。。。。。。。。",

		"没错，我的陛下，我亲眼看到他杀杀。。 杀。。。的人",

		"行吧，我还有要事在身，这杀人魔有什么情况，随时向我汇报",

		"好的陛下！（按0继续游戏）",//  talkf(121,126);

		"那就先把这货在这晾着吧",

		"行行行！走喽（按0继续游戏）", //talkf(127, 128);

		"这几天过的怎么样啊？",

		"是不是很想吃香的喝辣的啊？",

		"好！国王特赦就给你这个机会吧",

		"把你留在这里也是个祸患",

		"所以我们特意向国王要了份美差给你",

		"可不要“辜负”我们的“好心“啊",

		"带走带走！（按0继续游戏）",//talkf(129,135);
		"",
		"",
		"",
		"", 
		"",

};


//unsigned char stxt[1][60] = "攻击卡：对敌人造成5点伤害";








//技能
 void userpc(int x2, int y2) //暂定检测id为10
{
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	int id = 电脑;
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//15
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//17
	if (dx[0][y2][x2 + 17] == 0)dx[0][y2][x2 + 17] = id;//
	y2++;
	if (dx[0][y2][x2] == 0)dx[0][y2][x2] = id;//1
	if (dx[0][y2][x2 + 1] == 0)dx[0][y2][x2 + 1] = id;//2
	if (dx[0][y2][x2 + 2] == 0)dx[0][y2][x2 + 2] = id;//3
	if (dx[0][y2][x2 + 3] == 0)dx[0][y2][x2 + 3] = id;//4
	if (dx[0][y2][x2 + 4] == 0)dx[0][y2][x2 + 4] = id;//5
	if (dx[0][y2][x2 + 5] == 0)dx[0][y2][x2 + 5] = id;//6
	if (dx[0][y2][x2 + 6] == 0)dx[0][y2][x2 + 6] = id;//7
	if (dx[0][y2][x2 + 7] == 0)dx[0][y2][x2 + 7] = id;//8
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//10
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//18
	if (dx[0][y2][x2 + 18] == 0)dx[0][y2][x2 + 18] = id;//

	y2++;
	if (dx[0][y2][x2] == 0)dx[0][y2][x2] = id;//1
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//10
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//15
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//17
	if (dx[0][y2][x2 + 17] == 0)dx[0][y2][x2 + 17] = id;//
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//18
	if (dx[0][y2][x2 + 18] == 0)dx[0][y2][x2 + 18] = id;//
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//19
	if (dx[0][y2][x2 + 19] == 0)dx[0][y2][x2 + 19] = id;//
	y2++;
	if (dx[0][y2][x2] == 0)dx[0][y2][x2] = id;//1
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//10
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//17
	y2++;
	if (dx[0][y2][x2] == 0)dx[0][y2][x2] = id;//1
	if (dx[0][y2][x2 + 1] == 0)dx[0][y2][x2 + 1] = id;//2
	if (dx[0][y2][x2 + 2] == 0)dx[0][y2][x2 + 2] = id;//3
	if (dx[0][y2][x2 + 3] == 0)dx[0][y2][x2 + 3] = id;//4
	if (dx[0][y2][x2 + 4] == 0)dx[0][y2][x2 + 4] = id;//5
	if (dx[0][y2][x2 + 5] == 0)dx[0][y2][x2 + 5] = id;//6
	if (dx[0][y2][x2 + 6] == 0)dx[0][y2][x2 + 6] = id;//7
	if (dx[0][y2][x2 + 7] == 0)dx[0][y2][x2 + 7] = id;//8
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//10
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//15
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//17
	if (dx[0][y2][x2 + 17] == 0)dx[0][y2][x2 + 17] = id;//
	y2++;
	if (dx[0][y2][x2] == 0)dx[0][y2][x2] = id;//1
	if (dx[0][y2][x2 + 1] == 0)dx[0][y2][x2 + 1] = id;//2
	if (dx[0][y2][x2 + 2] == 0)dx[0][y2][x2 + 2] = id;//3
	if (dx[0][y2][x2 + 3] == 0)dx[0][y2][x2 + 3] = id;//4
	if (dx[0][y2][x2 + 4] == 0)dx[0][y2][x2 + 4] = id;//5
	if (dx[0][y2][x2 + 5] == 0)dx[0][y2][x2 + 5] = id;//6
	if (dx[0][y2][x2 + 6] == 0)dx[0][y2][x2 + 6] = id;//7
	if (dx[0][y2][x2 + 7] == 0)dx[0][y2][x2 + 7] = id;//8
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//10
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//15
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//17
	if (dx[0][y2][x2 + 17] == 0)dx[0][y2][x2 + 17] = id;//
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//13
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//18
	if (dx[0][y2][x2 + 18] == 0)dx[0][y2][x2 + 18] = id;//12
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//19

	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//11
	if (dx[0][y2][x2 + 11] == 0)dx[0][y2][x2 + 11] = id;//12
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//13
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//14
	if (dx[0][y2][x2 + 18] == 0)dx[0][y2][x2 + 18] = id;//
	if (dx[0][y2][x2 - 1] == 0)dx[0][y2][x2 - 1] = id;//-3
	if (dx[0][y2][x2 - 3] == 0)dx[0][y2][x2 - 3] = id;//-5
	if (dx[0][y2][x2 - 5] == 0)dx[0][y2][x2 - 5] = id;//-7
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//
	y2++;
	if (dx[0][y2][x2] == 0)dx[0][y2][x2] = id;//1
	if (dx[0][y2][x2 + 1] == 0)dx[0][y2][x2 + 1] = id;//2
	if (dx[0][y2][x2 + 2] == 0)dx[0][y2][x2 + 2] = id;//3
	if (dx[0][y2][x2 + 3] == 0)dx[0][y2][x2 + 3] = id;//4
	if (dx[0][y2][x2 + 4] == 0)dx[0][y2][x2 + 4] = id;//5
	if (dx[0][y2][x2 + 5] == 0)dx[0][y2][x2 + 5] = id;//6
	if (dx[0][y2][x2 + 6] == 0)dx[0][y2][x2 + 6] = id;//7
	if (dx[0][y2][x2 + 7] == 0)dx[0][y2][x2 + 7] = id;//8
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//10
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//15
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//17
	if (dx[0][y2][x2 + 17] == 0)dx[0][y2][x2 + 17] = id;//
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//13
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//18
	if (dx[0][y2][x2 + 18] == 0)dx[0][y2][x2 + 18] = id;//12
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//19

	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//11
	if (dx[0][y2][x2 + 11] == 0)dx[0][y2][x2 + 11] = id;//12
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//13
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//14
	if (dx[0][y2][x2 + 18] == 0)dx[0][y2][x2 + 18] = id;//
	if (dx[0][y2][x2 - 1] == 0)dx[0][y2][x2 - 1] = id;//-3
	if (dx[0][y2][x2 - 3] == 0)dx[0][y2][x2 - 3] = id;//-5
	if (dx[0][y2][x2 - 5] == 0)dx[0][y2][x2 - 5] = id;//-7
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//
	if (dx[0][y2][x2 - 2] == 0)dx[0][y2][x2 - 2] = id;//-4
	if (dx[0][y2][x2 - 4] == 0)dx[0][y2][x2 - 4] = id;//-6
	if (dx[0][y2][x2 - 6] == 0)dx[0][y2][x2 - 6] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//13
	if (dx[0][y2][x2 + 11] == 0)dx[0][y2][x2 + 11] = id;//12
	if (dx[0][y2][x2 + 18] == 0)dx[0][y2][x2 + 18] = id;//12
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//15
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//17
	if (dx[0][y2][x2 + 17] == 0)dx[0][y2][x2 + 17] = id;//
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//13
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//18
	if (dx[0][y2][x2 + 18] == 0)dx[0][y2][x2 + 18] = id;//12
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//19
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//11
	if (dx[0][y2][x2 + 11] == 0)dx[0][y2][x2 + 11] = id;//12
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//13
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//14
	if (dx[0][y2][x2 + 18] == 0)dx[0][y2][x2 + 18] = id;//
}

void bookrack(int x2, int y2)
{ x2 = x2 + 30 + 30;y2 = 600 - y2;
int id = 15;
dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;dx[0][y2 + 0][x2 + 7] = id;dx[0][y2 + 0][x2 + 8] = id;
dx[0][y2 + 0][x2 + 9] = id;dx[0][y2 + 0][x2 + 10] = id;dx[0][y2 + 0][x2 + 11] = id;dx[0][y2 + 0][x2 + 12] = id;dx[0][y2 + 0][x2 + 13] = id;dx[0][y2 + 0][x2 + 14] = id;dx[0][y2 + 0][x2 + 15] = id;dx[0][y2 + 0][x2 + 16] = id;dx[0][y2 + 0][x2 + 17] = id;
dx[0][y2 + 0][x2 + 18] = id;dx[0][y2 + 0][x2 + 19] = id;dx[0][y2 + 0][x2 + 20] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 3] = id;dx[0][y2 + 1][x2 + 4] = id;dx[0][y2 + 1][x2 + 6] = id;dx[0][y2 + 1][x2 + 7] = id;dx[0][y2 + 1][x2 + 10] = id;
dx[0][y2 + 1][x2 + 12] = id;dx[0][y2 + 1][x2 + 13] = id;dx[0][y2 + 1][x2 + 16] = id;dx[0][y2 + 1][x2 + 17] = id;dx[0][y2 + 1][x2 + 18] = id;dx[0][y2 + 1][x2 + 20] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 3] = id;dx[0][y2 + 2][x2 + 4] = id;
dx[0][y2 + 2][x2 + 6] = id;dx[0][y2 + 2][x2 + 7] = id;dx[0][y2 + 2][x2 + 10] = id;dx[0][y2 + 2][x2 + 12] = id;dx[0][y2 + 2][x2 + 13] = id;dx[0][y2 + 2][x2 + 16] = id;dx[0][y2 + 2][x2 + 17] = id;dx[0][y2 + 2][x2 + 18] = id;dx[0][y2 + 2][x2 + 20] = id;
dx[0][y2 + 3][x2 + 0] = id;dx[0][y2 + 3][x2 + 3] = id;dx[0][y2 + 3][x2 + 4] = id;dx[0][y2 + 3][x2 + 6] = id;dx[0][y2 + 3][x2 + 7] = id;dx[0][y2 + 3][x2 + 10] = id;dx[0][y2 + 3][x2 + 12] = id;dx[0][y2 + 3][x2 + 13] = id;dx[0][y2 + 3][x2 + 16] = id;
dx[0][y2 + 3][x2 + 17] = id;dx[0][y2 + 3][x2 + 18] = id;dx[0][y2 + 3][x2 + 20] = id;dx[0][y2 + 4][x2 + 0] = id;dx[0][y2 + 4][x2 + 1] = id;dx[0][y2 + 4][x2 + 2] = id;dx[0][y2 + 4][x2 + 3] = id;dx[0][y2 + 4][x2 + 4] = id;dx[0][y2 + 4][x2 + 5] = id;
dx[0][y2 + 4][x2 + 6] = id;dx[0][y2 + 4][x2 + 7] = id;dx[0][y2 + 4][x2 + 8] = id;dx[0][y2 + 4][x2 + 9] = id;dx[0][y2 + 4][x2 + 10] = id;dx[0][y2 + 4][x2 + 11] = id;dx[0][y2 + 4][x2 + 12] = id;dx[0][y2 + 4][x2 + 13] = id;dx[0][y2 + 4][x2 + 14] = id;
dx[0][y2 + 4][x2 + 15] = id;dx[0][y2 + 4][x2 + 16] = id;dx[0][y2 + 4][x2 + 17] = id;dx[0][y2 + 4][x2 + 18] = id;dx[0][y2 + 4][x2 + 19] = id;dx[0][y2 + 4][x2 + 20] = id;dx[0][y2 + 5][x2 + 0] = id;dx[0][y2 + 5][x2 + 4] = id;dx[0][y2 + 5][x2 + 5] = id;
dx[0][y2 + 5][x2 + 7] = id;dx[0][y2 + 5][x2 + 8] = id;dx[0][y2 + 5][x2 + 10] = id;dx[0][y2 + 5][x2 + 12] = id;dx[0][y2 + 5][x2 + 13] = id;dx[0][y2 + 5][x2 + 17] = id;dx[0][y2 + 5][x2 + 18] = id;dx[0][y2 + 5][x2 + 20] = id;dx[0][y2 + 6][x2 + 0] = id;
dx[0][y2 + 6][x2 + 3] = id;dx[0][y2 + 6][x2 + 4] = id;dx[0][y2 + 6][x2 + 7] = id;dx[0][y2 + 6][x2 + 8] = id;dx[0][y2 + 6][x2 + 10] = id;dx[0][y2 + 6][x2 + 13] = id;dx[0][y2 + 6][x2 + 14] = id;dx[0][y2 + 6][x2 + 17] = id;dx[0][y2 + 6][x2 + 18] = id;
dx[0][y2 + 6][x2 + 20] = id;dx[0][y2 + 7][x2 + 0] = id;dx[0][y2 + 7][x2 + 2] = id;dx[0][y2 + 7][x2 + 3] = id;dx[0][y2 + 7][x2 + 7] = id;dx[0][y2 + 7][x2 + 8] = id;dx[0][y2 + 7][x2 + 10] = id;dx[0][y2 + 7][x2 + 14] = id;dx[0][y2 + 7][x2 + 15] = id;
dx[0][y2 + 7][x2 + 17] = id;dx[0][y2 + 7][x2 + 18] = id;dx[0][y2 + 7][x2 + 20] = id;dx[0][y2 + 8][x2 + 0] = id;dx[0][y2 + 8][x2 + 1] = id;dx[0][y2 + 8][x2 + 2] = id;dx[0][y2 + 8][x2 + 3] = id;dx[0][y2 + 8][x2 + 4] = id;dx[0][y2 + 8][x2 + 5] = id;
dx[0][y2 + 8][x2 + 6] = id;dx[0][y2 + 8][x2 + 7] = id;dx[0][y2 + 8][x2 + 8] = id;dx[0][y2 + 8][x2 + 9] = id;dx[0][y2 + 8][x2 + 10] = id;dx[0][y2 + 8][x2 + 11] = id;dx[0][y2 + 8][x2 + 12] = id;dx[0][y2 + 8][x2 + 13] = id;dx[0][y2 + 8][x2 + 14] = id;
dx[0][y2 + 8][x2 + 15] = id;dx[0][y2 + 8][x2 + 16] = id;dx[0][y2 + 8][x2 + 17] = id;dx[0][y2 + 8][x2 + 18] = id;dx[0][y2 + 8][x2 + 19] = id;dx[0][y2 + 8][x2 + 20] = id;dx[0][y2 + 9][x2 + 0] = id;dx[0][y2 + 9][x2 + 1] = id;dx[0][y2 + 9][x2 + 2] = id;
dx[0][y2 + 9][x2 + 3] = id;dx[0][y2 + 9][x2 + 4] = id;dx[0][y2 + 9][x2 + 5] = id;dx[0][y2 + 9][x2 + 6] = id;dx[0][y2 + 9][x2 + 7] = id;dx[0][y2 + 9][x2 + 8] = id;dx[0][y2 + 9][x2 + 9] = id;dx[0][y2 + 9][x2 + 10] = id;dx[0][y2 + 9][x2 + 11] = id;
dx[0][y2 + 9][x2 + 12] = id;dx[0][y2 + 9][x2 + 13] = id;dx[0][y2 + 9][x2 + 14] = id;dx[0][y2 + 9][x2 + 15] = id;dx[0][y2 + 9][x2 + 16] = id;dx[0][y2 + 9][x2 + 17] = id;dx[0][y2 + 9][x2 + 18] = id;dx[0][y2 + 9][x2 + 19] = id;dx[0][y2 + 9][x2 + 20] = id;
dx[0][y2 + 10][x2 + 0] = id;dx[0][y2 + 10][x2 + 10] = id;dx[0][y2 + 10][x2 + 20] = id;dx[0][y2 + 11][x2 + 0] = id;dx[0][y2 + 11][x2 + 1] = id;dx[0][y2 + 11][x2 + 2] = id;dx[0][y2 + 11][x2 + 3] = id;dx[0][y2 + 11][x2 + 4] = id;dx[0][y2 + 11][x2 + 5] = id;
dx[0][y2 + 11][x2 + 6] = id;dx[0][y2 + 11][x2 + 7] = id;dx[0][y2 + 11][x2 + 8] = id;dx[0][y2 + 11][x2 + 9] = id;dx[0][y2 + 11][x2 + 10] = id;dx[0][y2 + 11][x2 + 11] = id;dx[0][y2 + 11][x2 + 12] = id;dx[0][y2 + 11][x2 + 13] = id;dx[0][y2 + 11][x2 + 14] = id;
dx[0][y2 + 11][x2 + 15] = id;dx[0][y2 + 11][x2 + 16] = id;dx[0][y2 + 11][x2 + 17] = id;dx[0][y2 + 11][x2 + 18] = id;dx[0][y2 + 11][x2 + 19] = id;dx[0][y2 + 11][x2 + 20] = id;

}

void tree(int x2, int y2)
{
	int id = 背景;
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	if (dx[0][y2][x2 + 1] == 0)dx[0][y2][x2 + 1] = id;//2
	if (dx[0][y2][x2 + 2] == 0)dx[0][y2][x2 + 2] = id;//3
	if (dx[0][y2][x2 + 3] == 0)dx[0][y2][x2 + 3] = id;//
	y2++;
	if (dx[0][y2][x2 + 1] == 0)dx[0][y2][x2 + 1] = id;//2
	if (dx[0][y2][x2 + 2] == 0)dx[0][y2][x2 + 2] = id;//3
	if (dx[0][y2][x2 + 3] == 0)dx[0][y2][x2 + 3] = id;//
	if (dx[0][y2][x2 + 4] == 0)dx[0][y2][x2 + 4] = id;//5
	if (dx[0][y2][x2 + 5] == 0)dx[0][y2][x2 + 5] = id;//6
	if (dx[0][y2][x2 + 6] == 0)dx[0][y2][x2 + 6] = id;//7
	if (dx[0][y2][x2 + 7] == 0)dx[0][y2][x2 + 7] = id;//8
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//
	if (dx[0][y2][x2 - 1] == 0)dx[0][y2][x2 - 1] = id;//-2
	if (dx[0][y2][x2 - 2] == 0)dx[0][y2][x2 - 2] = id;//-3
	if (dx[0][y2][x2 - 3] == 0)dx[0][y2][x2 - 3] = id;//
	y2++;
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//10
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//11
	if (dx[0][y2][x2 + 11] == 0)dx[0][y2][x2 + 11] = id;//12
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//
	if (dx[0][y2][x2 - 3] == 0)dx[0][y2][x2 - 3] = id;//
	if (dx[0][y2][x2 - 4] == 0)dx[0][y2][x2 - 4] = id;//-5
	if (dx[0][y2][x2 - 5] == 0)dx[0][y2][x2 - 5] = id;//-6
	if (dx[0][y2][x2 - 6] == 0)dx[0][y2][x2 - 6] = id;//-7
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//-8
	if (dx[0][y2][x2 - 8] == 0)dx[0][y2][x2 - 8] = id;//-9
	if (dx[0][y2][x2 - 9] == 0)dx[0][y2][x2 - 9] = id;//-10
	if (dx[0][y2][x2 - 10] == 0)dx[0][y2][x2 - 10] = id;//-11
	if (dx[0][y2][x2 - 11] == 0)dx[0][y2][x2 - 11] = id;//
	y2++;
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//13
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//
	if (dx[0][y2][x2 - 11] == 0)dx[0][y2][x2 - 11] = id;//12
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//13
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//-11
	if (dx[0][y2][x2 - 11] == 0)dx[0][y2][x2 - 11] = id;//-12
	if (dx[0][y2][x2 - 12] == 0)dx[0][y2][x2 - 12] = id;//-13
	if (dx[0][y2][x2 - 13] == 0)dx[0][y2][x2 - 13] = id;//-14
	if (dx[0][y2][x2 - 14] == 0)dx[0][y2][x2 - 14] = id;//-15
	if (dx[0][y2][x2 - 15] == 0)dx[0][y2][x2 - 15] = id;//-16
	if (dx[0][y2][x2 - 16] == 0)dx[0][y2][x2 - 16] = id;//
	y2++;
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//15
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//
	if (dx[0][y2][x2 - 16] == 0)dx[0][y2][x2 - 16] = id;//-17
	if (dx[0][y2][x2 - 17] == 0)dx[0][y2][x2 - 17] = id;//-18
	if (dx[0][y2][x2 - 18] == 0)dx[0][y2][x2 - 18] = id;//-19
	if (dx[0][y2][x2 - 19] == 0)dx[0][y2][x2 - 19] = id;//-20
	if (dx[0][y2][x2 - 20] == 0)dx[0][y2][x2 - 20] = id;//
	y2++;
	if (dx[0][y2][x2 - 20] == 0)dx[0][y2][x2 - 20] = id;//-21
	if (dx[0][y2][x2 - 21] == 0)dx[0][y2][x2 - 21] = id;//-22
	if (dx[0][y2][x2 - 22] == 0)dx[0][y2][x2 - 22] = id;//
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//17
	if (dx[0][y2][x2 + 17] == 0)dx[0][y2][x2 + 17] = id;//
	y2++;
	if (dx[0][y2][x2 - 22] == 0)dx[0][y2][x2 - 22] = id;//-23
	if (dx[0][y2][x2 - 23] == 0)dx[0][y2][x2 - 23] = id;//
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//17
	if (dx[0][y2][x2 + 17] == 0)dx[0][y2][x2 + 17] = id;//
	y2++;
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//17   
	if (dx[0][y2][x2 - 22] == 0)dx[0][y2][x2 - 22] = id;//-23
	y2++;
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//
	if (dx[0][y2][x2 - 21] == 0)dx[0][y2][x2 - 21] = id;//-22
	if (dx[0][y2][x2 - 22] == 0)dx[0][y2][x2 - 22] = id;//
	if (dx[0][y2][x2 - 23] == 0)dx[0][y2][x2 - 23] = id;//23
	y2++;
	if (dx[0][y2][x2 - 24] == 0)dx[0][y2][x2 - 24] = id;//
	if (dx[0][y2][x2 - 21] == 0)dx[0][y2][x2 - 21] = id;//-20
	if (dx[0][y2][x2 - 20] == 0)dx[0][y2][x2 - 20] = id;//-19
	if (dx[0][y2][x2 - 19] == 0)dx[0][y2][x2 - 19] = id;//-18
	if (dx[0][y2][x2 - 18] == 0)dx[0][y2][x2 - 18] = id;//
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	y2++;
	if (dx[0][y2][x2 - 24] == 0)dx[0][y2][x2 - 24] = id;//
	if (dx[0][y2][x2 - 25] == 0)dx[0][y2][x2 - 25] = id;//
	if (dx[0][y2][x2 - 16] == 0)dx[0][y2][x2 - 16] = id;//-17
	if (dx[0][y2][x2 - 17] == 0)dx[0][y2][x2 - 17] = id;//-18
	if (dx[0][y2][x2 - 15] == 0)dx[0][y2][x2 - 15] = id;//-14
	if (dx[0][y2][x2 - 14] == 0)dx[0][y2][x2 - 14] = id;//
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//15
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//-16
	if (dx[0][y2][x2 + 17] == 0)dx[0][y2][x2 + 17] = id;//-22
	y2++;
	if (dx[0][y2][x2 - 25] == 0)dx[0][y2][x2 - 25] = id;//
	if (dx[0][y2][x2 - 26] == 0)dx[0][y2][x2 - 26] = id;//-27
	if (dx[0][y2][x2 - 27] == 0)dx[0][y2][x2 - 27] = id;//
	if (dx[0][y2][x2 + 18] == 0)dx[0][y2][x2 + 18] = id;//19
	if (dx[0][y2][x2 + 19] == 0)dx[0][y2][x2 + 19] = id;//20
	if (dx[0][y2][x2 + 20] == 0)dx[0][y2][x2 + 20] = id;//
	y2++;
	if (dx[0][y2][x2 - 27] == 0)dx[0][y2][x2 - 27] = id;//
	if (dx[0][y2][x2 - 28] == 0)dx[0][y2][x2 - 28] = id;//
	if (dx[0][y2][x2 + 20] == 0)dx[0][y2][x2 + 20] = id;//21
	if (dx[0][y2][x2 + 21] == 0)dx[0][y2][x2 + 21] = id;//22
	if (dx[0][y2][x2 + 22] == 0)dx[0][y2][x2 + 22] = id;//23
	if (dx[0][y2][x2 + 23] == 0)dx[0][y2][x2 + 23] = id;//
	y2++;
	if (dx[0][y2][x2 - 28] == 0)dx[0][y2][x2 - 28] = id;//
	if (dx[0][y2][x2 - 29] == 0)dx[0][y2][x2 - 29] = id;//
	if (dx[0][y2][x2 + 23] == 0)dx[0][y2][x2 + 23] = id;//
	y2++;
	if (dx[0][y2][x2 - 29] == 0)dx[0][y2][x2 - 29] = id;//
	if (dx[0][y2][x2 + 23] == 0)dx[0][y2][x2 + 23] = id;//
	if (dx[0][y2][x2 + 24] == 0)dx[0][y2][x2 + 24] = id;//
	y2++;
	if (dx[0][y2][x2 - 29] == 0)dx[0][y2][x2 - 29] = id;//
	if (dx[0][y2][x2 + 24] == 0)dx[0][y2][x2 + 24] = id;//
	if (dx[0][y2][x2 + 7] == 0)dx[0][y2][x2 + 7] = id;//6
	if (dx[0][y2][x2 + 6] == 0)dx[0][y2][x2 + 6] = id;//
	y2++;
	if (dx[0][y2][x2 - 28] == 0)dx[0][y2][x2 - 28] = id;//
	if (dx[0][y2][x2 + 24] == 0)dx[0][y2][x2 + 24] = id;//
	if (dx[0][y2][x2 + 6] == 0)dx[0][y2][x2 + 6] = id;//5
	if (dx[0][y2][x2 + 5] == 0)dx[0][y2][x2 + 5] = id;//
	y2++;
	if (dx[0][y2][x2 - 28] == 0)dx[0][y2][x2 - 28] = id;//
	if (dx[0][y2][x2 - 29] == 0)dx[0][y2][x2 - 29] = id;//-30
	if (dx[0][y2][x2 - 30] == 0)dx[0][y2][x2 - 30] = id;//
	if (dx[0][y2][x2 + 24] == 0)dx[0][y2][x2 + 24] = id;//25
	if (dx[0][y2][x2 + 25] == 0)dx[0][y2][x2 + 25] = id;//
	if (dx[0][y2][x2 + 6] == 0)dx[0][y2][x2 + 6] = id;//5
	if (dx[0][y2][x2 + 5] == 0)dx[0][y2][x2 + 5] = id;//4
	if (dx[0][y2][x2 + 4] == 0)dx[0][y2][x2 + 4] = id;//3
	if (dx[0][y2][x2 + 3] == 0)dx[0][y2][x2 + 3] = id;//2
	if (dx[0][y2][x2 + 2] == 0)dx[0][y2][x2 + 2] = id;//
	y2++;
	if (dx[0][y2][x2 - 28] == 0)dx[0][y2][x2 - 28] = id;//
	if (dx[0][y2][x2 - 29] == 0)dx[0][y2][x2 - 29] = id;//-30
	if (dx[0][y2][x2 - 30] == 0)dx[0][y2][x2 - 30] = id;//
	if (dx[0][y2][x2 + 2] == 0)dx[0][y2][x2 + 2] = id;//1
	if (dx[0][y2][x2 + 1] == 0)dx[0][y2][x2 + 1] = id;//0
	if (dx[0][y2][x2] == 0)dx[0][y2][x2] = id;//-1
	if (dx[0][y2][x2 - 1] == 0)dx[0][y2][x2 - 1] = id;//-2
	if (dx[0][y2][x2 - 2] == 0)dx[0][y2][x2 - 2] = id;//
	if (dx[0][y2][x2 + 4] == 0)dx[0][y2][x2 + 4] = id;//5
	if (dx[0][y2][x2 + 5] == 0)dx[0][y2][x2 + 5] = id;//7
	if (dx[0][y2][x2 + 7] == 0)dx[0][y2][x2 + 7] = id;//8
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//
	if (dx[0][y2][x2 + 20] == 0)dx[0][y2][x2 + 20] = id;//21
	if (dx[0][y2][x2 + 21] == 0)dx[0][y2][x2 + 21] = id;//22
	if (dx[0][y2][x2 + 22] == 0)dx[0][y2][x2 + 22] = id;//23
	if (dx[0][y2][x2 + 23] == 0)dx[0][y2][x2 + 23] = id;//24
	if (dx[0][y2][x2 + 24] == 0)dx[0][y2][x2 + 24] = id;//
	y2++;
	if (dx[0][y2][x2 - 28] == 0)dx[0][y2][x2 - 28] = id;//
	if (dx[0][y2][x2 - 29] == 0)dx[0][y2][x2 - 29] = id;//-30
	if (dx[0][y2][x2 - 27] == 0)dx[0][y2][x2 - 27] = id;//
	if (dx[0][y2][x2 - 3] == 0)dx[0][y2][x2 - 3] = id;//-4
	if (dx[0][y2][x2 - 4] == 0)dx[0][y2][x2 - 4] = id;//-6
	if (dx[0][y2][x2 - 6] == 0)dx[0][y2][x2 - 6] = id;//-7
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//10
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//11
	if (dx[0][y2][x2 + 11] == 0)dx[0][y2][x2 + 11] = id;//12
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//13
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//14
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//15
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//16
	if (dx[0][y2][x2 + 16] == 0)dx[0][y2][x2 + 16] = id;//17
	if (dx[0][y2][x2 + 17] == 0)dx[0][y2][x2 + 17] = id;//18
	if (dx[0][y2][x2 + 18] == 0)dx[0][y2][x2 + 18] = id;//19
	if (dx[0][y2][x2 + 19] == 0)dx[0][y2][x2 + 19] = id;//
	y2++;
	if (dx[0][y2][x2 - 27] == 0)dx[0][y2][x2 - 27] = id;//-26
	if (dx[0][y2][x2 - 26] == 0)dx[0][y2][x2 - 26] = id;//-25
	if (dx[0][y2][x2 - 25] == 0)dx[0][y2][x2 - 25] = id;//-24
	if (dx[0][y2][x2 - 24] == 0)dx[0][y2][x2 - 24] = id;//-23
	if (dx[0][y2][x2 - 23] == 0)dx[0][y2][x2 - 23] = id;//-22
	if (dx[0][y2][x2 - 22] == 0)dx[0][y2][x2 - 22] = id;//
	if (dx[0][y2][x2 - 18] == 0)dx[0][y2][x2 - 18] = id;//-17
	if (dx[0][y2][x2 - 17] == 0)dx[0][y2][x2 - 17] = id;//-16
	if (dx[0][y2][x2 - 16] == 0)dx[0][y2][x2 - 16] = id;//-15
	if (dx[0][y2][x2 - 15] == 0)dx[0][y2][x2 - 15] = id;//-14
	if (dx[0][y2][x2 - 14] == 0)dx[0][y2][x2 - 14] = id;//-13
	if (dx[0][y2][x2 - 13] == 0)dx[0][y2][x2 - 13] = id;//-12
	if (dx[0][y2][x2 - 12] == 0)dx[0][y2][x2 - 12] = id;//-11
	if (dx[0][y2][x2 - 11] == 0)dx[0][y2][x2 - 11] = id;//-10
	if (dx[0][y2][x2 - 10] == 0)dx[0][y2][x2 - 10] = id;//-9
	if (dx[0][y2][x2 - 9] == 0)dx[0][y2][x2 - 9] = id;//
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//-6
	if (dx[0][y2][x2 - 6] == 0)dx[0][y2][x2 - 6] = id;//-5
	if (dx[0][y2][x2 - 5] == 0)dx[0][y2][x2 - 5] = id;//-4
	if (dx[0][y2][x2 - 4] == 0)dx[0][y2][x2 - 4] = id;//
	if (dx[0][y2][x2 + 11] == 0)dx[0][y2][x2 + 11] = id;//12
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//14
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//15
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//

	y2++;
	if (dx[0][y2][x2 - 22] == 0)dx[0][y2][x2 - 22] = id;//-21
	if (dx[0][y2][x2 - 21] == 0)dx[0][y2][x2 - 21] = id;//-20
	if (dx[0][y2][x2 - 20] == 0)dx[0][y2][x2 - 20] = id;//-19
	if (dx[0][y2][x2 - 19] == 0)dx[0][y2][x2 - 19] = id;//-18
	if (dx[0][y2][x2 - 18] == 0)dx[0][y2][x2 - 18] = id;//-17
	if (dx[0][y2][x2 - 17] == 0)dx[0][y2][x2 - 17] = id;//
	if (dx[0][y2][x2 - 14] == 0)dx[0][y2][x2 - 14] = id;//-13
	if (dx[0][y2][x2 - 13] == 0)dx[0][y2][x2 - 13] = id;//-12
	if (dx[0][y2][x2 - 12] == 0)dx[0][y2][x2 - 12] = id;//-11
	if (dx[0][y2][x2 - 11] == 0)dx[0][y2][x2 - 11] = id;//-10
	if (dx[0][y2][x2 - 10] == 0)dx[0][y2][x2 - 10] = id;//-9
	if (dx[0][y2][x2 + 11] == 0)dx[0][y2][x2 + 11] = id;//12
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//

	y2++;
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//
	if (dx[0][y2][x2 - 10] == 0)dx[0][y2][x2 - 10] = id;//-9
	if (dx[0][y2][x2 - 9] == 0)dx[0][y2][x2 - 9] = id;//-8
	if (dx[0][y2][x2 - 8] == 0)dx[0][y2][x2 - 8] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//
	if (dx[0][y2][x2 - 8] == 0)dx[0][y2][x2 - 8] = id;//
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//9
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//9
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//9
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//9
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//9
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//
	y2++;
	if (dx[0][y2][x2 - 7] == 0)dx[0][y2][x2 - 7] = id;//9
	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//
	if (dx[0][y2][x2 - 8] == 0)dx[0][y2][x2 - 8] = id;//
	y2++;

	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//
	if (dx[0][y2][x2 - 8] == 0)dx[0][y2][x2 - 8] = id;//
	if (dx[0][y2][x2 - 9] == 0)dx[0][y2][x2 - 9] = id;//
	y2++;

	if (dx[0][y2][x2 + 8] == 0)dx[0][y2][x2 + 8] = id;//
	if (dx[0][y2][x2 + 9] == 0)dx[0][y2][x2 + 9] = id;//10
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//
	if (dx[0][y2][x2 - 10] == 0)dx[0][y2][x2 - 10] = id;//-11
	if (dx[0][y2][x2 - 11] == 0)dx[0][y2][x2 - 11] = id;//-12
	if (dx[0][y2][x2 - 12] == 0)dx[0][y2][x2 - 12] = id;//
	if (dx[0][y2][x2 - 9] == 0)dx[0][y2][x2 - 9] = id;//
	y2++;
	if (dx[0][y2][x2 - 12] == 0)dx[0][y2][x2 - 12] = id;//
	if (dx[0][y2][x2 - 13] == 0)dx[0][y2][x2 - 13] = id;//
	if (dx[0][y2][x2 + 10] == 0)dx[0][y2][x2 + 10] = id;//
	if (dx[0][y2][x2 + 11] == 0)dx[0][y2][x2 + 11] = id;//12
	if (dx[0][y2][x2 + 12] == 0)dx[0][y2][x2 + 12] = id;//13
	if (dx[0][y2][x2 + 13] == 0)dx[0][y2][x2 + 13] = id;//14
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//
	y2++;
	if (dx[0][y2][x2 - 13] == 0)dx[0][y2][x2 - 13] = id;//-14
	if (dx[0][y2][x2 - 14] == 0)dx[0][y2][x2 - 14] = id;//-15
	if (dx[0][y2][x2 - 15] == 0)dx[0][y2][x2 - 15] = id;//-16
	if (dx[0][y2][x2 - 16] == 0)dx[0][y2][x2 - 16] = id;//14
	if (dx[0][y2][x2 + 14] == 0)dx[0][y2][x2 + 14] = id;//15
	if (dx[0][y2][x2 + 15] == 0)dx[0][y2][x2 + 15] = id;//
}

void HideCursor()
{  //定义隐藏光标函数
	HANDLE handle = GetStdHandle(STD_OUTPUT_HANDLE);
	CONSOLE_CURSOR_INFO cursor;
	cursor.bVisible = FALSE;
	cursor.dwSize = sizeof(cursor);
	SetConsoleCursorInfo(handle, &cursor);
}

void eexit(int doorl,int doorr,int doorf,int doorb)
{
	if (room > comp) {
		
		if (room - comp < 50) 
		{
			if (doorl == 0) { x = 12 + 60; }
			else
			x = doorl + 60+5; 
		} 
		
			if (room - comp == 50) 
			{
				if (doorb == 0) { y = 600 - 24 ; }
				else
				y = doorb - 8;
			}//46-22=24
	}//所有位置都是实际位置移60
	if (room < comp) {
		
		if (comp - room < 50) 
		{
			if (doorr == 0) { x = 147 + 60; }
			else
			x = doorr + 60-5; 
		}
		
			if (comp - room == 50) 
			{
				if (doorf == 0) { y = 600 - 9 ; }
				else
				y = doorf - 8; 
			}//46-37=9
	}
}

void startgame() {
	int a, b;
	
	

	
	/*HANDLE con = GetStdHandle(STD_OUTPUT_HANDLE);
	COORD buf = { 130,63 };

	
	SetConsoleScreenBufferSize(con, buf);
	system("mode con cols=120 lines=60");*/
	延迟(10);
	HANDLE hOutput;
	COORD coord = { 0,0 };
	hOutput = GetStdHandle(STD_OUTPUT_HANDLE);


	HideCursor();//定义隐藏光标函数
	day[0] = ' ';day[1] = '*';
	night[0] = ' ';night[1] = '+';
	ch1 = night[0];
	ch2 = night[1];
	
	
	for (a = 0;a < 5;a++) {
		coord.X = 53;
		coord.Y = 0;
		SetConsoleCursorPosition(hOutput, coord);
		printf("++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n");
		coord.X = 53;
		coord.Y = 9;
		SetConsoleCursorPosition(hOutput, coord);
		printf("----------------------+-----------------------------------+---------------------\n");
		coord.X = 53;
		coord.Y = 50;
		SetConsoleCursorPosition(hOutput, coord);
		printf("+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n");
		for (a = 10;a < 50;a++)
		{
			coord.Y = a;
			coord.X = 75;
			SetConsoleCursorPosition(hOutput, coord);
			printf("!");
			coord.Y = a;
			coord.X = 111;
			SetConsoleCursorPosition(hOutput, coord);
			printf("!");

		}
		for (a = 0;a < 50;a++)
		{
			coord.Y = a;
			coord.X = 53;
			SetConsoleCursorPosition(hOutput, coord);
			if (a == 18 || a == 32)
				printf("@");
			else printf("+");
			coord.Y = a;
			coord.X = 133;
			SetConsoleCursorPosition(hOutput, coord);
			printf("+");
		}
		coord.X = paperx;
		coord.Y = 2;
		SetConsoleCursorPosition(hOutput, coord);
		printf("&&&&&&&&&&&&&&&&&&\n");
		延迟(75);
		coord.X = paperx;
		coord.Y = 3;
		SetConsoleCursorPosition(hOutput, coord);
		printf("&&&&&&&&&&&&&&&&&&\n");
		延迟(75);
		coord.X = paperx;
		coord.Y = 4;
		SetConsoleCursorPosition(hOutput, coord);
		printf("&&&&&&&&&&&&&&&&&&\n");延迟(75);
		coord.X = paperx;
		coord.Y = 5;
		SetConsoleCursorPosition(hOutput, coord);
		printf("&&&&&&&&&&&&&&&&&&\n");延迟(75);
		coord.X = paperx;
		coord.Y = 6;
		SetConsoleCursorPosition(hOutput, coord);
		printf("&&&&&&&&&&&&&&&&&&\n");延迟(75);
		system("cls");

	}



	coord.X = 53;
	coord.Y = 0;
	SetConsoleCursorPosition(hOutput, coord);
	printf("++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n");
	coord.X = 53;
	coord.Y = 9;
	SetConsoleCursorPosition(hOutput, coord);
	printf("----------------------+-----------------------------------+---------------------\n");
	coord.X = 53;
	coord.Y = 50;
	SetConsoleCursorPosition(hOutput, coord);
	printf("+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n");
	for (a = 10;a < 50;a++)
	{
		coord.Y = a;
		coord.X = 75;
		SetConsoleCursorPosition(hOutput, coord);
		printf("!");
		coord.Y = a;
		coord.X = 111;
		SetConsoleCursorPosition(hOutput, coord);
		printf("!");

	}
	for (a = 0;a < 50;a++)
	{
		coord.Y = a;
		coord.X = 53;
		SetConsoleCursorPosition(hOutput, coord);
		if (a == 18 || a == 32)
			printf("@");
		else printf("+");
		coord.Y = a;
		coord.X = 133;
		SetConsoleCursorPosition(hOutput, coord);
		printf("+");
	}



	coord.X = 118;
	coord.Y = 2;
	SetConsoleCursorPosition(hOutput, coord);
	printf("绝密*开封前");
	
	/*printf("								⣿⣿⣿⣿⣿⣿⣿⣿⣿⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n");
	printf("						    	⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠹⢿⣿⣿⣿⣿⣿⡿⠋⣿⣿⣿⣿\n");
	printf("								⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠈⠻⣿⣿⡿⠏⠀⠀⣿⣿⣿⣿\n");
	printf("								⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠙⠋⠀⠀⠀⢀⣿⣿⣿⣿\n");
	printf("								⣿⣿⣷⡈⠉⠉⠉⠉⠉⠀⣀⡤⠴⠶⠶⠶⠤⣄⡀⠸⠿⠿⠛⢛\n");
	printf("								⣿⣿⣿⣿⡄⠀⠀⠀⣰⠚⠁⠀⠀⠀⠀⠀⠀⠀⠳⣄⠀⠀⢠⣾\n");
	printf("								⣿⣿⣿⣿⣷⠀⠀⡜⠁⠀⠀⠀⠀⣀⣀⣀⣀⣀⣀⠘⡆⢠⣿⣿\n");
	printf("								⣿⣿⠿⠛⠉⠀⢰⠇⠀⠰⣾⡯⠭⠭⣭⠭⡭⠭⠭⠭⢿⡀⠙⠿\n");
	printf("								⣿⣤⣀⠀⠀⠀⢸⠀⢠⣧⣤⣤⣤⠤⢼⣾⠥⣤⡤⠤⠬⡇⣠⣴\n");
	printf("								⣿⣿⣿⣿⡦⠀⢸⠀⠈⢧⡀⠁⠀⠀⡠⠛⣄⠈⠀⢀⣠⠇⣿⣿\n");
	printf("								⣿⣿⠿⠋⠀⠀⣸⡄⠀⢤⣉⠓⠚⠋⠁⡀⢸⡩⣯⡭⢿⡀⠙⠿\n");
	printf("								⣿⣷⣤⣄⡀⢼⠋⠀⠀⠀⠉⠉⠁⠀⠀⠳⣼⠇⠀⠀⣼⢹⣾⣿\n");
	printf("								⣿⣿⣿⣿⡟⠈⠳⣤⠀⠀⡀⠀⠀⣀⣀⣀⣀⣀⡀⠀⣿⡻⣿⣿\n");
	printf("								⣿⣿⣿⣿⣾⣿⣿⠞⣆⠸⡇⠚⠉⠁⠀⣿⣿⡟⠉⢁⣿⣿⣿⣿\n");
	printf("								⣿⣿⣿⣿⣿⣿⣿⣶⣿⣆⠈⠁⠀⠰⡖⠙⠛⠃⣠⣿⣿⣿⣿⣿\n");
	printf("								⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡦⣄⣀⣀⣠⣴⣾⣿⣿⣿⣿⣿⣿\n");
	printf("								⣿⣿⣿⣿⣿⣿⡿⠿⠟⠛⡛⢷⣤⣀⣠⢾⣛⠛⠿⢿⣿⣿⣿⣿\n");
	printf("								⣿⣿⣿⣿⣿⠃⠀⠀⠀⢰⠃⢸⠀⠀⠀⠘⡟⣆⠀⠀⢹⣿⣿⣿\n");
	*/










	for (a = 0;a < 8;a++) {
		coord.X = 53;
		coord.Y = 0;
		SetConsoleCursorPosition(hOutput, coord);
		printf("++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n");
		coord.X = 53;
		coord.Y = 9;
		SetConsoleCursorPosition(hOutput, coord);
		printf("----------------------+-----------------------------------+---------------------\n");
		coord.X = 53;
		coord.Y = 50;
		SetConsoleCursorPosition(hOutput, coord);
		printf("+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n");
		for (a = 10;a < 50;a++)
		{
			coord.Y = a;
			coord.X = 75;
			SetConsoleCursorPosition(hOutput, coord);
			printf("!");
			coord.Y = a;
			coord.X = 111;
			SetConsoleCursorPosition(hOutput, coord);
			printf("!");

		}
		for (a = 0;a < 50;a++)
		{
			coord.Y = a;
			coord.X = 53;
			SetConsoleCursorPosition(hOutput, coord);
			if (a == 18 || a == 32)
				printf("@");
			else printf("+");
			coord.Y = a;
			coord.X = 133;
			SetConsoleCursorPosition(hOutput, coord);
			printf("+");
		}
		coord.X = paperx;
		coord.Y = 2;
		SetConsoleCursorPosition(hOutput, coord);
		printf(".__/\\       /\\ __   \n");
		延迟(175);
		coord.X = paperx;
		coord.Y = 3;
		SetConsoleCursorPosition(hOutput, coord);
		printf("|  )/___  __)//  |_  \n");
		延迟(175);
		coord.X = paperx;
		coord.Y = 4;
		SetConsoleCursorPosition(hOutput, coord);
		printf("|  | \\  \\/  /\\   __\\  \n");延迟(175);
		coord.X = paperx;
		coord.Y = 5;
		SetConsoleCursorPosition(hOutput, coord);
		printf("|  |__>    <  |  |  \n");延迟(175);
		coord.X = paperx;
		coord.Y = 6;
		SetConsoleCursorPosition(hOutput, coord);
		printf("|____/__/\\__\\ |__|  \n");延迟(175);
		
		coord.X = 55;
		coord.Y = 12;
		SetConsoleCursorPosition(hOutput, coord);

		printf("\tXXXXXXXXXXXXXXXXXXXXXXXXX XXXXXXX\n");
		延迟(100);
		coord.X = 55;
		coord.Y = 15;
		SetConsoleCursorPosition(hOutput, coord);
		printf("\tXXXXXXXXXXXXXXXXXXXXXXXXX XXXXXXX");
		延迟(100);
		coord.X = 55;
		coord.Y = 18;
		SetConsoleCursorPosition(hOutput, coord);
		printf("\tXXXXXXXXXXXXXXXXXXXXXXXXX XXXXXXX\n");
		延迟(100);
		coord.X = 55;
		coord.Y = 21;
		SetConsoleCursorPosition(hOutput, coord);
		printf("\tXXXXXXXXXXXXXXXXXXXXXXXXX XXXXXXX");
		延迟(100);
		coord.X = 55;
		coord.Y = 24;
		SetConsoleCursorPosition(hOutput, coord);

		printf("\tXXXXXXXXXXXXXXXXXXXXXXXXX XXXXXXX\n");
		延迟(100);
		coord.X = 55;
		coord.Y = 27;
		SetConsoleCursorPosition(hOutput, coord);
		printf("\tXXXXXXXXXXXXXXXXXXXXXXXXX XXXXXXX");
		延迟(100);
		coord.X = 55;
		coord.Y = 30;
		SetConsoleCursorPosition(hOutput, coord);
		printf("\tXXXXXXXXXXXXXXXXXXXXXXXXX XXXXXXX\n");
		延迟(100);
		coord.X = 55;
		coord.Y = 33;
		SetConsoleCursorPosition(hOutput, coord);
		printf("\tXXXXXXXXXXXXXXXXXXXXXXXXX XXXXXXX");
		延迟(100);
		system("cls");
	}




	coord.X = 53;
	coord.Y = 0;
	SetConsoleCursorPosition(hOutput, coord);
	printf("++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n");
	coord.X = 53;
	coord.Y = 9;
	SetConsoleCursorPosition(hOutput, coord);
	printf("----------------------+-----------------------------------+---------------------\n");
	coord.X = 53;
	coord.Y = 50;
	SetConsoleCursorPosition(hOutput, coord);
	printf("+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n");
	for (a = 10;a < 50;a++)
	{
		coord.Y = a;
		coord.X = 75;
		SetConsoleCursorPosition(hOutput, coord);
		printf("!");
		coord.Y = a;
		coord.X = 111;
		SetConsoleCursorPosition(hOutput, coord);
		printf("!");

	}
	for (a = 0;a < 50;a++)
	{
		coord.Y = a;
		coord.X = 53;
		SetConsoleCursorPosition(hOutput, coord);
		if (a == 18 || a == 32)
			printf("@");
		else printf("+");
		coord.Y = a;
		coord.X = 133;
		SetConsoleCursorPosition(hOutput, coord);
		printf("+");
	}
	coord.X = paperx;
	coord.Y = 2;
	SetConsoleCursorPosition(hOutput, coord);
	printf(".__/\\       /\\ __   \n");
	
	coord.X = paperx;
	coord.Y = 3;
	SetConsoleCursorPosition(hOutput, coord);
	printf("|  )/___  __)//  |_  \n");
	
	coord.X = paperx;
	coord.Y = 4;
	SetConsoleCursorPosition(hOutput, coord);
	printf("|  | \\  \\/  /\\   __\\  \n");
	coord.X = paperx;
	coord.Y = 5;
	SetConsoleCursorPosition(hOutput, coord);
	printf("|  |__>    <  |  |  \n");
	coord.X = paperx;
	coord.Y = 6;
	SetConsoleCursorPosition(hOutput, coord);
	printf("|____/__/\\__\\ |__|  \n");



	coord.X = 55;
	coord.Y = 12;
	SetConsoleCursorPosition(hOutput, coord);

	printf("\t正在初始化系统，请稍后\n");
	延迟(100*3);
	coord.X = 55;
	coord.Y = 15;
	SetConsoleCursorPosition(hOutput, coord);
	printf("\t确保你已经将窗口全屏，将系统分辨率调为1920*1080，关闭中文输入法与大写");
	延迟(100 * 3);
	coord.X = 55;
	coord.Y = 18;
	SetConsoleCursorPosition(hOutput, coord);
	printf("\t程序框字体为16号 \n");
	延迟(100 * 3);
	coord.X = 55;
	coord.Y = 21;
	SetConsoleCursorPosition(hOutput, coord);
	printf("\t若win7及以下系统无法全屏");
	延迟(100 * 3);
	coord.X = 55;
	coord.Y = 24;
	SetConsoleCursorPosition(hOutput, coord);
	printf("\t右键程序边框打开属性在窗口或布局中设宽为240高60然后重启程序");
	延迟(100 * 3);
	coord.X = 55;
	coord.Y = 27;
	SetConsoleCursorPosition(hOutput, coord);
	printf("\t进入游戏后如果画面不流畅可以按ESC打开菜单选择设置修改流畅度");
	延迟(100 * 3);
	coord.X = 55;
	coord.Y = 30;
	SetConsoleCursorPosition(hOutput, coord);
	printf("\t本游戏由lxt制作");
	printf("++++++++");
	延迟(100 * 3);
	coord.X = 118;
	coord.Y = 2;
	SetConsoleCursorPosition(hOutput, coord);
	printf("绝密*开封前");

	延迟(100 * 3);
	coord.X = 55;
	coord.Y = 33;
	SetConsoleCursorPosition(hOutput, coord);
	printf("\t初始化成功，请按回车继续\n");

	con = 1;
	act2 = 0;
	time0 = 0;
	time1 = 0;
	ch1 = ' ';
	ch3 = 0;
	table = 0;
	L2 = 0;
	for (b = 0;b < 19;b++)for (a = 0;a < 38;a++)tac[b][a] = '$';//拓麻歌子初始化
	R2 = 0;
	max = 3;
	V2 = 0;
	Vy2 = 0;
	xcar = 0;
	ycar = 0;
	key1 = 0;
	L1 = 0;
	R1 = 0;
	V1 = 0;
	Vy1 = 0;
	f = 1;
	down = 0;
	youhua = 42;
	ax = 0;
	sart = 0;
	sop = 0;
	ay = 0;
	x = 80;
	y = 600 - 11;
	en = y + 13;
	cg = 0;
	sit = 0;
	firepot = 0;
	comp = 0;
	elc = 0;
	cartoon = 0;
	shootgun = 0;
	xtrd = 0;
	ytrd = 0;
	missx=0;
	missy = 0;
		cgrah=0;
		cgsave = 0;
	mison = 0;
	photodandy = 0;
	trd = 0;
	numbvill;
	hdso = 0;
	talk = 0;
	shopper = 0;
	m1 = 100;
	age = 0;
	bladehurt = 5,
		talktime = 0
		;
	//time_t start, end;//计时函数开启与结束


	screenx = 0;
	screeny = 0;
	memory[0] = 10;//当前生命值
	memory[1] = 15;//最大生命值
	memory[2] = 100;//金钱
	memory[3] = 0;//上一房间号
	memory[4] = 600 - 11;;//纵坐标




	/*mood[0][9] = txt9;
	mood[0][10] = txt10;*/

	//








	system("color 07");//改变界面颜色



	for (a = 1;a < 10000;a++) {
		if (txt[a][0] == 0) break;
		mood[0][a - 1] = txt[a];//“木（目）”录
	}
	for (a = 0;a < 10000;a++) {
		if (montalk[a][0] == 0) break;
		talkmood[a] = montalk[a];//“木（目）”录
	}


	

	一直循环
	{
		延迟(40);
		if (GetKeyState(13) < 0) { break; }//
		if (GetKeyState(65) < 0 && GetKeyState(68) < 0) { creater = 1;break; }//d

	}



	HideCursor();
}

void words(int x2, int y2,int e) 
{
	int id = 15;
  x2 = x2 + 30 + 30;y2 = 600 - y2;

  switch (e) 
  {
  case 1:
	  dx[0][y2 - 1][x2 + 59] = id;dx[0][y2 - 1][x2 + 60] = id;dx[0][y2 - 1][x2 + 61] = id;dx[0][y2 - 1][x2 + 62] = id;dx[0][y2 + 0][x2 - 15] = id;dx[0][y2 + 0][x2 - 14] = id;dx[0][y2 + 0][x2 - 13] = id;dx[0][y2 + 0][x2 - 12] = id;dx[0][y2 + 0][x2 - 11] = id;
	  dx[0][y2 + 0][x2 - 10] = id;dx[0][y2 + 0][x2 - 9] = id;dx[0][y2 + 0][x2 - 8] = id;dx[0][y2 + 0][x2 - 7] = id;dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;
	  dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 56] = id;dx[0][y2 + 0][x2 + 57] = id;dx[0][y2 + 0][x2 + 58] = id;dx[0][y2 + 0][x2 + 59] = id;
	  dx[0][y2 + 1][x2 + 20] = id;dx[0][y2 + 1][x2 + 21] = id;dx[0][y2 + 1][x2 + 22] = id;dx[0][y2 + 1][x2 + 23] = id;dx[0][y2 + 1][x2 + 24] = id;dx[0][y2 + 1][x2 + 25] = id;dx[0][y2 + 1][x2 + 26] = id;dx[0][y2 + 1][x2 + 27] = id;dx[0][y2 + 1][x2 + 28] = id;
	  dx[0][y2 + 1][x2 + 29] = id;dx[0][y2 + 1][x2 + 30] = id;dx[0][y2 + 1][x2 + 31] = id;dx[0][y2 + 1][x2 + 32] = id;dx[0][y2 + 1][x2 + 33] = id;dx[0][y2 + 1][x2 + 34] = id;dx[0][y2 + 1][x2 + 35] = id;dx[0][y2 + 1][x2 + 36] = id;dx[0][y2 + 1][x2 + 52] = id;
	  dx[0][y2 + 1][x2 + 53] = id;dx[0][y2 + 1][x2 + 54] = id;dx[0][y2 + 1][x2 + 55] = id;dx[0][y2 + 1][x2 + 56] = id;dx[0][y2 + 2][x2 + 28] = id;dx[0][y2 + 2][x2 + 49] = id;dx[0][y2 + 2][x2 + 50] = id;dx[0][y2 + 2][x2 + 51] = id;dx[0][y2 + 3][x2 + 27] = id;
	  dx[0][y2 + 3][x2 + 28] = id;dx[0][y2 + 3][x2 + 49] = id;dx[0][y2 + 4][x2 + 26] = id;dx[0][y2 + 4][x2 + 27] = id;dx[0][y2 + 4][x2 + 35] = id;dx[0][y2 + 4][x2 + 36] = id;dx[0][y2 + 4][x2 + 37] = id;dx[0][y2 + 4][x2 + 49] = id;dx[0][y2 + 4][x2 + 50] = id;
	  dx[0][y2 + 4][x2 + 51] = id;dx[0][y2 + 4][x2 + 52] = id;dx[0][y2 + 4][x2 + 53] = id;dx[0][y2 + 4][x2 + 54] = id;dx[0][y2 + 4][x2 + 55] = id;dx[0][y2 + 4][x2 + 56] = id;dx[0][y2 + 4][x2 + 57] = id;dx[0][y2 + 4][x2 + 58] = id;dx[0][y2 + 4][x2 + 59] = id;
	  dx[0][y2 + 4][x2 + 60] = id;dx[0][y2 + 4][x2 + 61] = id;dx[0][y2 + 5][x2 - 12] = id;dx[0][y2 + 5][x2 - 11] = id;dx[0][y2 + 5][x2 - 10] = id;dx[0][y2 + 5][x2 - 9] = id;dx[0][y2 + 5][x2 - 8] = id;dx[0][y2 + 5][x2 - 7] = id;dx[0][y2 + 5][x2 - 6] = id;
	  dx[0][y2 + 5][x2 - 5] = id;dx[0][y2 + 5][x2 - 4] = id;dx[0][y2 + 5][x2 - 3] = id;dx[0][y2 + 5][x2 - 2] = id;dx[0][y2 + 5][x2 - 1] = id;dx[0][y2 + 5][x2 + 0] = id;dx[0][y2 + 5][x2 + 1] = id;dx[0][y2 + 5][x2 + 16] = id;dx[0][y2 + 5][x2 + 17] = id;
	  dx[0][y2 + 5][x2 + 18] = id;dx[0][y2 + 5][x2 + 19] = id;dx[0][y2 + 5][x2 + 20] = id;dx[0][y2 + 5][x2 + 21] = id;dx[0][y2 + 5][x2 + 22] = id;dx[0][y2 + 5][x2 + 23] = id;dx[0][y2 + 5][x2 + 24] = id;dx[0][y2 + 5][x2 + 25] = id;dx[0][y2 + 5][x2 + 26] = id;
	  dx[0][y2 + 5][x2 + 27] = id;dx[0][y2 + 5][x2 + 28] = id;dx[0][y2 + 5][x2 + 29] = id;dx[0][y2 + 5][x2 + 30] = id;dx[0][y2 + 5][x2 + 31] = id;dx[0][y2 + 5][x2 + 32] = id;dx[0][y2 + 5][x2 + 33] = id;dx[0][y2 + 5][x2 + 34] = id;dx[0][y2 + 5][x2 + 35] = id;
	  dx[0][y2 + 5][x2 + 49] = id;dx[0][y2 + 6][x2 + 24] = id;dx[0][y2 + 6][x2 + 25] = id;dx[0][y2 + 6][x2 + 48] = id;dx[0][y2 + 6][x2 + 49] = id;dx[0][y2 + 7][x2 + 22] = id;dx[0][y2 + 7][x2 + 23] = id;dx[0][y2 + 7][x2 + 24] = id;dx[0][y2 + 7][x2 + 25] = id;
	  dx[0][y2 + 7][x2 + 26] = id;dx[0][y2 + 7][x2 + 27] = id;dx[0][y2 + 7][x2 + 48] = id;dx[0][y2 + 7][x2 + 49] = id;dx[0][y2 + 7][x2 + 50] = id;dx[0][y2 + 7][x2 + 51] = id;dx[0][y2 + 7][x2 + 52] = id;dx[0][y2 + 7][x2 + 53] = id;dx[0][y2 + 7][x2 + 54] = id;
	  dx[0][y2 + 7][x2 + 55] = id;dx[0][y2 + 7][x2 + 56] = id;dx[0][y2 + 7][x2 + 57] = id;dx[0][y2 + 7][x2 + 58] = id;dx[0][y2 + 7][x2 + 59] = id;dx[0][y2 + 7][x2 + 60] = id;dx[0][y2 + 7][x2 + 61] = id;dx[0][y2 + 7][x2 + 62] = id;dx[0][y2 + 8][x2 + 17] = id;
	  dx[0][y2 + 8][x2 + 18] = id;dx[0][y2 + 8][x2 + 19] = id;dx[0][y2 + 8][x2 + 20] = id;dx[0][y2 + 8][x2 + 21] = id;dx[0][y2 + 8][x2 + 22] = id;dx[0][y2 + 8][x2 + 27] = id;dx[0][y2 + 8][x2 + 28] = id;dx[0][y2 + 8][x2 + 29] = id;dx[0][y2 + 8][x2 + 30] = id;
	  dx[0][y2 + 8][x2 + 31] = id;dx[0][y2 + 8][x2 + 46] = id;dx[0][y2 + 8][x2 + 47] = id;dx[0][y2 + 8][x2 + 48] = id;dx[0][y2 + 8][x2 + 62] = id;dx[0][y2 + 9][x2 + 18] = id;dx[0][y2 + 9][x2 + 31] = id;dx[0][y2 + 9][x2 + 32] = id;dx[0][y2 + 9][x2 + 33] = id;
	  dx[0][y2 + 9][x2 + 34] = id;dx[0][y2 + 9][x2 + 35] = id;dx[0][y2 + 9][x2 + 45] = id;dx[0][y2 + 9][x2 + 46] = id;dx[0][y2 + 9][x2 + 48] = id;dx[0][y2 + 9][x2 + 61] = id;dx[0][y2 + 9][x2 + 62] = id;dx[0][y2 + 10][x2 - 17] = id;dx[0][y2 + 10][x2 - 16] = id;
	  dx[0][y2 + 10][x2 - 15] = id;dx[0][y2 + 10][x2 - 14] = id;dx[0][y2 + 10][x2 - 13] = id;dx[0][y2 + 10][x2 - 12] = id;dx[0][y2 + 10][x2 - 11] = id;dx[0][y2 + 10][x2 - 10] = id;dx[0][y2 + 10][x2 - 9] = id;dx[0][y2 + 10][x2 - 8] = id;dx[0][y2 + 10][x2 - 7] = id;
	  dx[0][y2 + 10][x2 - 6] = id;dx[0][y2 + 10][x2 - 5] = id;dx[0][y2 + 10][x2 - 4] = id;dx[0][y2 + 10][x2 - 3] = id;dx[0][y2 + 10][x2 - 2] = id;dx[0][y2 + 10][x2 - 1] = id;dx[0][y2 + 10][x2 + 0] = id;dx[0][y2 + 10][x2 + 1] = id;dx[0][y2 + 10][x2 + 2] = id;
	  dx[0][y2 + 10][x2 + 3] = id;dx[0][y2 + 10][x2 + 4] = id;dx[0][y2 + 10][x2 + 48] = id;dx[0][y2 + 10][x2 + 61] = id;dx[0][y2 + 11][x2 + 49] = id;dx[0][y2 + 11][x2 + 50] = id;dx[0][y2 + 11][x2 + 51] = id;dx[0][y2 + 11][x2 + 52] = id;dx[0][y2 + 11][x2 + 53] = id;
	  dx[0][y2 + 11][x2 + 54] = id;dx[0][y2 + 11][x2 + 55] = id;dx[0][y2 + 11][x2 + 56] = id;dx[0][y2 + 11][x2 + 57] = id;dx[0][y2 + 11][x2 + 58] = id;dx[0][y2 + 11][x2 + 59] = id;dx[0][y2 + 11][x2 + 60] = id;dx[0][y2 + 11][x2 + 61] = id;
	 
	  break;
  
  }

}

void house2(int x2, int y2) {//宽68
	int id = 15,  x1;
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	dx[0][y2 + 4][x2 + 7] = id;dx[0][y2 + 4][x2 + 8] = id;dx[0][y2 + 4][x2 + 9] = id;dx[0][y2 + 4][x2 + 10] = id;dx[0][y2 + 5][x2 - 14] = id;dx[0][y2 + 5][x2 - 13] = id;
	dx[0][y2 + 5][x2 - 12] = id;dx[0][y2 + 5][x2 - 11] = id;dx[0][y2 + 5][x2 - 10] = id;dx[0][y2 + 5][x2 - 9] = id;dx[0][y2 + 5][x2 - 8] = id;dx[0][y2 + 5][x2 - 7] = id;
	dx[0][y2 + 5][x2 - 6] = id;dx[0][y2 + 5][x2 - 5] = id;dx[0][y2 + 5][x2 - 4] = id;dx[0][y2 + 5][x2 - 3] = id;dx[0][y2 + 5][x2 - 2] = id;dx[0][y2 + 5][x2 - 1] = id;
	dx[0][y2 + 5][x2 + 0] = id;dx[0][y2 + 5][x2 + 1] = id;dx[0][y2 + 5][x2 + 2] = id;dx[0][y2 + 5][x2 + 3] = id;dx[0][y2 + 5][x2 + 4] = id;dx[0][y2 + 5][x2 + 5] = id;
	dx[0][y2 + 5][x2 + 6] = id;dx[0][y2 + 5][x2 + 7] = id;dx[0][y2 + 5][x2 + 8] = id;dx[0][y2 + 5][x2 + 9] = id;dx[0][y2 + 5][x2 + 10] = id;dx[0][y2 + 5][x2 + 11] = id;
	dx[0][y2 + 6][x2 - 12] = id;dx[0][y2 + 6][x2 + 9] = id;dx[0][y2 + 7][x2 - 12] = id;dx[0][y2 + 7][x2 + 9] = id;dx[0][y2 + 8][x2 - 12] = id;dx[0][y2 + 8][x2 + 9] = id;
	dx[0][y2 + 9][x2 - 14] = id;dx[0][y2 + 9][x2 - 13] = id;dx[0][y2 + 9][x2 - 12] = id;dx[0][y2 + 9][x2 + 9] = id;dx[0][y2 + 9][x2 + 10] = id;dx[0][y2 + 9][x2 + 11] = id;
	dx[0][y2 + 10][x2 - 14] = id;dx[0][y2 + 10][x2 - 13] = id;dx[0][y2 + 10][x2 - 12] = id;dx[0][y2 + 10][x2 + 9] = id;dx[0][y2 + 10][x2 + 10] = id;dx[0][y2 + 10][x2 + 11] = id;
	dx[0][y2 + 11][x2 - 14] = id;dx[0][y2 + 11][x2 - 13] = id;dx[0][y2 + 11][x2 - 12] = id;dx[0][y2 + 11][x2 - 11] = id;dx[0][y2 + 11][x2 - 10] = id;dx[0][y2 + 11][x2 - 9] = id;
	dx[0][y2 + 11][x2 - 8] = id;dx[0][y2 + 11][x2 - 7] = id;dx[0][y2 + 11][x2 - 6] = id;dx[0][y2 + 11][x2 - 5] = id;dx[0][y2 + 11][x2 - 4] = id;dx[0][y2 + 11][x2 - 3] = id;
	dx[0][y2 + 11][x2 - 2] = id;dx[0][y2 + 11][x2 - 1] = id;dx[0][y2 + 11][x2 + 0] = id;dx[0][y2 + 11][x2 + 1] = id;dx[0][y2 + 11][x2 + 2] = id;dx[0][y2 + 11][x2 + 3] = id;
	dx[0][y2 + 11][x2 + 4] = id;dx[0][y2 + 11][x2 + 5] = id;dx[0][y2 + 11][x2 + 6] = id;dx[0][y2 + 11][x2 + 7] = id;dx[0][y2 + 11][x2 + 8] = id;dx[0][y2 + 11][x2 + 9] = id;
	dx[0][y2 + 11][x2 + 10] = id;dx[0][y2 + 11][x2 + 11] = id;dx[0][y2 + 12][x2 - 19] = id;dx[0][y2 + 12][x2 - 18] = id;dx[0][y2 + 12][x2 - 17] = id;dx[0][y2 + 12][x2 - 16] = id;
	dx[0][y2 + 12][x2 - 15] = id;dx[0][y2 + 12][x2 - 14] = id;dx[0][y2 + 12][x2 + 11] = id;dx[0][y2 + 12][x2 + 12] = id;dx[0][y2 + 12][x2 + 13] = id;dx[0][y2 + 12][x2 + 14] = id;
	dx[0][y2 + 12][x2 + 15] = id;dx[0][y2 + 12][x2 + 16] = id;dx[0][y2 + 13][x2 - 19] = id;dx[0][y2 + 13][x2 - 18] = id;dx[0][y2 + 13][x2 - 17] = id;dx[0][y2 + 13][x2 - 16] = id;
	dx[0][y2 + 13][x2 + 13] = id;dx[0][y2 + 13][x2 + 14] = id;dx[0][y2 + 13][x2 + 15] = id;dx[0][y2 + 13][x2 + 16] = id;dx[0][y2 + 14][x2 - 19] = id;dx[0][y2 + 14][x2 - 18] = id;
	dx[0][y2 + 14][x2 + 15] = id;dx[0][y2 + 14][x2 + 16] = id;dx[0][y2 + 15][x2 - 19] = id;dx[0][y2 + 15][x2 + 16] = id;dx[0][y2 + 16][x2 - 45] = id;dx[0][y2 + 16][x2 - 44] = id;
	dx[0][y2 + 16][x2 - 43] = id;dx[0][y2 + 16][x2 - 42] = id;dx[0][y2 + 16][x2 - 41] = id;dx[0][y2 + 16][x2 - 40] = id;dx[0][y2 + 16][x2 - 39] = id;dx[0][y2 + 16][x2 - 38] = id;
	dx[0][y2 + 16][x2 - 37] = id;dx[0][y2 + 16][x2 - 36] = id;dx[0][y2 + 16][x2 - 35] = id;dx[0][y2 + 16][x2 - 34] = id;dx[0][y2 + 16][x2 - 33] = id;dx[0][y2 + 16][x2 - 32] = id;
	dx[0][y2 + 16][x2 - 31] = id;dx[0][y2 + 16][x2 - 30] = id;dx[0][y2 + 16][x2 - 29] = id;dx[0][y2 + 16][x2 - 28] = id;dx[0][y2 + 16][x2 - 27] = id;dx[0][y2 + 16][x2 - 26] = id;
	dx[0][y2 + 16][x2 - 25] = id;dx[0][y2 + 16][x2 - 24] = id;dx[0][y2 + 16][x2 - 23] = id;dx[0][y2 + 16][x2 - 22] = id;dx[0][y2 + 16][x2 - 21] = id;dx[0][y2 + 16][x2 - 20] = id;
	dx[0][y2 + 16][x2 - 19] = id;dx[0][y2 + 16][x2 + 16] = id;dx[0][y2 + 16][x2 + 17] = id;dx[0][y2 + 16][x2 + 18] = id;dx[0][y2 + 16][x2 + 19] = id;dx[0][y2 + 16][x2 + 20] = id;
	dx[0][y2 + 16][x2 + 21] = id;dx[0][y2 + 16][x2 + 22] = id;dx[0][y2 + 16][x2 + 23] = id;dx[0][y2 + 16][x2 + 24] = id;dx[0][y2 + 16][x2 + 25] = id;dx[0][y2 + 16][x2 + 26] = id;
	dx[0][y2 + 16][x2 + 27] = id;dx[0][y2 + 16][x2 + 28] = id;dx[0][y2 + 16][x2 + 29] = id;dx[0][y2 + 16][x2 + 30] = id;dx[0][y2 + 16][x2 + 31] = id;dx[0][y2 + 16][x2 + 32] = id;
	dx[0][y2 + 16][x2 + 33] = id;dx[0][y2 + 16][x2 + 34] = id;dx[0][y2 + 16][x2 + 35] = id;dx[0][y2 + 16][x2 + 36] = id;dx[0][y2 + 16][x2 + 37] = id;dx[0][y2 + 16][x2 + 38] = id;
	dx[0][y2 + 16][x2 + 39] = id;dx[0][y2 + 16][x2 + 40] = id;dx[0][y2 + 16][x2 + 41] = id;dx[0][y2 + 16][x2 + 42] = id;dx[0][y2 + 16][x2 + 43] = id;dx[0][y2 + 16][x2 + 44] = id;
	dx[0][y2 + 16][x2 + 45] = id;dx[0][y2 + 16][x2 + 46] = id;dx[0][y2 + 16][x2 + 47] = id;dx[0][y2 + 17][x2 - 47] = id;dx[0][y2 + 17][x2 - 46] = id;dx[0][y2 + 17][x2 - 45] = id;
	dx[0][y2 + 17][x2 - 19] = id;dx[0][y2 + 17][x2 + 16] = id;dx[0][y2 + 17][x2 + 47] = id;dx[0][y2 + 17][x2 + 48] = id;dx[0][y2 + 17][x2 + 49] = id;dx[0][y2 + 18][x2 - 47] = id;
	dx[0][y2 + 18][x2 - 46] = id;dx[0][y2 + 18][x2 - 19] = id;dx[0][y2 + 18][x2 + 16] = id;dx[0][y2 + 18][x2 + 49] = id;dx[0][y2 + 18][x2 + 50] = id;dx[0][y2 + 19][x2 - 47] = id;
	dx[0][y2 + 19][x2 - 23] = id;dx[0][y2 + 19][x2 - 22] = id;dx[0][y2 + 19][x2 - 21] = id;dx[0][y2 + 19][x2 - 20] = id;dx[0][y2 + 19][x2 - 19] = id;dx[0][y2 + 19][x2 - 18] = id;
	dx[0][y2 + 19][x2 - 17] = id;dx[0][y2 + 19][x2 - 16] = id;dx[0][y2 + 19][x2 - 15] = id;dx[0][y2 + 19][x2 - 14] = id;dx[0][y2 + 19][x2 - 13] = id;dx[0][y2 + 19][x2 - 12] = id;
	dx[0][y2 + 19][x2 - 11] = id;dx[0][y2 + 19][x2 - 10] = id;dx[0][y2 + 19][x2 - 9] = id;dx[0][y2 + 19][x2 - 8] = id;dx[0][y2 + 19][x2 - 7] = id;dx[0][y2 + 19][x2 - 6] = id;
	dx[0][y2 + 19][x2 - 5] = id;dx[0][y2 + 19][x2 - 4] = id;dx[0][y2 + 19][x2 - 3] = id;dx[0][y2 + 19][x2 - 2] = id;dx[0][y2 + 19][x2 - 1] = id;dx[0][y2 + 19][x2 + 0] = id;
	dx[0][y2 + 19][x2 + 1] = id;dx[0][y2 + 19][x2 + 2] = id;dx[0][y2 + 19][x2 + 3] = id;dx[0][y2 + 19][x2 + 4] = id;dx[0][y2 + 19][x2 + 5] = id;dx[0][y2 + 19][x2 + 6] = id;
	dx[0][y2 + 19][x2 + 7] = id;dx[0][y2 + 19][x2 + 8] = id;dx[0][y2 + 19][x2 + 9] = id;dx[0][y2 + 19][x2 + 10] = id;dx[0][y2 + 19][x2 + 11] = id;dx[0][y2 + 19][x2 + 12] = id;
	dx[0][y2 + 19][x2 + 13] = id;dx[0][y2 + 19][x2 + 14] = id;dx[0][y2 + 19][x2 + 15] = id;dx[0][y2 + 19][x2 + 16] = id;dx[0][y2 + 19][x2 + 17] = id;dx[0][y2 + 19][x2 + 18] = id;
	dx[0][y2 + 19][x2 + 19] = id;dx[0][y2 + 19][x2 + 50] = id;dx[0][y2 + 20][x2 - 47] = id;dx[0][y2 + 20][x2 - 23] = id;dx[0][y2 + 20][x2 + 18] = id;dx[0][y2 + 20][x2 + 19] = id;
	dx[0][y2 + 20][x2 + 50] = id;dx[0][y2 + 21][x2 - 47] = id;dx[0][y2 + 21][x2 - 23] = id;dx[0][y2 + 21][x2 + 19] = id;dx[0][y2 + 21][x2 + 50] = id;dx[0][y2 + 22][x2 - 47] = id;
	dx[0][y2 + 22][x2 - 23] = id;dx[0][y2 + 22][x2 + 19] = id;dx[0][y2 + 22][x2 + 50] = id;dx[0][y2 + 23][x2 - 47] = id;dx[0][y2 + 23][x2 - 23] = id;dx[0][y2 + 23][x2 + 19] = id;
	dx[0][y2 + 23][x2 + 50] = id;dx[0][y2 + 24][x2 - 47] = id;dx[0][y2 + 24][x2 - 23] = id;dx[0][y2 + 24][x2 + 19] = id;dx[0][y2 + 24][x2 + 50] = id;dx[0][y2 + 25][x2 - 47] = id;
	dx[0][y2 + 25][x2 - 23] = id;dx[0][y2 + 25][x2 + 19] = id;dx[0][y2 + 25][x2 + 50] = id;dx[0][y2 + 26][x2 - 47] = id;dx[0][y2 + 26][x2 - 23] = id;dx[0][y2 + 26][x2 + 19] = id;
	dx[0][y2 + 26][x2 + 50] = id;dx[0][y2 + 27][x2 - 47] = id;dx[0][y2 + 27][x2 - 26] = id;dx[0][y2 + 27][x2 - 25] = id;dx[0][y2 + 27][x2 - 24] = id;dx[0][y2 + 27][x2 - 23] = id;
	dx[0][y2 + 27][x2 - 22] = id;dx[0][y2 + 27][x2 - 21] = id;dx[0][y2 + 27][x2 - 20] = id;dx[0][y2 + 27][x2 - 19] = id;dx[0][y2 + 27][x2 - 18] = id;dx[0][y2 + 27][x2 - 17] = id;
	dx[0][y2 + 27][x2 + 15] = id;dx[0][y2 + 27][x2 + 16] = id;dx[0][y2 + 27][x2 + 17] = id;dx[0][y2 + 27][x2 + 18] = id;dx[0][y2 + 27][x2 + 19] = id;dx[0][y2 + 27][x2 + 20] = id;
	dx[0][y2 + 27][x2 + 21] = id;dx[0][y2 + 27][x2 + 22] = id;dx[0][y2 + 27][x2 + 23] = id;dx[0][y2 + 27][x2 + 50] = id;dx[0][y2 + 28][x2 - 47] = id;dx[0][y2 + 28][x2 - 46] = id;
	dx[0][y2 + 28][x2 - 45] = id;dx[0][y2 + 28][x2 - 44] = id;dx[0][y2 + 28][x2 - 43] = id;dx[0][y2 + 28][x2 - 42] = id;dx[0][y2 + 28][x2 - 41] = id;dx[0][y2 + 28][x2 - 40] = id;
	dx[0][y2 + 28][x2 - 39] = id;dx[0][y2 + 28][x2 - 38] = id;dx[0][y2 + 28][x2 - 37] = id;dx[0][y2 + 28][x2 - 36] = id;dx[0][y2 + 28][x2 - 35] = id;dx[0][y2 + 28][x2 - 34] = id;
	dx[0][y2 + 28][x2 - 33] = id;dx[0][y2 + 28][x2 - 32] = id;dx[0][y2 + 28][x2 - 31] = id;dx[0][y2 + 28][x2 - 30] = id;dx[0][y2 + 28][x2 - 29] = id;dx[0][y2 + 28][x2 - 28] = id;
	dx[0][y2 + 28][x2 - 27] = id;dx[0][y2 + 28][x2 - 26] = id;dx[0][y2 + 28][x2 - 25] = id;dx[0][y2 + 28][x2 - 24] = id;dx[0][y2 + 28][x2 - 23] = id;dx[0][y2 + 28][x2 - 22] = id;
	dx[0][y2 + 28][x2 - 21] = id;dx[0][y2 + 28][x2 - 20] = id;dx[0][y2 + 28][x2 - 19] = id;dx[0][y2 + 28][x2 - 18] = id;dx[0][y2 + 28][x2 - 17] = id;dx[0][y2 + 28][x2 - 16] = id;
	dx[0][y2 + 28][x2 - 15] = id;dx[0][y2 + 28][x2 - 14] = id;dx[0][y2 + 28][x2 - 13] = id;dx[0][y2 + 28][x2 - 12] = id;dx[0][y2 + 28][x2 - 11] = id;dx[0][y2 + 28][x2 - 10] = id;
	dx[0][y2 + 28][x2 - 9] = id;dx[0][y2 + 28][x2 - 8] = id;dx[0][y2 + 28][x2 - 7] = id;dx[0][y2 + 28][x2 - 6] = id;dx[0][y2 + 28][x2 - 5] = id;dx[0][y2 + 28][x2 - 4] = id;
	dx[0][y2 + 28][x2 - 3] = id;dx[0][y2 + 28][x2 - 2] = id;dx[0][y2 + 28][x2 - 1] = id;dx[0][y2 + 28][x2 + 0] = id;dx[0][y2 + 28][x2 + 1] = id;dx[0][y2 + 28][x2 + 2] = id;
	dx[0][y2 + 28][x2 + 3] = id;dx[0][y2 + 28][x2 + 4] = id;dx[0][y2 + 28][x2 + 5] = id;dx[0][y2 + 28][x2 + 6] = id;dx[0][y2 + 28][x2 + 7] = id;dx[0][y2 + 28][x2 + 8] = id;
	dx[0][y2 + 28][x2 + 9] = id;dx[0][y2 + 28][x2 + 10] = id;dx[0][y2 + 28][x2 + 11] = id;dx[0][y2 + 28][x2 + 12] = id;dx[0][y2 + 28][x2 + 13] = id;dx[0][y2 + 28][x2 + 14] = id;
	dx[0][y2 + 28][x2 + 15] = id;dx[0][y2 + 28][x2 + 16] = id;dx[0][y2 + 28][x2 + 17] = id;dx[0][y2 + 28][x2 + 18] = id;dx[0][y2 + 28][x2 + 19] = id;dx[0][y2 + 28][x2 + 20] = id;
	dx[0][y2 + 28][x2 + 21] = id;dx[0][y2 + 28][x2 + 22] = id;dx[0][y2 + 28][x2 + 23] = id;dx[0][y2 + 28][x2 + 24] = id;dx[0][y2 + 28][x2 + 25] = id;dx[0][y2 + 28][x2 + 26] = id;
	dx[0][y2 + 28][x2 + 27] = id;dx[0][y2 + 28][x2 + 28] = id;dx[0][y2 + 28][x2 + 29] = id;dx[0][y2 + 28][x2 + 30] = id;dx[0][y2 + 28][x2 + 31] = id;dx[0][y2 + 28][x2 + 32] = id;
	dx[0][y2 + 28][x2 + 33] = id;dx[0][y2 + 28][x2 + 34] = id;dx[0][y2 + 28][x2 + 35] = id;dx[0][y2 + 28][x2 + 36] = id;dx[0][y2 + 28][x2 + 37] = id;dx[0][y2 + 28][x2 + 38] = id;
	dx[0][y2 + 28][x2 + 39] = id;dx[0][y2 + 28][x2 + 40] = id;dx[0][y2 + 28][x2 + 41] = id;dx[0][y2 + 28][x2 + 42] = id;dx[0][y2 + 28][x2 + 43] = id;dx[0][y2 + 28][x2 + 44] = id;
	dx[0][y2 + 28][x2 + 45] = id;dx[0][y2 + 28][x2 + 46] = id;dx[0][y2 + 28][x2 + 47] = id;dx[0][y2 + 28][x2 + 48] = id;dx[0][y2 + 28][x2 + 49] = id;dx[0][y2 + 28][x2 + 50] = id;
}

void house(int x2, int y2) {//宽68
	int id = 15, a, b, c, y1, x1;
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	//屋顶高11
	c = 68;
	for (b = 0;b < 12;b++)
	{
		for (a = ((c - b * 6) / 2);a < 69 - ((c - b * 6) / 2);a++)
		{
			dx[0][y2 + b][x2 + a] = 台;
		}
	}
	for (b = 11;b < 28;b++)

		for (a = 0;a < 68;a++)
			if (b < 27) { if (a == 0 || a == 67) dx[0][y2 + b][x2 + a] = 背景; }
			else dx[0][y2 + b][x2 + a] = 背景;
	for (b = 13;b < 19;b++)
	{
		for (a = 6;a < 22;a++)
		{
			if (b == 13 || b == 18) { dx[0][y2 + b][x2 + a] = 背景; }
			else if (a == 6 || a == 21)dx[0][y2 + b][x2 + a] = 背景;
			if (b == 14 && (a == 9)) dx[0][y2 + b][x2 + a] = 背景;
			else if (b == 15 && (a == 9 || a == 8 || a == 20 || a == 19))dx[0][y2 + b][x2 + a] = 背景;
			else if (b == 16 && (a == 7 || a == 8 || a == 18 || a == 19 || a == 17))dx[0][y2 + b][x2 + a] = 背景;
			else if (b == 17 && (a == 17 || a == 18))dx[0][y2 + b][x2 + a] = 背景;
		}
	}
	for (b = 13;b < 19;b++)
	{
		for (a = 46;a < 62;a++) {
			if (b == 13 || b == 18) { dx[0][y2 + b][x2 + a] = 背景; }
			else if (a == 46 || a == 61)dx[0][y2 + b][x2 + a] = 背景;
			if (b == 14 && (a == 49)) dx[0][y2 + b][x2 + a] = 背景;
			else if (b == 15 && (a == 49 || a == 48 || a == 60 || a == 59))dx[0][y2 + b][x2 + a] = 背景;
			else if (b == 16 && (a == 47 || a == 48 || a == 58 || a == 59 || a == 17))dx[0][y2 + b][x2 + a] = 背景;
			else if (b == 17 && (a == 57 || a == 58))dx[0][y2 + b][x2 + a] = 背景;
		}
	}
	x1 = x2 + 30;
	y1 = y2 + b + 8;
	for (a = 0;a < 10;a++)
		dx[0][y1][x1 + a] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;

	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	dx[0][y1][x1 + 3] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	for (a = 0;a < 10;a++)
		dx[0][y1][x1 + a] = 前门;
}

void house3(int x2, int y2)
{
	int id = 15, x1;
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	dx[0][y2 - 24][x2 - 68] = id;dx[0][y2 - 24][x2 - 67] = id;dx[0][y2 - 24][x2 - 66] = id;dx[0][y2 - 24][x2 - 65] = id;dx[0][y2 - 24][x2 - 64] = id;dx[0][y2 - 24][x2 - 63] = id;dx[0][y2 - 24][x2 - 62] = id;dx[0][y2 - 24][x2 - 61] = id;dx[0][y2 - 24][x2 - 60] = id;
	dx[0][y2 - 24][x2 - 59] = id;dx[0][y2 - 24][x2 - 58] = id;dx[0][y2 - 24][x2 - 57] = id;dx[0][y2 - 24][x2 - 56] = id;dx[0][y2 - 24][x2 - 55] = id;dx[0][y2 - 24][x2 - 54] = id;dx[0][y2 - 24][x2 - 53] = id;dx[0][y2 - 24][x2 - 52] = id;dx[0][y2 - 24][x2 - 51] = id;
	dx[0][y2 - 24][x2 - 50] = id;dx[0][y2 - 24][x2 - 49] = id;dx[0][y2 - 24][x2 - 48] = id;dx[0][y2 - 24][x2 - 47] = id;dx[0][y2 - 24][x2 - 46] = id;dx[0][y2 - 24][x2 - 45] = id;dx[0][y2 - 24][x2 - 44] = id;dx[0][y2 - 24][x2 - 43] = id;dx[0][y2 - 24][x2 - 42] = id;
	dx[0][y2 - 24][x2 - 41] = id;dx[0][y2 - 24][x2 - 40] = id;dx[0][y2 - 24][x2 - 39] = id;dx[0][y2 - 24][x2 - 38] = id;dx[0][y2 - 24][x2 - 37] = id;dx[0][y2 - 24][x2 - 36] = id;dx[0][y2 - 24][x2 - 35] = id;dx[0][y2 - 24][x2 - 34] = id;dx[0][y2 - 24][x2 - 33] = id;
	dx[0][y2 - 24][x2 - 32] = id;dx[0][y2 - 24][x2 - 31] = id;dx[0][y2 - 24][x2 - 30] = id;dx[0][y2 - 24][x2 - 29] = id;dx[0][y2 - 24][x2 - 28] = id;dx[0][y2 - 24][x2 - 27] = id;dx[0][y2 - 24][x2 - 26] = id;dx[0][y2 - 24][x2 - 25] = id;dx[0][y2 - 24][x2 - 24] = id;
	dx[0][y2 - 24][x2 - 23] = id;dx[0][y2 - 24][x2 - 22] = id;dx[0][y2 - 24][x2 - 21] = id;dx[0][y2 - 24][x2 - 20] = id;dx[0][y2 - 24][x2 - 19] = id;dx[0][y2 - 24][x2 - 18] = id;dx[0][y2 - 24][x2 - 17] = id;dx[0][y2 - 24][x2 - 16] = id;dx[0][y2 - 24][x2 - 15] = id;
	dx[0][y2 - 24][x2 - 14] = id;dx[0][y2 - 24][x2 - 13] = id;dx[0][y2 - 24][x2 - 12] = id;dx[0][y2 - 24][x2 - 11] = id;dx[0][y2 - 24][x2 - 10] = id;dx[0][y2 - 24][x2 - 9] = id;dx[0][y2 - 24][x2 - 8] = id;dx[0][y2 - 24][x2 - 7] = id;dx[0][y2 - 24][x2 - 6] = id;
	dx[0][y2 - 24][x2 - 5] = id;dx[0][y2 - 24][x2 - 4] = id;dx[0][y2 - 24][x2 - 3] = id;dx[0][y2 - 24][x2 - 2] = id;dx[0][y2 - 24][x2 - 1] = id;dx[0][y2 - 24][x2 + 0] = id;dx[0][y2 - 23][x2 - 68] = id;dx[0][y2 - 23][x2 - 58] = id;dx[0][y2 - 23][x2 - 57] = id;
	dx[0][y2 - 23][x2 - 56] = id;dx[0][y2 - 23][x2 - 55] = id;dx[0][y2 - 23][x2 - 54] = id;dx[0][y2 - 23][x2 - 53] = id;dx[0][y2 - 23][x2 - 52] = id;dx[0][y2 - 23][x2 - 48] = id;dx[0][y2 - 23][x2 - 47] = id;dx[0][y2 - 23][x2 - 46] = id;dx[0][y2 - 23][x2 - 45] = id;
	dx[0][y2 - 23][x2 - 44] = id;dx[0][y2 - 23][x2 - 43] = id;dx[0][y2 - 23][x2 - 42] = id;dx[0][y2 - 23][x2 - 41] = id;dx[0][y2 - 23][x2 - 40] = id;dx[0][y2 - 23][x2 - 39] = id;dx[0][y2 - 23][x2 - 38] = id;dx[0][y2 - 23][x2 - 37] = id;dx[0][y2 - 23][x2 - 32] = id;
	dx[0][y2 - 23][x2 - 31] = id;dx[0][y2 - 23][x2 - 30] = id;dx[0][y2 - 23][x2 - 29] = id;dx[0][y2 - 23][x2 - 28] = id;dx[0][y2 - 23][x2 - 27] = id;dx[0][y2 - 23][x2 - 26] = id;dx[0][y2 - 23][x2 - 25] = id;dx[0][y2 - 23][x2 - 24] = id;dx[0][y2 - 23][x2 - 23] = id;
	dx[0][y2 - 23][x2 - 22] = id;dx[0][y2 - 23][x2 - 21] = id;dx[0][y2 - 23][x2 - 20] = id;dx[0][y2 - 23][x2 + 0] = id;dx[0][y2 - 22][x2 - 68] = id;dx[0][y2 - 22][x2 - 60] = id;dx[0][y2 - 22][x2 - 59] = id;dx[0][y2 - 22][x2 - 58] = id;dx[0][y2 - 22][x2 - 57] = id;
	dx[0][y2 - 22][x2 - 56] = id;dx[0][y2 - 22][x2 - 55] = id;dx[0][y2 - 22][x2 - 51] = id;dx[0][y2 - 22][x2 - 50] = id;dx[0][y2 - 22][x2 - 49] = id;dx[0][y2 - 22][x2 - 48] = id;dx[0][y2 - 22][x2 - 47] = id;dx[0][y2 - 22][x2 - 46] = id;dx[0][y2 - 22][x2 - 45] = id;
	dx[0][y2 - 22][x2 - 44] = id;dx[0][y2 - 22][x2 - 43] = id;dx[0][y2 - 22][x2 - 42] = id;dx[0][y2 - 22][x2 - 41] = id;dx[0][y2 - 22][x2 - 40] = id;dx[0][y2 - 22][x2 - 36] = id;dx[0][y2 - 22][x2 - 35] = id;dx[0][y2 - 22][x2 - 34] = id;dx[0][y2 - 22][x2 - 33] = id;
	dx[0][y2 - 22][x2 - 32] = id;dx[0][y2 - 22][x2 - 31] = id;dx[0][y2 - 22][x2 - 30] = id;dx[0][y2 - 22][x2 - 29] = id;dx[0][y2 - 22][x2 - 26] = id;dx[0][y2 - 22][x2 - 25] = id;dx[0][y2 - 22][x2 - 24] = id;dx[0][y2 - 22][x2 - 23] = id;dx[0][y2 - 22][x2 - 22] = id;
	dx[0][y2 - 22][x2 - 21] = id;dx[0][y2 - 22][x2 - 20] = id;dx[0][y2 - 22][x2 - 19] = id;dx[0][y2 - 22][x2 - 18] = id;dx[0][y2 - 22][x2 - 13] = id;dx[0][y2 - 22][x2 - 12] = id;dx[0][y2 - 22][x2 - 11] = id;dx[0][y2 - 22][x2 - 10] = id;dx[0][y2 - 22][x2 - 9] = id;
	dx[0][y2 - 22][x2 - 8] = id;dx[0][y2 - 22][x2 - 7] = id;dx[0][y2 - 22][x2 - 6] = id;dx[0][y2 - 22][x2 - 5] = id;dx[0][y2 - 22][x2 - 4] = id;dx[0][y2 - 22][x2 + 0] = id;dx[0][y2 - 21][x2 - 68] = id;dx[0][y2 - 21][x2 - 59] = id;dx[0][y2 - 21][x2 - 56] = id;
	dx[0][y2 - 21][x2 - 55] = id;dx[0][y2 - 21][x2 - 54] = id;dx[0][y2 - 21][x2 - 53] = id;dx[0][y2 - 21][x2 - 52] = id;dx[0][y2 - 21][x2 - 51] = id;dx[0][y2 - 21][x2 - 47] = id;dx[0][y2 - 21][x2 - 43] = id;dx[0][y2 - 21][x2 - 42] = id;dx[0][y2 - 21][x2 - 41] = id;
	dx[0][y2 - 21][x2 - 40] = id;dx[0][y2 - 21][x2 - 39] = id;dx[0][y2 - 21][x2 - 38] = id;dx[0][y2 - 21][x2 - 37] = id;dx[0][y2 - 21][x2 - 36] = id;dx[0][y2 - 21][x2 - 35] = id;dx[0][y2 - 21][x2 - 34] = id;dx[0][y2 - 21][x2 - 33] = id;dx[0][y2 - 21][x2 - 30] = id;
	dx[0][y2 - 21][x2 - 27] = id;dx[0][y2 - 21][x2 - 26] = id;dx[0][y2 - 21][x2 - 25] = id;dx[0][y2 - 21][x2 - 24] = id;dx[0][y2 - 21][x2 - 23] = id;dx[0][y2 - 21][x2 - 22] = id;dx[0][y2 - 21][x2 - 19] = id;dx[0][y2 - 21][x2 - 12] = id;dx[0][y2 - 21][x2 - 9] = id;
	dx[0][y2 - 21][x2 - 8] = id;dx[0][y2 - 21][x2 - 5] = id;dx[0][y2 - 21][x2 + 0] = id;dx[0][y2 - 20][x2 - 68] = id;dx[0][y2 - 20][x2 - 59] = id;dx[0][y2 - 20][x2 - 56] = id;dx[0][y2 - 20][x2 - 54] = id;dx[0][y2 - 20][x2 - 53] = id;dx[0][y2 - 20][x2 - 51] = id;
	dx[0][y2 - 20][x2 - 47] = id;dx[0][y2 - 20][x2 - 43] = id;dx[0][y2 - 20][x2 - 42] = id;dx[0][y2 - 20][x2 - 41] = id;dx[0][y2 - 20][x2 - 35] = id;dx[0][y2 - 20][x2 - 34] = id;dx[0][y2 - 20][x2 - 33] = id;dx[0][y2 - 20][x2 - 30] = id;dx[0][y2 - 20][x2 - 27] = id;
	dx[0][y2 - 20][x2 - 25] = id;dx[0][y2 - 20][x2 - 24] = id;dx[0][y2 - 20][x2 - 22] = id;dx[0][y2 - 20][x2 - 19] = id;dx[0][y2 - 20][x2 - 12] = id;dx[0][y2 - 20][x2 - 11] = id;dx[0][y2 - 20][x2 - 10] = id;dx[0][y2 - 20][x2 - 9] = id;dx[0][y2 - 20][x2 - 8] = id;
	dx[0][y2 - 20][x2 - 7] = id;dx[0][y2 - 20][x2 - 6] = id;dx[0][y2 - 20][x2 - 5] = id;dx[0][y2 - 20][x2 + 0] = id;dx[0][y2 - 19][x2 - 68] = id;dx[0][y2 - 19][x2 - 59] = id;dx[0][y2 - 19][x2 - 56] = id;dx[0][y2 - 19][x2 - 54] = id;dx[0][y2 - 19][x2 - 53] = id;
	dx[0][y2 - 19][x2 - 51] = id;dx[0][y2 - 19][x2 - 47] = id;dx[0][y2 - 19][x2 - 43] = id;dx[0][y2 - 19][x2 - 42] = id;dx[0][y2 - 19][x2 - 34] = id;dx[0][y2 - 19][x2 - 33] = id;dx[0][y2 - 19][x2 - 30] = id;dx[0][y2 - 19][x2 - 27] = id;dx[0][y2 - 19][x2 - 25] = id;
	dx[0][y2 - 19][x2 - 24] = id;dx[0][y2 - 19][x2 - 22] = id;dx[0][y2 - 19][x2 - 19] = id;dx[0][y2 - 19][x2 - 12] = id;dx[0][y2 - 19][x2 - 9] = id;dx[0][y2 - 19][x2 - 8] = id;dx[0][y2 - 19][x2 - 5] = id;dx[0][y2 - 19][x2 + 0] = id;dx[0][y2 - 18][x2 - 68] = id;
	dx[0][y2 - 18][x2 - 59] = id;dx[0][y2 - 18][x2 - 56] = id;dx[0][y2 - 18][x2 - 55] = id;dx[0][y2 - 18][x2 - 54] = id;dx[0][y2 - 18][x2 - 53] = id;dx[0][y2 - 18][x2 - 52] = id;dx[0][y2 - 18][x2 - 51] = id;dx[0][y2 - 18][x2 - 47] = id;dx[0][y2 - 18][x2 - 43] = id;
	dx[0][y2 - 18][x2 - 33] = id;dx[0][y2 - 18][x2 - 30] = id;dx[0][y2 - 18][x2 - 27] = id;dx[0][y2 - 18][x2 - 26] = id;dx[0][y2 - 18][x2 - 25] = id;dx[0][y2 - 18][x2 - 24] = id;dx[0][y2 - 18][x2 - 23] = id;dx[0][y2 - 18][x2 - 22] = id;dx[0][y2 - 18][x2 - 19] = id;
	dx[0][y2 - 18][x2 - 12] = id;dx[0][y2 - 18][x2 - 11] = id;dx[0][y2 - 18][x2 - 10] = id;dx[0][y2 - 18][x2 - 9] = id;dx[0][y2 - 18][x2 - 8] = id;dx[0][y2 - 18][x2 - 7] = id;dx[0][y2 - 18][x2 - 6] = id;dx[0][y2 - 18][x2 - 5] = id;dx[0][y2 - 18][x2 + 0] = id;
	dx[0][y2 - 17][x2 - 68] = id;dx[0][y2 - 17][x2 - 59] = id;dx[0][y2 - 17][x2 - 58] = id;dx[0][y2 - 17][x2 - 57] = id;dx[0][y2 - 17][x2 - 56] = id;dx[0][y2 - 17][x2 - 55] = id;dx[0][y2 - 17][x2 - 54] = id;dx[0][y2 - 17][x2 - 53] = id;dx[0][y2 - 17][x2 - 52] = id;
	dx[0][y2 - 17][x2 - 51] = id;dx[0][y2 - 17][x2 - 50] = id;dx[0][y2 - 17][x2 - 49] = id;dx[0][y2 - 17][x2 - 48] = id;dx[0][y2 - 17][x2 - 47] = id;dx[0][y2 - 17][x2 - 46] = id;dx[0][y2 - 17][x2 - 45] = id;dx[0][y2 - 17][x2 - 44] = id;dx[0][y2 - 17][x2 - 43] = id;
	dx[0][y2 - 17][x2 - 42] = id;dx[0][y2 - 17][x2 - 41] = id;dx[0][y2 - 17][x2 - 40] = id;dx[0][y2 - 17][x2 - 39] = id;dx[0][y2 - 17][x2 - 38] = id;dx[0][y2 - 17][x2 - 37] = id;dx[0][y2 - 17][x2 - 36] = id;dx[0][y2 - 17][x2 - 35] = id;dx[0][y2 - 17][x2 - 34] = id;
	dx[0][y2 - 17][x2 - 33] = id;dx[0][y2 - 17][x2 - 32] = id;dx[0][y2 - 17][x2 - 31] = id;dx[0][y2 - 17][x2 - 30] = id;dx[0][y2 - 17][x2 - 29] = id;dx[0][y2 - 17][x2 - 28] = id;dx[0][y2 - 17][x2 - 27] = id;dx[0][y2 - 17][x2 - 26] = id;dx[0][y2 - 17][x2 - 25] = id;
	dx[0][y2 - 17][x2 - 24] = id;dx[0][y2 - 17][x2 - 23] = id;dx[0][y2 - 17][x2 - 22] = id;dx[0][y2 - 17][x2 - 21] = id;dx[0][y2 - 17][x2 - 20] = id;dx[0][y2 - 17][x2 - 19] = id;dx[0][y2 - 17][x2 - 13] = id;dx[0][y2 - 17][x2 - 12] = id;dx[0][y2 - 17][x2 - 9] = id;
	dx[0][y2 - 17][x2 - 8] = id;dx[0][y2 - 17][x2 - 5] = id;dx[0][y2 - 17][x2 - 4] = id;dx[0][y2 - 17][x2 + 0] = id;dx[0][y2 - 16][x2 - 68] = id;dx[0][y2 - 16][x2 - 59] = id;dx[0][y2 - 16][x2 - 55] = id;dx[0][y2 - 16][x2 - 51] = id;dx[0][y2 - 16][x2 - 47] = id;
	dx[0][y2 - 16][x2 - 43] = id;dx[0][y2 - 16][x2 - 33] = id;dx[0][y2 - 16][x2 - 30] = id;dx[0][y2 - 16][x2 - 25] = id;dx[0][y2 - 16][x2 - 23] = id;dx[0][y2 - 16][x2 - 19] = id;dx[0][y2 - 16][x2 - 13] = id;dx[0][y2 - 16][x2 - 12] = id;dx[0][y2 - 16][x2 - 11] = id;
	dx[0][y2 - 16][x2 - 10] = id;dx[0][y2 - 16][x2 - 9] = id;dx[0][y2 - 16][x2 - 8] = id;dx[0][y2 - 16][x2 - 7] = id;dx[0][y2 - 16][x2 - 6] = id;dx[0][y2 - 16][x2 - 5] = id;dx[0][y2 - 16][x2 - 4] = id;dx[0][y2 - 16][x2 + 0] = id;dx[0][y2 - 15][x2 - 68] = id;
	dx[0][y2 - 15][x2 - 67] = id;dx[0][y2 - 15][x2 - 66] = id;dx[0][y2 - 15][x2 - 65] = id;dx[0][y2 - 15][x2 - 64] = id;dx[0][y2 - 15][x2 - 63] = id;dx[0][y2 - 15][x2 - 62] = id;dx[0][y2 - 15][x2 - 61] = id;dx[0][y2 - 15][x2 - 60] = id;dx[0][y2 - 15][x2 - 59] = id;
	dx[0][y2 - 15][x2 - 58] = id;dx[0][y2 - 15][x2 - 57] = id;dx[0][y2 - 15][x2 - 56] = id;dx[0][y2 - 15][x2 - 55] = id;dx[0][y2 - 15][x2 - 54] = id;dx[0][y2 - 15][x2 - 53] = id;dx[0][y2 - 15][x2 - 52] = id;dx[0][y2 - 15][x2 - 51] = id;dx[0][y2 - 15][x2 - 50] = id;
	dx[0][y2 - 15][x2 - 49] = id;dx[0][y2 - 15][x2 - 48] = id;dx[0][y2 - 15][x2 - 47] = id;dx[0][y2 - 15][x2 - 46] = id;dx[0][y2 - 15][x2 - 45] = id;dx[0][y2 - 15][x2 - 44] = id;dx[0][y2 - 15][x2 - 43] = id;dx[0][y2 - 15][x2 - 42] = id;dx[0][y2 - 15][x2 - 41] = id;
	dx[0][y2 - 15][x2 - 40] = id;dx[0][y2 - 15][x2 - 39] = id;dx[0][y2 - 15][x2 - 38] = id;dx[0][y2 - 15][x2 - 37] = id;dx[0][y2 - 15][x2 - 36] = id;dx[0][y2 - 15][x2 - 35] = id;dx[0][y2 - 15][x2 - 34] = id;dx[0][y2 - 15][x2 - 33] = id;dx[0][y2 - 15][x2 - 32] = id;
	dx[0][y2 - 15][x2 - 31] = id;dx[0][y2 - 15][x2 - 30] = id;dx[0][y2 - 15][x2 - 29] = id;dx[0][y2 - 15][x2 - 28] = id;dx[0][y2 - 15][x2 - 27] = id;dx[0][y2 - 15][x2 - 26] = id;dx[0][y2 - 15][x2 - 25] = id;dx[0][y2 - 15][x2 - 24] = id;dx[0][y2 - 15][x2 - 23] = id;
	dx[0][y2 - 15][x2 - 22] = id;dx[0][y2 - 15][x2 - 21] = id;dx[0][y2 - 15][x2 - 20] = id;dx[0][y2 - 15][x2 - 19] = id;dx[0][y2 - 15][x2 - 18] = id;dx[0][y2 - 15][x2 - 17] = id;dx[0][y2 - 15][x2 - 16] = id;dx[0][y2 - 15][x2 - 15] = id;dx[0][y2 - 15][x2 - 14] = id;
	dx[0][y2 - 15][x2 - 13] = id;dx[0][y2 - 15][x2 - 12] = id;dx[0][y2 - 15][x2 - 11] = id;dx[0][y2 - 15][x2 - 10] = id;dx[0][y2 - 15][x2 - 9] = id;dx[0][y2 - 15][x2 - 8] = id;dx[0][y2 - 15][x2 - 7] = id;dx[0][y2 - 15][x2 - 6] = id;dx[0][y2 - 15][x2 - 5] = id;
	dx[0][y2 - 15][x2 - 4] = id;dx[0][y2 - 15][x2 - 3] = id;dx[0][y2 - 15][x2 - 2] = id;dx[0][y2 - 15][x2 - 1] = id;dx[0][y2 - 15][x2 + 0] = id;dx[0][y2 - 14][x2 - 68] = id;dx[0][y2 - 14][x2 - 67] = id;dx[0][y2 - 14][x2 - 66] = id;dx[0][y2 - 14][x2 - 65] = id;
	dx[0][y2 - 14][x2 - 64] = id;dx[0][y2 - 14][x2 - 63] = id;dx[0][y2 - 14][x2 - 62] = id;dx[0][y2 - 14][x2 - 61] = id;dx[0][y2 - 14][x2 - 54] = id;dx[0][y2 - 14][x2 - 45] = id;dx[0][y2 - 14][x2 - 28] = id;dx[0][y2 - 14][x2 - 14] = id;dx[0][y2 - 14][x2 - 8] = id;
	dx[0][y2 - 14][x2 - 7] = id;dx[0][y2 - 14][x2 - 6] = id;dx[0][y2 - 14][x2 - 5] = id;dx[0][y2 - 14][x2 - 4] = id;dx[0][y2 - 14][x2 - 3] = id;dx[0][y2 - 14][x2 - 2] = id;dx[0][y2 - 14][x2 - 1] = id;dx[0][y2 - 14][x2 + 0] = id;dx[0][y2 - 13][x2 - 68] = id;
	dx[0][y2 - 13][x2 - 67] = id;dx[0][y2 - 13][x2 - 66] = id;dx[0][y2 - 13][x2 - 65] = id;dx[0][y2 - 13][x2 - 64] = id;dx[0][y2 - 13][x2 - 63] = id;dx[0][y2 - 13][x2 - 62] = id;dx[0][y2 - 13][x2 - 61] = id;dx[0][y2 - 13][x2 - 60] = id;dx[0][y2 - 13][x2 - 59] = id;
	dx[0][y2 - 13][x2 - 58] = id;dx[0][y2 - 13][x2 - 57] = id;dx[0][y2 - 13][x2 - 56] = id;dx[0][y2 - 13][x2 - 55] = id;dx[0][y2 - 13][x2 - 54] = id;dx[0][y2 - 13][x2 - 53] = id;dx[0][y2 - 13][x2 - 52] = id;dx[0][y2 - 13][x2 - 51] = id;dx[0][y2 - 13][x2 - 50] = id;
	dx[0][y2 - 13][x2 - 49] = id;dx[0][y2 - 13][x2 - 48] = id;dx[0][y2 - 13][x2 - 47] = id;dx[0][y2 - 13][x2 - 46] = id;dx[0][y2 - 13][x2 - 45] = id;dx[0][y2 - 13][x2 - 44] = id;dx[0][y2 - 13][x2 - 43] = id;dx[0][y2 - 13][x2 - 42] = id;dx[0][y2 - 13][x2 - 41] = id;
	dx[0][y2 - 13][x2 - 40] = id;dx[0][y2 - 13][x2 - 39] = id;dx[0][y2 - 13][x2 - 38] = id;dx[0][y2 - 13][x2 - 37] = id;dx[0][y2 - 13][x2 - 36] = id;dx[0][y2 - 13][x2 - 35] = id;dx[0][y2 - 13][x2 - 34] = id;dx[0][y2 - 13][x2 - 33] = id;dx[0][y2 - 13][x2 - 32] = id;
	dx[0][y2 - 13][x2 - 31] = id;dx[0][y2 - 13][x2 - 30] = id;dx[0][y2 - 13][x2 - 29] = id;dx[0][y2 - 13][x2 - 28] = id;dx[0][y2 - 13][x2 - 27] = id;dx[0][y2 - 13][x2 - 26] = id;dx[0][y2 - 13][x2 - 25] = id;dx[0][y2 - 13][x2 - 24] = id;dx[0][y2 - 13][x2 - 23] = id;
	dx[0][y2 - 13][x2 - 22] = id;dx[0][y2 - 13][x2 - 21] = id;dx[0][y2 - 13][x2 - 20] = id;dx[0][y2 - 13][x2 - 19] = id;dx[0][y2 - 13][x2 - 18] = id;dx[0][y2 - 13][x2 - 17] = id;dx[0][y2 - 13][x2 - 16] = id;dx[0][y2 - 13][x2 - 15] = id;dx[0][y2 - 13][x2 - 14] = id;
	dx[0][y2 - 13][x2 - 13] = id;dx[0][y2 - 13][x2 - 12] = id;dx[0][y2 - 13][x2 - 11] = id;dx[0][y2 - 13][x2 - 10] = id;dx[0][y2 - 13][x2 - 9] = id;dx[0][y2 - 13][x2 - 8] = id;dx[0][y2 - 13][x2 - 7] = id;dx[0][y2 - 13][x2 - 6] = id;dx[0][y2 - 13][x2 - 5] = id;
	dx[0][y2 - 13][x2 - 4] = id;dx[0][y2 - 13][x2 - 3] = id;dx[0][y2 - 13][x2 - 2] = id;dx[0][y2 - 13][x2 - 1] = id;dx[0][y2 - 13][x2 + 0] = id;dx[0][y2 - 12][x2 - 68] = id;dx[0][y2 - 12][x2 - 61] = id;dx[0][y2 - 12][x2 - 60] = id;dx[0][y2 - 12][x2 - 59] = id;
	dx[0][y2 - 12][x2 - 54] = id;dx[0][y2 - 12][x2 - 53] = id;dx[0][y2 - 12][x2 - 52] = id;dx[0][y2 - 12][x2 - 51] = id;dx[0][y2 - 12][x2 - 50] = id;dx[0][y2 - 12][x2 - 37] = id;dx[0][y2 - 12][x2 - 36] = id;dx[0][y2 - 12][x2 - 35] = id;dx[0][y2 - 12][x2 - 34] = id;
	dx[0][y2 - 12][x2 - 33] = id;dx[0][y2 - 12][x2 - 32] = id;dx[0][y2 - 12][x2 - 31] = id;dx[0][y2 - 12][x2 - 30] = id;dx[0][y2 - 12][x2 - 16] = id;dx[0][y2 - 12][x2 - 15] = id;dx[0][y2 - 12][x2 - 14] = id;dx[0][y2 - 12][x2 - 13] = id;dx[0][y2 - 12][x2 - 12] = id;
	dx[0][y2 - 12][x2 - 8] = id;dx[0][y2 - 12][x2 - 7] = id;dx[0][y2 - 12][x2 - 6] = id;dx[0][y2 - 11][x2 - 68] = id;dx[0][y2 - 11][x2 - 67] = id;dx[0][y2 - 11][x2 - 66] = id;dx[0][y2 - 11][x2 - 65] = id;dx[0][y2 - 11][x2 - 64] = id;dx[0][y2 - 11][x2 - 61] = id;
	dx[0][y2 - 11][x2 - 60] = id;dx[0][y2 - 11][x2 - 53] = id;dx[0][y2 - 11][x2 - 52] = id;dx[0][y2 - 11][x2 - 51] = id;dx[0][y2 - 11][x2 - 37] = id;dx[0][y2 - 11][x2 - 30] = id;dx[0][y2 - 11][x2 - 15] = id;dx[0][y2 - 11][x2 - 14] = id;dx[0][y2 - 11][x2 - 13] = id;
	dx[0][y2 - 11][x2 - 7] = id;dx[0][y2 - 11][x2 - 6] = id;dx[0][y2 - 11][x2 - 1] = id;dx[0][y2 - 11][x2 + 0] = id;dx[0][y2 - 10][x2 - 68] = id;dx[0][y2 - 10][x2 - 67] = id;dx[0][y2 - 10][x2 - 61] = id;dx[0][y2 - 10][x2 - 55] = id;dx[0][y2 - 10][x2 - 54] = id;
	dx[0][y2 - 10][x2 - 53] = id;dx[0][y2 - 10][x2 - 52] = id;dx[0][y2 - 10][x2 - 51] = id;dx[0][y2 - 10][x2 - 50] = id;dx[0][y2 - 10][x2 - 49] = id;dx[0][y2 - 10][x2 - 42] = id;dx[0][y2 - 10][x2 - 41] = id;dx[0][y2 - 10][x2 - 40] = id;dx[0][y2 - 10][x2 - 39] = id;
	dx[0][y2 - 10][x2 - 38] = id;dx[0][y2 - 10][x2 - 37] = id;dx[0][y2 - 10][x2 - 36] = id;dx[0][y2 - 10][x2 - 35] = id;dx[0][y2 - 10][x2 - 34] = id;dx[0][y2 - 10][x2 - 33] = id;dx[0][y2 - 10][x2 - 32] = id;dx[0][y2 - 10][x2 - 31] = id;dx[0][y2 - 10][x2 - 30] = id;
	dx[0][y2 - 10][x2 - 29] = id;dx[0][y2 - 10][x2 - 28] = id;dx[0][y2 - 10][x2 - 27] = id;dx[0][y2 - 10][x2 - 26] = id;dx[0][y2 - 10][x2 - 25] = id;dx[0][y2 - 10][x2 - 17] = id;dx[0][y2 - 10][x2 - 16] = id;dx[0][y2 - 10][x2 - 15] = id;dx[0][y2 - 10][x2 - 14] = id;
	dx[0][y2 - 10][x2 - 13] = id;dx[0][y2 - 10][x2 - 12] = id;dx[0][y2 - 10][x2 - 11] = id;dx[0][y2 - 10][x2 - 6] = id;dx[0][y2 - 10][x2 - 2] = id;dx[0][y2 - 10][x2 - 1] = id;dx[0][y2 - 10][x2 + 0] = id;dx[0][y2 - 9][x2 - 68] = id;dx[0][y2 - 9][x2 - 67] = id;
	dx[0][y2 - 9][x2 - 66] = id;dx[0][y2 - 9][x2 - 65] = id;dx[0][y2 - 9][x2 - 64] = id;dx[0][y2 - 9][x2 - 61] = id;dx[0][y2 - 9][x2 - 53] = id;dx[0][y2 - 9][x2 - 52] = id;dx[0][y2 - 9][x2 - 51] = id;dx[0][y2 - 9][x2 - 41] = id;dx[0][y2 - 9][x2 - 40] = id;
	dx[0][y2 - 9][x2 - 39] = id;dx[0][y2 - 9][x2 - 28] = id;dx[0][y2 - 9][x2 - 27] = id;dx[0][y2 - 9][x2 - 26] = id;dx[0][y2 - 9][x2 - 15] = id;dx[0][y2 - 9][x2 - 14] = id;dx[0][y2 - 9][x2 - 13] = id;dx[0][y2 - 9][x2 - 6] = id;dx[0][y2 - 9][x2 - 3] = id;
	dx[0][y2 - 9][x2 - 2] = id;dx[0][y2 - 9][x2 - 1] = id;dx[0][y2 - 9][x2 + 0] = id;dx[0][y2 - 8][x2 - 68] = id;dx[0][y2 - 8][x2 - 67] = id;dx[0][y2 - 8][x2 - 61] = id;dx[0][y2 - 8][x2 - 53] = id;dx[0][y2 - 8][x2 - 52] = id;dx[0][y2 - 8][x2 - 51] = id;
	dx[0][y2 - 8][x2 - 41] = id;dx[0][y2 - 8][x2 - 40] = id;dx[0][y2 - 8][x2 - 38] = id;dx[0][y2 - 8][x2 - 37] = id;dx[0][y2 - 8][x2 - 36] = id;dx[0][y2 - 8][x2 - 35] = id;dx[0][y2 - 8][x2 - 34] = id;dx[0][y2 - 8][x2 - 33] = id;dx[0][y2 - 8][x2 - 32] = id;
	dx[0][y2 - 8][x2 - 31] = id;dx[0][y2 - 8][x2 - 30] = id;dx[0][y2 - 8][x2 - 29] = id;dx[0][y2 - 8][x2 - 27] = id;dx[0][y2 - 8][x2 - 26] = id;dx[0][y2 - 8][x2 - 15] = id;dx[0][y2 - 8][x2 - 14] = id;dx[0][y2 - 8][x2 - 13] = id;dx[0][y2 - 8][x2 - 6] = id;
	dx[0][y2 - 8][x2 - 2] = id;dx[0][y2 - 8][x2 - 1] = id;dx[0][y2 - 8][x2 + 0] = id;dx[0][y2 - 7][x2 - 68] = id;dx[0][y2 - 7][x2 - 67] = id;dx[0][y2 - 7][x2 - 66] = id;dx[0][y2 - 7][x2 - 61] = id;dx[0][y2 - 7][x2 - 53] = id;dx[0][y2 - 7][x2 - 52] = id;
	dx[0][y2 - 7][x2 - 51] = id;dx[0][y2 - 7][x2 - 41] = id;dx[0][y2 - 7][x2 - 38] = id;dx[0][y2 - 7][x2 - 37] = id;dx[0][y2 - 7][x2 - 36] = id;dx[0][y2 - 7][x2 - 31] = id;dx[0][y2 - 7][x2 - 30] = id;dx[0][y2 - 7][x2 - 29] = id;dx[0][y2 - 7][x2 - 26] = id;
	dx[0][y2 - 7][x2 - 15] = id;dx[0][y2 - 7][x2 - 14] = id;dx[0][y2 - 7][x2 - 13] = id;dx[0][y2 - 7][x2 - 6] = id;dx[0][y2 - 7][x2 - 5] = id;dx[0][y2 - 7][x2 - 4] = id;dx[0][y2 - 7][x2 - 3] = id;dx[0][y2 - 7][x2 - 2] = id;dx[0][y2 - 7][x2 - 1] = id;
	dx[0][y2 - 7][x2 + 0] = id;dx[0][y2 - 6][x2 - 68] = id;dx[0][y2 - 6][x2 - 67] = id;dx[0][y2 - 6][x2 - 66] = id;dx[0][y2 - 6][x2 - 65] = id;dx[0][y2 - 6][x2 - 64] = id;dx[0][y2 - 6][x2 - 63] = id;dx[0][y2 - 6][x2 - 61] = id;dx[0][y2 - 6][x2 - 53] = id;
	dx[0][y2 - 6][x2 - 52] = id;dx[0][y2 - 6][x2 - 51] = id;dx[0][y2 - 6][x2 - 41] = id;dx[0][y2 - 6][x2 - 38] = id;dx[0][y2 - 6][x2 - 37] = id;dx[0][y2 - 6][x2 - 30] = id;dx[0][y2 - 6][x2 - 29] = id;dx[0][y2 - 6][x2 - 26] = id;dx[0][y2 - 6][x2 - 15] = id;
	dx[0][y2 - 6][x2 - 14] = id;dx[0][y2 - 6][x2 - 13] = id;dx[0][y2 - 6][x2 - 6] = id;dx[0][y2 - 6][x2 - 3] = id;dx[0][y2 - 6][x2 - 2] = id;dx[0][y2 - 6][x2 - 1] = id;dx[0][y2 - 6][x2 + 0] = id;dx[0][y2 - 5][x2 - 68] = id;dx[0][y2 - 5][x2 - 67] = id;
	dx[0][y2 - 5][x2 - 66] = id;dx[0][y2 - 5][x2 - 61] = id;dx[0][y2 - 5][x2 - 53] = id;dx[0][y2 - 5][x2 - 52] = id;dx[0][y2 - 5][x2 - 51] = id;dx[0][y2 - 5][x2 - 41] = id;dx[0][y2 - 5][x2 - 38] = id;dx[0][y2 - 5][x2 - 29] = id;dx[0][y2 - 5][x2 - 26] = id;
	dx[0][y2 - 5][x2 - 15] = id;dx[0][y2 - 5][x2 - 14] = id;dx[0][y2 - 5][x2 - 13] = id;dx[0][y2 - 5][x2 - 6] = id;dx[0][y2 - 5][x2 - 4] = id;dx[0][y2 - 5][x2 - 3] = id;dx[0][y2 - 5][x2 - 2] = id;dx[0][y2 - 5][x2 - 1] = id;dx[0][y2 - 5][x2 + 0] = id;
	dx[0][y2 - 4][x2 - 68] = id;dx[0][y2 - 4][x2 - 67] = id;dx[0][y2 - 4][x2 - 66] = id;dx[0][y2 - 4][x2 - 65] = id;dx[0][y2 - 4][x2 - 64] = id;dx[0][y2 - 4][x2 - 63] = id;dx[0][y2 - 4][x2 - 61] = id;dx[0][y2 - 4][x2 - 53] = id;dx[0][y2 - 4][x2 - 52] = id;
	dx[0][y2 - 4][x2 - 51] = id;dx[0][y2 - 4][x2 - 41] = id;dx[0][y2 - 4][x2 - 38] = id;dx[0][y2 - 4][x2 - 29] = id;dx[0][y2 - 4][x2 - 26] = id;dx[0][y2 - 4][x2 - 15] = id;dx[0][y2 - 4][x2 - 14] = id;dx[0][y2 - 4][x2 - 13] = id;dx[0][y2 - 4][x2 - 6] = id;
	dx[0][y2 - 4][x2 - 2] = id;dx[0][y2 - 4][x2 - 1] = id;dx[0][y2 - 4][x2 + 0] = id;dx[0][y2 - 3][x2 - 68] = id;dx[0][y2 - 3][x2 - 67] = id;dx[0][y2 - 3][x2 - 66] = id;dx[0][y2 - 3][x2 - 65] = id;dx[0][y2 - 3][x2 - 64] = id;dx[0][y2 - 3][x2 - 61] = id;
	dx[0][y2 - 3][x2 - 53] = id;dx[0][y2 - 3][x2 - 52] = id;dx[0][y2 - 3][x2 - 51] = id;dx[0][y2 - 3][x2 - 41] = id;dx[0][y2 - 3][x2 - 38] = id;dx[0][y2 - 3][x2 - 29] = id;dx[0][y2 - 3][x2 - 26] = id;dx[0][y2 - 3][x2 - 15] = id;dx[0][y2 - 3][x2 - 14] = id;
	dx[0][y2 - 3][x2 - 13] = id;dx[0][y2 - 3][x2 - 6] = id;dx[0][y2 - 3][x2 - 2] = id;dx[0][y2 - 3][x2 - 1] = id;dx[0][y2 - 3][x2 + 0] = id;dx[0][y2 - 2][x2 - 68] = id;dx[0][y2 - 2][x2 - 67] = id;dx[0][y2 - 2][x2 - 66] = id;dx[0][y2 - 2][x2 - 61] = id;
	dx[0][y2 - 2][x2 - 53] = id;dx[0][y2 - 2][x2 - 52] = id;dx[0][y2 - 2][x2 - 51] = id;dx[0][y2 - 2][x2 - 41] = id;dx[0][y2 - 2][x2 - 38] = id;dx[0][y2 - 2][x2 - 37] = id;dx[0][y2 - 2][x2 - 30] = id;dx[0][y2 - 2][x2 - 29] = id;dx[0][y2 - 2][x2 - 26] = id;
	dx[0][y2 - 2][x2 - 15] = id;dx[0][y2 - 2][x2 - 14] = id;dx[0][y2 - 2][x2 - 13] = id;dx[0][y2 - 2][x2 - 6] = id;dx[0][y2 - 2][x2 + 0] = id;dx[0][y2 - 1][x2 - 68] = id;dx[0][y2 - 1][x2 - 67] = id;dx[0][y2 - 1][x2 - 66] = id;dx[0][y2 - 1][x2 - 65] = id;
	dx[0][y2 - 1][x2 - 61] = id;dx[0][y2 - 1][x2 - 53] = id;dx[0][y2 - 1][x2 - 52] = id;dx[0][y2 - 1][x2 - 51] = id;dx[0][y2 - 1][x2 - 41] = id;dx[0][y2 - 1][x2 - 38] = id;dx[0][y2 - 1][x2 - 37] = id;dx[0][y2 - 1][x2 - 30] = id;dx[0][y2 - 1][x2 - 29] = id;
	dx[0][y2 - 1][x2 - 26] = id;dx[0][y2 - 1][x2 - 15] = id;dx[0][y2 - 1][x2 - 14] = id;dx[0][y2 - 1][x2 - 13] = id;dx[0][y2 - 1][x2 - 6] = id;dx[0][y2 - 1][x2 - 2] = id;dx[0][y2 - 1][x2 - 1] = id;dx[0][y2 - 1][x2 + 0] = id;dx[0][y2 + 0][x2 - 68] = id;
	dx[0][y2 + 0][x2 - 67] = id;dx[0][y2 + 0][x2 - 66] = id;dx[0][y2 + 0][x2 - 65] = id;dx[0][y2 + 0][x2 - 64] = id;dx[0][y2 + 0][x2 - 63] = id;dx[0][y2 + 0][x2 - 62] = id;dx[0][y2 + 0][x2 - 61] = id;dx[0][y2 + 0][x2 - 54] = id;dx[0][y2 + 0][x2 - 53] = id;
	dx[0][y2 + 0][x2 - 52] = id;dx[0][y2 + 0][x2 - 51] = id;dx[0][y2 + 0][x2 - 50] = id;dx[0][y2 + 0][x2 - 41] = id;dx[0][y2 + 0][x2 - 40] = id;dx[0][y2 + 0][x2 - 39] = id;dx[0][y2 + 0][x2 - 38] = id;dx[0][y2 + 0][x2 - 37] = id;dx[0][y2 + 0][x2 - 36] = id;
	dx[0][y2 + 0][x2 - 35] = id;dx[0][y2 + 0][x2 - 34] = id;dx[0][y2 + 0][x2 - 33] = id;dx[0][y2 + 0][x2 - 32] = id;dx[0][y2 + 0][x2 - 31] = id;dx[0][y2 + 0][x2 - 30] = id;dx[0][y2 + 0][x2 - 29] = id;dx[0][y2 + 0][x2 - 28] = id;dx[0][y2 + 0][x2 - 27] = id;
	dx[0][y2 + 0][x2 - 26] = id;dx[0][y2 + 0][x2 - 16] = id;dx[0][y2 + 0][x2 - 15] = id;dx[0][y2 + 0][x2 - 14] = id;dx[0][y2 + 0][x2 - 13] = id;dx[0][y2 + 0][x2 - 12] = id;dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;
	dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 1][x2 - 61] = id;dx[0][y2 + 1][x2 - 6] = id;
	x2++;
	y2 -= 26;
	dx[0][y2 - 6][x2 - 45] = id;dx[0][y2 - 6][x2 - 44] = id;dx[0][y2 - 6][x2 - 43] = id;dx[0][y2 - 6][x2 - 42] = id;dx[0][y2 - 6][x2 - 41] = id;dx[0][y2 - 5][x2 - 48] = id;dx[0][y2 - 5][x2 - 47] = id;dx[0][y2 - 5][x2 - 46] = id;dx[0][y2 - 5][x2 - 45] = id;
	dx[0][y2 - 5][x2 - 44] = id;dx[0][y2 - 5][x2 - 43] = id;dx[0][y2 - 5][x2 - 42] = id;dx[0][y2 - 5][x2 - 41] = id;dx[0][y2 - 5][x2 - 40] = id;dx[0][y2 - 5][x2 - 39] = id;dx[0][y2 - 5][x2 - 38] = id;dx[0][y2 - 5][x2 - 37] = id;dx[0][y2 - 5][x2 - 36] = id;
	dx[0][y2 - 4][x2 - 53] = id;dx[0][y2 - 4][x2 - 52] = id;dx[0][y2 - 4][x2 - 51] = id;dx[0][y2 - 4][x2 - 50] = id;dx[0][y2 - 4][x2 - 49] = id;dx[0][y2 - 4][x2 - 46] = id;dx[0][y2 - 4][x2 - 43] = id;dx[0][y2 - 4][x2 - 40] = id;dx[0][y2 - 4][x2 - 35] = id;
	dx[0][y2 - 4][x2 - 34] = id;dx[0][y2 - 4][x2 - 33] = id;dx[0][y2 - 4][x2 - 32] = id;dx[0][y2 - 4][x2 - 31] = id;dx[0][y2 - 4][x2 - 30] = id;dx[0][y2 - 4][x2 - 29] = id;dx[0][y2 - 3][x2 - 59] = id;dx[0][y2 - 3][x2 - 58] = id;dx[0][y2 - 3][x2 - 57] = id;
	dx[0][y2 - 3][x2 - 56] = id;dx[0][y2 - 3][x2 - 55] = id;dx[0][y2 - 3][x2 - 54] = id;dx[0][y2 - 3][x2 - 51] = id;dx[0][y2 - 3][x2 - 47] = id;dx[0][y2 - 3][x2 - 43] = id;dx[0][y2 - 3][x2 - 39] = id;dx[0][y2 - 3][x2 - 35] = id;dx[0][y2 - 3][x2 - 30] = id;
	dx[0][y2 - 3][x2 - 28] = id;dx[0][y2 - 3][x2 - 27] = id;dx[0][y2 - 3][x2 - 26] = id;dx[0][y2 - 3][x2 - 25] = id;dx[0][y2 - 3][x2 - 24] = id;dx[0][y2 - 3][x2 - 23] = id;dx[0][y2 - 3][x2 - 22] = id;dx[0][y2 - 2][x2 - 64] = id;dx[0][y2 - 2][x2 - 63] = id;
	dx[0][y2 - 2][x2 - 62] = id;dx[0][y2 - 2][x2 - 61] = id;dx[0][y2 - 2][x2 - 60] = id;dx[0][y2 - 2][x2 - 59] = id;dx[0][y2 - 2][x2 - 58] = id;dx[0][y2 - 2][x2 - 53] = id;dx[0][y2 - 2][x2 - 47] = id;dx[0][y2 - 2][x2 - 43] = id;dx[0][y2 - 2][x2 - 39] = id;
	dx[0][y2 - 2][x2 - 34] = id;dx[0][y2 - 2][x2 - 29] = id;dx[0][y2 - 2][x2 - 25] = id;dx[0][y2 - 2][x2 - 21] = id;dx[0][y2 - 2][x2 - 20] = id;dx[0][y2 - 2][x2 - 19] = id;dx[0][y2 - 2][x2 - 18] = id;dx[0][y2 - 2][x2 - 17] = id;dx[0][y2 - 2][x2 - 16] = id;
	dx[0][y2 - 2][x2 - 15] = id;dx[0][y2 - 2][x2 - 14] = id;dx[0][y2 - 1][x2 - 69] = id;dx[0][y2 - 1][x2 - 68] = id;dx[0][y2 - 1][x2 - 67] = id;dx[0][y2 - 1][x2 - 66] = id;dx[0][y2 - 1][x2 - 65] = id;dx[0][y2 - 1][x2 - 61] = id;dx[0][y2 - 1][x2 - 60] = id;
	dx[0][y2 - 1][x2 - 55] = id;dx[0][y2 - 1][x2 - 48] = id;dx[0][y2 - 1][x2 - 43] = id;dx[0][y2 - 1][x2 - 39] = id;dx[0][y2 - 1][x2 - 38] = id;dx[0][y2 - 1][x2 - 33] = id;dx[0][y2 - 1][x2 - 28] = id;dx[0][y2 - 1][x2 - 24] = id;dx[0][y2 - 1][x2 - 19] = id;
	dx[0][y2 - 1][x2 - 15] = id;dx[0][y2 - 1][x2 - 13] = id;dx[0][y2 - 1][x2 - 12] = id;dx[0][y2 - 1][x2 - 11] = id;dx[0][y2 - 1][x2 - 10] = id;dx[0][y2 - 1][x2 - 9] = id;dx[0][y2 - 1][x2 - 8] = id;dx[0][y2 - 1][x2 - 7] = id;dx[0][y2 + 0][x2 - 70] = id;
	dx[0][y2 + 0][x2 - 69] = id;dx[0][y2 + 0][x2 - 68] = id;dx[0][y2 + 0][x2 - 67] = id;dx[0][y2 + 0][x2 - 66] = id;dx[0][y2 + 0][x2 - 65] = id;dx[0][y2 + 0][x2 - 64] = id;dx[0][y2 + 0][x2 - 63] = id;dx[0][y2 + 0][x2 - 62] = id;dx[0][y2 + 0][x2 - 61] = id;
	dx[0][y2 + 0][x2 - 60] = id;dx[0][y2 + 0][x2 - 59] = id;dx[0][y2 + 0][x2 - 58] = id;dx[0][y2 + 0][x2 - 57] = id;dx[0][y2 + 0][x2 - 56] = id;dx[0][y2 + 0][x2 - 55] = id;dx[0][y2 + 0][x2 - 54] = id;dx[0][y2 + 0][x2 - 53] = id;dx[0][y2 + 0][x2 - 52] = id;
	dx[0][y2 + 0][x2 - 51] = id;dx[0][y2 + 0][x2 - 50] = id;dx[0][y2 + 0][x2 - 49] = id;dx[0][y2 + 0][x2 - 48] = id;dx[0][y2 + 0][x2 - 47] = id;dx[0][y2 + 0][x2 - 46] = id;dx[0][y2 + 0][x2 - 45] = id;dx[0][y2 + 0][x2 - 44] = id;dx[0][y2 + 0][x2 - 43] = id;
	dx[0][y2 + 0][x2 - 42] = id;dx[0][y2 + 0][x2 - 41] = id;dx[0][y2 + 0][x2 - 40] = id;dx[0][y2 + 0][x2 - 39] = id;dx[0][y2 + 0][x2 - 38] = id;dx[0][y2 + 0][x2 - 37] = id;dx[0][y2 + 0][x2 - 36] = id;dx[0][y2 + 0][x2 - 35] = id;dx[0][y2 + 0][x2 - 34] = id;
	dx[0][y2 + 0][x2 - 33] = id;dx[0][y2 + 0][x2 - 32] = id;dx[0][y2 + 0][x2 - 31] = id;dx[0][y2 + 0][x2 - 30] = id;dx[0][y2 + 0][x2 - 29] = id;dx[0][y2 + 0][x2 - 28] = id;dx[0][y2 + 0][x2 - 27] = id;dx[0][y2 + 0][x2 - 26] = id;dx[0][y2 + 0][x2 - 25] = id;
	dx[0][y2 + 0][x2 - 24] = id;dx[0][y2 + 0][x2 - 23] = id;dx[0][y2 + 0][x2 - 22] = id;dx[0][y2 + 0][x2 - 21] = id;dx[0][y2 + 0][x2 - 20] = id;dx[0][y2 + 0][x2 - 19] = id;dx[0][y2 + 0][x2 - 18] = id;dx[0][y2 + 0][x2 - 17] = id;dx[0][y2 + 0][x2 - 16] = id;
	dx[0][y2 + 0][x2 - 15] = id;dx[0][y2 + 0][x2 - 14] = id;dx[0][y2 + 0][x2 - 13] = id;dx[0][y2 + 0][x2 - 12] = id;dx[0][y2 + 0][x2 - 11] = id;dx[0][y2 + 0][x2 - 10] = id;dx[0][y2 + 0][x2 - 9] = id;dx[0][y2 + 0][x2 - 8] = id;dx[0][y2 + 0][x2 - 7] = id;
	dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 1][x2 - 70] = id;dx[0][y2 + 1][x2 - 69] = id;
	dx[0][y2 + 1][x2 - 68] = id;dx[0][y2 + 1][x2 - 67] = id;dx[0][y2 + 1][x2 - 63] = id;dx[0][y2 + 1][x2 - 62] = id;dx[0][y2 + 1][x2 - 61] = id;dx[0][y2 + 1][x2 - 60] = id;dx[0][y2 + 1][x2 - 57] = id;dx[0][y2 + 1][x2 - 56] = id;dx[0][y2 + 1][x2 - 55] = id;
	dx[0][y2 + 1][x2 - 50] = id;dx[0][y2 + 1][x2 - 49] = id;dx[0][y2 + 1][x2 - 48] = id;dx[0][y2 + 1][x2 - 44] = id;dx[0][y2 + 1][x2 - 43] = id;dx[0][y2 + 1][x2 - 42] = id;dx[0][y2 + 1][x2 - 39] = id;dx[0][y2 + 1][x2 - 38] = id;dx[0][y2 + 1][x2 - 37] = id;
	dx[0][y2 + 1][x2 - 34] = id;dx[0][y2 + 1][x2 - 33] = id;dx[0][y2 + 1][x2 - 32] = id;dx[0][y2 + 1][x2 - 28] = id;dx[0][y2 + 1][x2 - 27] = id;dx[0][y2 + 1][x2 - 26] = id;dx[0][y2 + 1][x2 - 21] = id;dx[0][y2 + 1][x2 - 20] = id;dx[0][y2 + 1][x2 - 19] = id;
	dx[0][y2 + 1][x2 - 16] = id;dx[0][y2 + 1][x2 - 15] = id;dx[0][y2 + 1][x2 - 14] = id;dx[0][y2 + 1][x2 - 12] = id;dx[0][y2 + 1][x2 - 11] = id;dx[0][y2 + 1][x2 - 10] = id;dx[0][y2 + 1][x2 - 9] = id;dx[0][y2 + 1][x2 - 6] = id;dx[0][y2 + 1][x2 - 5] = id;
	dx[0][y2 + 1][x2 - 4] = id;dx[0][y2 + 1][x2 - 2] = id;dx[0][y2 + 1][x2 - 1] = id;dx[0][y2 + 1][x2 + 0] = id;
}

void doublehouse(int x1, int y1) 
{
	int id = 15, y2, x2;
	x2 = x1 + 30 + 30;y2 = 600 - y1;

	dx[0][y2 - 23][x2 + 1] = id;dx[0][y2 - 23][x2 + 2] = id;dx[0][y2 - 22][x2 - 2] = id;dx[0][y2 - 22][x2 + 0] = id;dx[0][y2 - 22][x2 + 1] = id;dx[0][y2 - 22][x2 + 2] = id;dx[0][y2 - 22][x2 + 3] = id;dx[0][y2 - 22][x2 + 4] = id;dx[0][y2 - 21][x2 - 4] = id;
	dx[0][y2 - 21][x2 - 2] = id;dx[0][y2 - 21][x2 - 1] = id;dx[0][y2 - 21][x2 + 1] = id;dx[0][y2 - 21][x2 + 2] = id;dx[0][y2 - 21][x2 + 3] = id;dx[0][y2 - 21][x2 + 5] = id;dx[0][y2 - 21][x2 + 6] = id;dx[0][y2 - 20][x2 - 5] = id;dx[0][y2 - 20][x2 - 4] = id;
	dx[0][y2 - 20][x2 - 3] = id;dx[0][y2 - 20][x2 + 1] = id;dx[0][y2 - 20][x2 + 2] = id;dx[0][y2 - 20][x2 + 5] = id;dx[0][y2 - 20][x2 + 6] = id;dx[0][y2 - 20][x2 + 7] = id;dx[0][y2 - 19][x2 - 7] = id;dx[0][y2 - 19][x2 - 5] = id;dx[0][y2 - 19][x2 - 4] = id;
	dx[0][y2 - 19][x2 - 3] = id;dx[0][y2 - 19][x2 - 2] = id;dx[0][y2 - 19][x2 - 1] = id;dx[0][y2 - 19][x2 + 0] = id;dx[0][y2 - 19][x2 + 1] = id;dx[0][y2 - 19][x2 + 2] = id;dx[0][y2 - 19][x2 + 3] = id;dx[0][y2 - 19][x2 + 4] = id;dx[0][y2 - 19][x2 + 5] = id;
	dx[0][y2 - 19][x2 + 6] = id;dx[0][y2 - 19][x2 + 7] = id;dx[0][y2 - 19][x2 + 8] = id;dx[0][y2 - 19][x2 + 9] = id;dx[0][y2 - 18][x2 - 9] = id;dx[0][y2 - 18][x2 - 7] = id;dx[0][y2 - 18][x2 - 6] = id;dx[0][y2 - 18][x2 - 5] = id;dx[0][y2 - 18][x2 - 4] = id;
	dx[0][y2 - 18][x2 - 3] = id;dx[0][y2 - 18][x2 - 2] = id;dx[0][y2 - 18][x2 - 1] = id;dx[0][y2 - 18][x2 + 0] = id;dx[0][y2 - 18][x2 + 1] = id;dx[0][y2 - 18][x2 + 2] = id;dx[0][y2 - 18][x2 + 3] = id;dx[0][y2 - 18][x2 + 4] = id;dx[0][y2 - 18][x2 + 5] = id;
	dx[0][y2 - 18][x2 + 6] = id;dx[0][y2 - 18][x2 + 7] = id;dx[0][y2 - 18][x2 + 8] = id;dx[0][y2 - 18][x2 + 9] = id;dx[0][y2 - 18][x2 + 10] = id;dx[0][y2 - 18][x2 + 11] = id;dx[0][y2 - 17][x2 - 10] = id;dx[0][y2 - 17][x2 - 9] = id;dx[0][y2 - 17][x2 - 8] = id;
	dx[0][y2 - 17][x2 - 7] = id;dx[0][y2 - 17][x2 - 6] = id;dx[0][y2 - 17][x2 + 1] = id;dx[0][y2 - 17][x2 + 2] = id;dx[0][y2 - 17][x2 + 8] = id;dx[0][y2 - 17][x2 + 9] = id;dx[0][y2 - 17][x2 + 10] = id;dx[0][y2 - 17][x2 + 11] = id;dx[0][y2 - 17][x2 + 12] = id;
	dx[0][y2 - 16][x2 - 12] = id;dx[0][y2 - 16][x2 - 11] = id;dx[0][y2 - 16][x2 - 10] = id;dx[0][y2 - 16][x2 - 8] = id;dx[0][y2 - 16][x2 - 7] = id;dx[0][y2 - 16][x2 - 6] = id;dx[0][y2 - 16][x2 - 5] = id;dx[0][y2 - 16][x2 - 4] = id;dx[0][y2 - 16][x2 + 1] = id;
	dx[0][y2 - 16][x2 + 2] = id;dx[0][y2 - 16][x2 + 6] = id;dx[0][y2 - 16][x2 + 8] = id;dx[0][y2 - 16][x2 + 9] = id;dx[0][y2 - 16][x2 + 10] = id;dx[0][y2 - 16][x2 + 12] = id;dx[0][y2 - 16][x2 + 13] = id;dx[0][y2 - 16][x2 + 14] = id;dx[0][y2 - 15][x2 - 14] = id;
	dx[0][y2 - 15][x2 - 12] = id;dx[0][y2 - 15][x2 - 11] = id;dx[0][y2 - 15][x2 - 8] = id;dx[0][y2 - 15][x2 - 7] = id;dx[0][y2 - 15][x2 - 4] = id;dx[0][y2 - 15][x2 - 3] = id;dx[0][y2 - 15][x2 + 1] = id;dx[0][y2 - 15][x2 + 2] = id;dx[0][y2 - 15][x2 + 5] = id;
	dx[0][y2 - 15][x2 + 6] = id;dx[0][y2 - 15][x2 + 9] = id;dx[0][y2 - 15][x2 + 10] = id;dx[0][y2 - 15][x2 + 13] = id;dx[0][y2 - 15][x2 + 15] = id;dx[0][y2 - 15][x2 + 16] = id;dx[0][y2 - 14][x2 - 15] = id;dx[0][y2 - 14][x2 - 14] = id;dx[0][y2 - 14][x2 - 13] = id;
	dx[0][y2 - 14][x2 - 8] = id;dx[0][y2 - 14][x2 - 7] = id;dx[0][y2 - 14][x2 - 2] = id;dx[0][y2 - 14][x2 - 1] = id;dx[0][y2 - 14][x2 + 1] = id;dx[0][y2 - 14][x2 + 2] = id;dx[0][y2 - 14][x2 + 3] = id;dx[0][y2 - 14][x2 + 4] = id;dx[0][y2 - 14][x2 + 9] = id;
	dx[0][y2 - 14][x2 + 10] = id;dx[0][y2 - 14][x2 + 15] = id;dx[0][y2 - 14][x2 + 16] = id;dx[0][y2 - 14][x2 + 17] = id;dx[0][y2 - 13][x2 - 17] = id;dx[0][y2 - 13][x2 - 16] = id;dx[0][y2 - 13][x2 - 15] = id;dx[0][y2 - 13][x2 - 8] = id;dx[0][y2 - 13][x2 - 7] = id;
	dx[0][y2 - 13][x2 + 0] = id;dx[0][y2 - 13][x2 + 1] = id;dx[0][y2 - 13][x2 + 2] = id;dx[0][y2 - 13][x2 + 3] = id;dx[0][y2 - 13][x2 + 9] = id;dx[0][y2 - 13][x2 + 10] = id;dx[0][y2 - 13][x2 + 17] = id;dx[0][y2 - 13][x2 + 18] = id;dx[0][y2 - 13][x2 + 19] = id;
	dx[0][y2 - 12][x2 - 18] = id;dx[0][y2 - 12][x2 - 17] = id;dx[0][y2 - 12][x2 - 16] = id;dx[0][y2 - 12][x2 - 15] = id;dx[0][y2 - 12][x2 - 14] = id;dx[0][y2 - 12][x2 - 13] = id;dx[0][y2 - 12][x2 - 12] = id;dx[0][y2 - 12][x2 - 11] = id;dx[0][y2 - 12][x2 - 10] = id;
	dx[0][y2 - 12][x2 - 9] = id;dx[0][y2 - 12][x2 - 8] = id;dx[0][y2 - 12][x2 - 7] = id;dx[0][y2 - 12][x2 - 6] = id;dx[0][y2 - 12][x2 - 5] = id;dx[0][y2 - 12][x2 - 4] = id;dx[0][y2 - 12][x2 - 3] = id;dx[0][y2 - 12][x2 - 2] = id;dx[0][y2 - 12][x2 - 1] = id;
	dx[0][y2 - 12][x2 + 0] = id;dx[0][y2 - 12][x2 + 1] = id;dx[0][y2 - 12][x2 + 2] = id;dx[0][y2 - 12][x2 + 3] = id;dx[0][y2 - 12][x2 + 4] = id;dx[0][y2 - 12][x2 + 5] = id;dx[0][y2 - 12][x2 + 6] = id;dx[0][y2 - 12][x2 + 7] = id;dx[0][y2 - 12][x2 + 8] = id;
	dx[0][y2 - 12][x2 + 9] = id;dx[0][y2 - 12][x2 + 10] = id;dx[0][y2 - 12][x2 + 11] = id;dx[0][y2 - 12][x2 + 12] = id;dx[0][y2 - 12][x2 + 13] = id;dx[0][y2 - 12][x2 + 14] = id;dx[0][y2 - 12][x2 + 15] = id;dx[0][y2 - 12][x2 + 16] = id;dx[0][y2 - 12][x2 + 17] = id;
	dx[0][y2 - 12][x2 + 18] = id;dx[0][y2 - 12][x2 + 19] = id;dx[0][y2 - 12][x2 + 20] = id;dx[0][y2 - 12][x2 + 21] = id;dx[0][y2 - 11][x2 - 17] = id;dx[0][y2 - 11][x2 - 16] = id;dx[0][y2 - 11][x2 - 15] = id;dx[0][y2 - 11][x2 - 14] = id;dx[0][y2 - 11][x2 - 13] = id;
	dx[0][y2 - 11][x2 + 15] = id;dx[0][y2 - 11][x2 + 16] = id;dx[0][y2 - 11][x2 + 17] = id;dx[0][y2 - 11][x2 + 18] = id;dx[0][y2 - 11][x2 + 19] = id;dx[0][y2 - 10][x2 - 17] = id;dx[0][y2 - 10][x2 - 16] = id;dx[0][y2 - 10][x2 - 15] = id;dx[0][y2 - 10][x2 - 14] = id;
	dx[0][y2 - 10][x2 - 13] = id;dx[0][y2 - 10][x2 + 15] = id;dx[0][y2 - 10][x2 + 16] = id;dx[0][y2 - 10][x2 + 17] = id;dx[0][y2 - 10][x2 + 18] = id;dx[0][y2 - 10][x2 + 19] = id;dx[0][y2 - 9][x2 - 17] = id;dx[0][y2 - 9][x2 - 1] = id;dx[0][y2 - 9][x2 + 0] = id;
	dx[0][y2 - 9][x2 + 1] = id;dx[0][y2 - 9][x2 + 2] = id;dx[0][y2 - 9][x2 + 3] = id;dx[0][y2 - 9][x2 + 4] = id;dx[0][y2 - 9][x2 + 5] = id;dx[0][y2 - 9][x2 + 19] = id;dx[0][y2 - 8][x2 - 31] = id;dx[0][y2 - 8][x2 - 30] = id;dx[0][y2 - 8][x2 - 29] = id;
	dx[0][y2 - 8][x2 - 28] = id;dx[0][y2 - 8][x2 - 27] = id;dx[0][y2 - 8][x2 - 26] = id;dx[0][y2 - 8][x2 - 25] = id;dx[0][y2 - 8][x2 - 24] = id;dx[0][y2 - 8][x2 - 23] = id;dx[0][y2 - 8][x2 - 22] = id;dx[0][y2 - 8][x2 - 21] = id;dx[0][y2 - 8][x2 - 20] = id;
	dx[0][y2 - 8][x2 - 19] = id;dx[0][y2 - 8][x2 - 18] = id;dx[0][y2 - 8][x2 - 16] = id;dx[0][y2 - 8][x2 - 15] = id;dx[0][y2 - 8][x2 - 14] = id;dx[0][y2 - 8][x2 - 1] = id;dx[0][y2 - 8][x2 + 5] = id;dx[0][y2 - 8][x2 + 13] = id;dx[0][y2 - 8][x2 + 14] = id;
	dx[0][y2 - 8][x2 + 15] = id;dx[0][y2 - 8][x2 + 16] = id;dx[0][y2 - 8][x2 + 17] = id;dx[0][y2 - 8][x2 + 18] = id;dx[0][y2 - 8][x2 + 19] = id;dx[0][y2 - 7][x2 - 31] = id;dx[0][y2 - 7][x2 - 30] = id;dx[0][y2 - 7][x2 - 29] = id;dx[0][y2 - 7][x2 - 28] = id;
	dx[0][y2 - 7][x2 - 27] = id;dx[0][y2 - 7][x2 - 26] = id;dx[0][y2 - 7][x2 - 25] = id;dx[0][y2 - 7][x2 - 24] = id;dx[0][y2 - 7][x2 - 23] = id;dx[0][y2 - 7][x2 - 22] = id;dx[0][y2 - 7][x2 - 21] = id;dx[0][y2 - 7][x2 - 20] = id;dx[0][y2 - 7][x2 - 19] = id;
	dx[0][y2 - 7][x2 - 18] = id;dx[0][y2 - 7][x2 - 16] = id;dx[0][y2 - 7][x2 - 15] = id;dx[0][y2 - 7][x2 - 14] = id;dx[0][y2 - 7][x2 - 1] = id;dx[0][y2 - 7][x2 + 5] = id;dx[0][y2 - 7][x2 + 13] = id;dx[0][y2 - 7][x2 + 14] = id;dx[0][y2 - 7][x2 + 15] = id;
	dx[0][y2 - 7][x2 + 16] = id;dx[0][y2 - 7][x2 + 17] = id;dx[0][y2 - 7][x2 + 18] = id;dx[0][y2 - 7][x2 + 19] = id;dx[0][y2 - 6][x2 - 29] = id;dx[0][y2 - 6][x2 - 28] = id;dx[0][y2 - 6][x2 - 23] = id;dx[0][y2 - 6][x2 - 17] = id;dx[0][y2 - 6][x2 - 1] = id;
	dx[0][y2 - 6][x2 + 5] = id;dx[0][y2 - 6][x2 + 19] = id;dx[0][y2 - 5][x2 - 21] = id;dx[0][y2 - 5][x2 - 17] = id;dx[0][y2 - 5][x2 - 16] = id;dx[0][y2 - 5][x2 - 15] = id;dx[0][y2 - 5][x2 - 14] = id;dx[0][y2 - 5][x2 - 13] = id;dx[0][y2 - 5][x2 - 12] = id;
	dx[0][y2 - 5][x2 - 2] = id;dx[0][y2 - 5][x2 - 1] = id;dx[0][y2 - 5][x2 + 0] = id;dx[0][y2 - 5][x2 + 1] = id;dx[0][y2 - 5][x2 + 2] = id;dx[0][y2 - 5][x2 + 3] = id;dx[0][y2 - 5][x2 + 4] = id;dx[0][y2 - 5][x2 + 5] = id;dx[0][y2 - 5][x2 + 6] = id;
	dx[0][y2 - 5][x2 + 13] = id;dx[0][y2 - 5][x2 + 14] = id;dx[0][y2 - 5][x2 + 15] = id;dx[0][y2 - 5][x2 + 16] = id;dx[0][y2 - 5][x2 + 17] = id;dx[0][y2 - 5][x2 + 18] = id;dx[0][y2 - 5][x2 + 19] = id;dx[0][y2 - 4][x2 - 20] = id;dx[0][y2 - 4][x2 - 17] = id;
	dx[0][y2 - 4][x2 - 16] = id;dx[0][y2 - 4][x2 - 15] = id;dx[0][y2 - 4][x2 - 14] = id;dx[0][y2 - 4][x2 - 13] = id;dx[0][y2 - 4][x2 - 12] = id;dx[0][y2 - 4][x2 - 10] = id;dx[0][y2 - 4][x2 - 9] = id;dx[0][y2 - 4][x2 - 8] = id;dx[0][y2 - 4][x2 - 7] = id;
	dx[0][y2 - 4][x2 - 6] = id;dx[0][y2 - 4][x2 - 5] = id;dx[0][y2 - 4][x2 - 4] = id;dx[0][y2 - 4][x2 - 3] = id;dx[0][y2 - 4][x2 - 2] = id;dx[0][y2 - 4][x2 - 1] = id;dx[0][y2 - 4][x2 + 0] = id;dx[0][y2 - 4][x2 + 1] = id;dx[0][y2 - 4][x2 + 2] = id;
	dx[0][y2 - 4][x2 + 3] = id;dx[0][y2 - 4][x2 + 4] = id;dx[0][y2 - 4][x2 + 5] = id;dx[0][y2 - 4][x2 + 6] = id;dx[0][y2 - 4][x2 + 7] = id;dx[0][y2 - 4][x2 + 8] = id;dx[0][y2 - 4][x2 + 9] = id;dx[0][y2 - 4][x2 + 10] = id;dx[0][y2 - 4][x2 + 11] = id;
	dx[0][y2 - 4][x2 + 12] = id;dx[0][y2 - 4][x2 + 13] = id;dx[0][y2 - 4][x2 + 14] = id;dx[0][y2 - 4][x2 + 15] = id;dx[0][y2 - 4][x2 + 16] = id;dx[0][y2 - 4][x2 + 17] = id;dx[0][y2 - 4][x2 + 18] = id;dx[0][y2 - 4][x2 + 19] = id;dx[0][y2 - 3][x2 - 18] = id;
	dx[0][y2 - 3][x2 - 17] = id;dx[0][y2 - 3][x2 - 16] = id;dx[0][y2 - 3][x2 - 15] = id;dx[0][y2 - 3][x2 - 14] = id;dx[0][y2 - 3][x2 - 13] = id;dx[0][y2 - 3][x2 - 12] = id;dx[0][y2 - 3][x2 - 11] = id;dx[0][y2 - 3][x2 - 10] = id;dx[0][y2 - 3][x2 - 9] = id;
	dx[0][y2 - 3][x2 - 8] = id;dx[0][y2 - 3][x2 - 7] = id;dx[0][y2 - 3][x2 - 6] = id;dx[0][y2 - 3][x2 - 5] = id;dx[0][y2 - 3][x2 - 4] = id;dx[0][y2 - 3][x2 - 3] = id;dx[0][y2 - 3][x2 - 2] = id;dx[0][y2 - 3][x2 - 1] = id;dx[0][y2 - 3][x2 + 0] = id;
	dx[0][y2 - 3][x2 + 1] = id;dx[0][y2 - 3][x2 + 2] = id;dx[0][y2 - 3][x2 + 3] = id;dx[0][y2 - 3][x2 + 4] = id;dx[0][y2 - 3][x2 + 5] = id;dx[0][y2 - 3][x2 + 6] = id;dx[0][y2 - 3][x2 + 7] = id;dx[0][y2 - 3][x2 + 8] = id;dx[0][y2 - 3][x2 + 9] = id;
	dx[0][y2 - 3][x2 + 10] = id;dx[0][y2 - 3][x2 + 11] = id;dx[0][y2 - 3][x2 + 12] = id;dx[0][y2 - 3][x2 + 13] = id;dx[0][y2 - 3][x2 + 14] = id;dx[0][y2 - 3][x2 + 15] = id;dx[0][y2 - 3][x2 + 16] = id;dx[0][y2 - 3][x2 + 17] = id;dx[0][y2 - 3][x2 + 18] = id;
	dx[0][y2 - 3][x2 + 19] = id;dx[0][y2 - 2][x2 - 17] = id;dx[0][y2 - 2][x2 - 16] = id;dx[0][y2 - 2][x2 - 15] = id;dx[0][y2 - 2][x2 - 14] = id;dx[0][y2 - 2][x2 - 13] = id;dx[0][y2 - 2][x2 - 12] = id;dx[0][y2 - 2][x2 - 11] = id;dx[0][y2 - 2][x2 - 10] = id;
	dx[0][y2 - 2][x2 + 2] = id;dx[0][y2 - 2][x2 + 3] = id;dx[0][y2 - 2][x2 + 12] = id;dx[0][y2 - 2][x2 + 13] = id;dx[0][y2 - 2][x2 + 15] = id;dx[0][y2 - 2][x2 + 16] = id;dx[0][y2 - 2][x2 + 17] = id;dx[0][y2 - 2][x2 + 18] = id;dx[0][y2 - 2][x2 + 19] = id;
	dx[0][y2 - 1][x2 - 17] = id;dx[0][y2 - 1][x2 - 16] = id;dx[0][y2 - 1][x2 - 15] = id;dx[0][y2 - 1][x2 - 12] = id;dx[0][y2 - 1][x2 - 11] = id;dx[0][y2 - 1][x2 - 10] = id;dx[0][y2 - 1][x2 - 9] = id;dx[0][y2 - 1][x2 - 8] = id;dx[0][y2 - 1][x2 - 7] = id;
	dx[0][y2 - 1][x2 - 6] = id;dx[0][y2 - 1][x2 - 5] = id;dx[0][y2 - 1][x2 - 4] = id;dx[0][y2 - 1][x2 - 3] = id;dx[0][y2 - 1][x2 + 2] = id;dx[0][y2 - 1][x2 + 3] = id;dx[0][y2 - 1][x2 + 8] = id;dx[0][y2 - 1][x2 + 9] = id;dx[0][y2 - 1][x2 + 10] = id;
	dx[0][y2 - 1][x2 + 11] = id;dx[0][y2 - 1][x2 + 12] = id;dx[0][y2 - 1][x2 + 13] = id;dx[0][y2 - 1][x2 + 15] = id;dx[0][y2 - 1][x2 + 16] = id;dx[0][y2 - 1][x2 + 17] = id;dx[0][y2 - 1][x2 + 18] = id;dx[0][y2 - 1][x2 + 19] = id;dx[0][y2 + 0][x2 - 57] = id;
	dx[0][y2 + 0][x2 - 56] = id;dx[0][y2 + 0][x2 - 55] = id;dx[0][y2 + 0][x2 - 54] = id;dx[0][y2 + 0][x2 - 53] = id;dx[0][y2 + 0][x2 - 52] = id;dx[0][y2 + 0][x2 - 51] = id;dx[0][y2 + 0][x2 - 50] = id;dx[0][y2 + 0][x2 - 49] = id;dx[0][y2 + 0][x2 - 48] = id;
	dx[0][y2 + 0][x2 - 47] = id;dx[0][y2 + 0][x2 - 46] = id;dx[0][y2 + 0][x2 - 45] = id;dx[0][y2 + 0][x2 - 44] = id;dx[0][y2 + 0][x2 - 43] = id;dx[0][y2 + 0][x2 - 42] = id;dx[0][y2 + 0][x2 - 41] = id;dx[0][y2 + 0][x2 - 40] = id;dx[0][y2 + 0][x2 - 39] = id;
	dx[0][y2 + 0][x2 - 38] = id;dx[0][y2 + 0][x2 - 37] = id;dx[0][y2 + 0][x2 - 36] = id;dx[0][y2 + 0][x2 - 35] = id;dx[0][y2 + 0][x2 - 34] = id;dx[0][y2 + 0][x2 - 33] = id;dx[0][y2 + 0][x2 - 32] = id;dx[0][y2 + 0][x2 - 31] = id;dx[0][y2 + 0][x2 - 30] = id;
	dx[0][y2 + 0][x2 - 29] = id;dx[0][y2 + 0][x2 - 28] = id;dx[0][y2 + 0][x2 - 27] = id;dx[0][y2 + 0][x2 - 26] = id;dx[0][y2 + 0][x2 - 25] = id;dx[0][y2 + 0][x2 - 24] = id;dx[0][y2 + 0][x2 - 23] = id;dx[0][y2 + 0][x2 - 22] = id;dx[0][y2 + 0][x2 - 21] = id;
	dx[0][y2 + 0][x2 - 20] = id;dx[0][y2 + 0][x2 - 19] = id;dx[0][y2 + 0][x2 - 18] = id;dx[0][y2 + 0][x2 - 17] = id;dx[0][y2 + 0][x2 - 12] = id;dx[0][y2 + 0][x2 - 11] = id;dx[0][y2 + 0][x2 - 7] = id;dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;
	dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;
	dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;dx[0][y2 + 0][x2 + 7] = id;dx[0][y2 + 0][x2 + 8] = id;dx[0][y2 + 0][x2 + 9] = id;dx[0][y2 + 0][x2 + 10] = id;dx[0][y2 + 0][x2 + 11] = id;dx[0][y2 + 0][x2 + 13] = id;dx[0][y2 + 0][x2 + 14] = id;
	dx[0][y2 + 0][x2 + 19] = id;dx[0][y2 + 1][x2 - 57] = id;dx[0][y2 + 1][x2 - 52] = id;dx[0][y2 + 1][x2 - 47] = id;dx[0][y2 + 1][x2 - 41] = id;dx[0][y2 + 1][x2 - 34] = id;dx[0][y2 + 1][x2 - 29] = id;dx[0][y2 + 1][x2 - 23] = id;dx[0][y2 + 1][x2 - 17] = id;
	dx[0][y2 + 1][x2 - 16] = id;dx[0][y2 + 1][x2 - 15] = id;dx[0][y2 + 1][x2 - 14] = id;dx[0][y2 + 1][x2 - 12] = id;dx[0][y2 + 1][x2 - 11] = id;dx[0][y2 + 1][x2 - 2] = id;dx[0][y2 + 1][x2 - 1] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 1] = id;
	dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 1][x2 + 3] = id;dx[0][y2 + 1][x2 + 4] = id;dx[0][y2 + 1][x2 + 5] = id;dx[0][y2 + 1][x2 + 6] = id;dx[0][y2 + 1][x2 + 13] = id;dx[0][y2 + 1][x2 + 14] = id;dx[0][y2 + 1][x2 + 15] = id;dx[0][y2 + 1][x2 + 16] = id;
	dx[0][y2 + 1][x2 + 17] = id;dx[0][y2 + 1][x2 + 18] = id;dx[0][y2 + 1][x2 + 19] = id;dx[0][y2 + 2][x2 - 57] = id;dx[0][y2 + 2][x2 - 56] = id;dx[0][y2 + 2][x2 - 55] = id;dx[0][y2 + 2][x2 - 54] = id;dx[0][y2 + 2][x2 - 53] = id;dx[0][y2 + 2][x2 - 52] = id;
	dx[0][y2 + 2][x2 - 51] = id;dx[0][y2 + 2][x2 - 50] = id;dx[0][y2 + 2][x2 - 49] = id;dx[0][y2 + 2][x2 - 48] = id;dx[0][y2 + 2][x2 - 47] = id;dx[0][y2 + 2][x2 - 46] = id;dx[0][y2 + 2][x2 - 45] = id;dx[0][y2 + 2][x2 - 44] = id;dx[0][y2 + 2][x2 - 43] = id;
	dx[0][y2 + 2][x2 - 42] = id;dx[0][y2 + 2][x2 - 41] = id;dx[0][y2 + 2][x2 - 40] = id;dx[0][y2 + 2][x2 - 39] = id;dx[0][y2 + 2][x2 - 38] = id;dx[0][y2 + 2][x2 - 37] = id;dx[0][y2 + 2][x2 - 36] = id;dx[0][y2 + 2][x2 - 35] = id;dx[0][y2 + 2][x2 - 34] = id;
	dx[0][y2 + 2][x2 - 33] = id;dx[0][y2 + 2][x2 - 32] = id;dx[0][y2 + 2][x2 - 31] = id;dx[0][y2 + 2][x2 - 30] = id;dx[0][y2 + 2][x2 - 29] = id;dx[0][y2 + 2][x2 - 28] = id;dx[0][y2 + 2][x2 - 27] = id;dx[0][y2 + 2][x2 - 26] = id;dx[0][y2 + 2][x2 - 25] = id;
	dx[0][y2 + 2][x2 - 24] = id;dx[0][y2 + 2][x2 - 23] = id;dx[0][y2 + 2][x2 - 22] = id;dx[0][y2 + 2][x2 - 21] = id;dx[0][y2 + 2][x2 - 20] = id;dx[0][y2 + 2][x2 - 19] = id;dx[0][y2 + 2][x2 - 17] = id;dx[0][y2 + 2][x2 - 16] = id;dx[0][y2 + 2][x2 - 15] = id;
	dx[0][y2 + 2][x2 - 14] = id;dx[0][y2 + 2][x2 - 12] = id;dx[0][y2 + 2][x2 - 11] = id;dx[0][y2 + 2][x2 - 10] = id;dx[0][y2 + 2][x2 - 9] = id;dx[0][y2 + 2][x2 - 8] = id;dx[0][y2 + 2][x2 - 7] = id;dx[0][y2 + 2][x2 - 6] = id;dx[0][y2 + 2][x2 - 5] = id;
	dx[0][y2 + 2][x2 - 4] = id;dx[0][y2 + 2][x2 - 3] = id;dx[0][y2 + 2][x2 - 2] = id;dx[0][y2 + 2][x2 - 1] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 1] = id;dx[0][y2 + 2][x2 + 2] = id;dx[0][y2 + 2][x2 + 3] = id;dx[0][y2 + 2][x2 + 4] = id;
	dx[0][y2 + 2][x2 + 5] = id;dx[0][y2 + 2][x2 + 6] = id;dx[0][y2 + 2][x2 + 7] = id;dx[0][y2 + 2][x2 + 8] = id;dx[0][y2 + 2][x2 + 9] = id;dx[0][y2 + 2][x2 + 10] = id;dx[0][y2 + 2][x2 + 11] = id;dx[0][y2 + 2][x2 + 13] = id;dx[0][y2 + 2][x2 + 14] = id;
	dx[0][y2 + 2][x2 + 15] = id;dx[0][y2 + 2][x2 + 16] = id;dx[0][y2 + 2][x2 + 17] = id;dx[0][y2 + 2][x2 + 18] = id;dx[0][y2 + 2][x2 + 19] = id;dx[0][y2 + 3][x2 - 57] = id;dx[0][y2 + 3][x2 - 17] = id;dx[0][y2 + 3][x2 - 16] = id;dx[0][y2 + 3][x2 - 15] = id;
	dx[0][y2 + 3][x2 - 14] = id;dx[0][y2 + 3][x2 - 13] = id;dx[0][y2 + 3][x2 - 12] = id;dx[0][y2 + 3][x2 - 11] = id;dx[0][y2 + 3][x2 - 10] = id;dx[0][y2 + 3][x2 - 9] = id;dx[0][y2 + 3][x2 - 8] = id;dx[0][y2 + 3][x2 - 7] = id;dx[0][y2 + 3][x2 - 6] = id;
	dx[0][y2 + 3][x2 - 5] = id;dx[0][y2 + 3][x2 - 4] = id;dx[0][y2 + 3][x2 - 3] = id;dx[0][y2 + 3][x2 - 2] = id;dx[0][y2 + 3][x2 - 1] = id;dx[0][y2 + 3][x2 + 0] = id;dx[0][y2 + 3][x2 + 1] = id;dx[0][y2 + 3][x2 + 2] = id;dx[0][y2 + 3][x2 + 3] = id;
	dx[0][y2 + 3][x2 + 4] = id;dx[0][y2 + 3][x2 + 5] = id;dx[0][y2 + 3][x2 + 6] = id;dx[0][y2 + 3][x2 + 7] = id;dx[0][y2 + 3][x2 + 8] = id;dx[0][y2 + 3][x2 + 9] = id;dx[0][y2 + 3][x2 + 10] = id;dx[0][y2 + 3][x2 + 11] = id;dx[0][y2 + 3][x2 + 12] = id;
	dx[0][y2 + 3][x2 + 13] = id;dx[0][y2 + 3][x2 + 14] = id;dx[0][y2 + 3][x2 + 15] = id;dx[0][y2 + 3][x2 + 16] = id;dx[0][y2 + 3][x2 + 17] = id;dx[0][y2 + 3][x2 + 18] = id;dx[0][y2 + 3][x2 + 19] = id;dx[0][y2 + 4][x2 - 57] = id;dx[0][y2 + 4][x2 - 56] = id;
	dx[0][y2 + 4][x2 - 55] = id;dx[0][y2 + 4][x2 - 20] = id;dx[0][y2 + 4][x2 - 19] = id;dx[0][y2 + 4][x2 - 17] = id;dx[0][y2 + 4][x2 - 16] = id;dx[0][y2 + 4][x2 - 15] = id;dx[0][y2 + 4][x2 - 14] = id;dx[0][y2 + 4][x2 - 13] = id;dx[0][y2 + 4][x2 - 12] = id;
	dx[0][y2 + 4][x2 - 11] = id;dx[0][y2 + 4][x2 + 12] = id;dx[0][y2 + 4][x2 + 13] = id;dx[0][y2 + 4][x2 + 14] = id;dx[0][y2 + 4][x2 + 15] = id;dx[0][y2 + 4][x2 + 16] = id;dx[0][y2 + 4][x2 + 17] = id;dx[0][y2 + 4][x2 + 18] = id;dx[0][y2 + 4][x2 + 19] = id;
	dx[0][y2 + 5][x2 - 57] = id;dx[0][y2 + 5][x2 - 56] = id;dx[0][y2 + 5][x2 - 55] = id;dx[0][y2 + 5][x2 - 20] = id;dx[0][y2 + 5][x2 - 19] = id;dx[0][y2 + 5][x2 - 17] = id;dx[0][y2 + 5][x2 - 16] = id;dx[0][y2 + 5][x2 - 15] = id;dx[0][y2 + 5][x2 - 14] = id;
	dx[0][y2 + 5][x2 - 13] = id;dx[0][y2 + 5][x2 - 12] = id;dx[0][y2 + 5][x2 - 11] = id;dx[0][y2 + 5][x2 + 12] = id;dx[0][y2 + 5][x2 + 13] = id;dx[0][y2 + 5][x2 + 14] = id;dx[0][y2 + 5][x2 + 15] = id;dx[0][y2 + 5][x2 + 16] = id;dx[0][y2 + 5][x2 + 17] = id;
	dx[0][y2 + 5][x2 + 18] = id;dx[0][y2 + 5][x2 + 19] = id;dx[0][y2 + 6][x2 - 57] = id;dx[0][y2 + 6][x2 - 17] = id;dx[0][y2 + 6][x2 + 19] = id;dx[0][y2 + 7][x2 - 57] = id;dx[0][y2 + 7][x2 - 56] = id;dx[0][y2 + 7][x2 - 55] = id;dx[0][y2 + 7][x2 - 54] = id;
	dx[0][y2 + 7][x2 - 53] = id;dx[0][y2 + 7][x2 - 22] = id;dx[0][y2 + 7][x2 - 21] = id;dx[0][y2 + 7][x2 - 20] = id;dx[0][y2 + 7][x2 - 19] = id;dx[0][y2 + 7][x2 - 17] = id;dx[0][y2 + 7][x2 - 16] = id;dx[0][y2 + 7][x2 - 15] = id;dx[0][y2 + 7][x2 - 14] = id;
	dx[0][y2 + 7][x2 + 15] = id;dx[0][y2 + 7][x2 + 16] = id;dx[0][y2 + 7][x2 + 17] = id;dx[0][y2 + 7][x2 + 18] = id;dx[0][y2 + 7][x2 + 19] = id;dx[0][y2 + 8][x2 - 57] = id;dx[0][y2 + 8][x2 - 56] = id;dx[0][y2 + 8][x2 - 55] = id;dx[0][y2 + 8][x2 - 54] = id;
	dx[0][y2 + 8][x2 - 53] = id;dx[0][y2 + 8][x2 - 22] = id;dx[0][y2 + 8][x2 - 21] = id;dx[0][y2 + 8][x2 - 20] = id;dx[0][y2 + 8][x2 - 19] = id;dx[0][y2 + 8][x2 - 17] = id;dx[0][y2 + 8][x2 - 16] = id;dx[0][y2 + 8][x2 - 15] = id;dx[0][y2 + 8][x2 - 14] = id;
	dx[0][y2 + 8][x2 + 15] = id;dx[0][y2 + 8][x2 + 16] = id;dx[0][y2 + 8][x2 + 17] = id;dx[0][y2 + 8][x2 + 18] = id;dx[0][y2 + 8][x2 + 19] = id;dx[0][y2 + 9][x2 - 57] = id;dx[0][y2 + 9][x2 - 17] = id;dx[0][y2 + 9][x2 + 19] = id;dx[0][y2 + 10][x2 - 57] = id;
	dx[0][y2 + 10][x2 - 56] = id;dx[0][y2 + 10][x2 - 55] = id;dx[0][y2 + 10][x2 - 20] = id;dx[0][y2 + 10][x2 - 19] = id;dx[0][y2 + 10][x2 - 16] = id;dx[0][y2 + 10][x2 - 15] = id;dx[0][y2 + 10][x2 - 14] = id;dx[0][y2 + 10][x2 - 13] = id;dx[0][y2 + 10][x2 - 12] = id;
	dx[0][y2 + 10][x2 + 13] = id;dx[0][y2 + 10][x2 + 14] = id;dx[0][y2 + 10][x2 + 15] = id;dx[0][y2 + 10][x2 + 16] = id;dx[0][y2 + 10][x2 + 17] = id;dx[0][y2 + 10][x2 + 18] = id;dx[0][y2 + 10][x2 + 19] = id;dx[0][y2 + 11][x2 - 57] = id;dx[0][y2 + 11][x2 - 56] = id;
	dx[0][y2 + 11][x2 - 55] = id;dx[0][y2 + 11][x2 - 20] = id;dx[0][y2 + 11][x2 - 19] = id;dx[0][y2 + 11][x2 - 17] = id;dx[0][y2 + 11][x2 - 16] = id;dx[0][y2 + 11][x2 - 15] = id;dx[0][y2 + 11][x2 - 14] = id;dx[0][y2 + 11][x2 - 13] = id;dx[0][y2 + 11][x2 - 12] = id;
	dx[0][y2 + 11][x2 + 13] = id;dx[0][y2 + 11][x2 + 14] = id;dx[0][y2 + 11][x2 + 15] = id;dx[0][y2 + 11][x2 + 16] = id;dx[0][y2 + 11][x2 + 17] = id;dx[0][y2 + 11][x2 + 18] = id;dx[0][y2 + 11][x2 + 19] = id;dx[0][y2 + 12][x2 - 57] = id;dx[0][y2 + 12][x2 - 17] = id;
	dx[0][y2 + 12][x2 + 19] = id;dx[0][y2 + 13][x2 - 57] = id;dx[0][y2 + 13][x2 - 56] = id;dx[0][y2 + 13][x2 - 55] = id;dx[0][y2 + 13][x2 - 54] = id;dx[0][y2 + 13][x2 - 53] = id;dx[0][y2 + 13][x2 - 21] = id;dx[0][y2 + 13][x2 - 20] = id;dx[0][y2 + 13][x2 - 19] = id;
	dx[0][y2 + 13][x2 - 17] = id;dx[0][y2 + 13][x2 - 16] = id;dx[0][y2 + 13][x2 - 15] = id;dx[0][y2 + 13][x2 + 17] = id;dx[0][y2 + 13][x2 + 18] = id;dx[0][y2 + 13][x2 + 19] = id;dx[0][y2 + 14][x2 - 57] = id;dx[0][y2 + 14][x2 - 56] = id;dx[0][y2 + 14][x2 - 55] = id;
	dx[0][y2 + 14][x2 - 54] = id;dx[0][y2 + 14][x2 - 53] = id;dx[0][y2 + 14][x2 - 52] = id;dx[0][y2 + 14][x2 - 51] = id;dx[0][y2 + 14][x2 - 50] = id;dx[0][y2 + 14][x2 - 49] = id;dx[0][y2 + 14][x2 - 48] = id;dx[0][y2 + 14][x2 - 47] = id;dx[0][y2 + 14][x2 - 46] = id;
	dx[0][y2 + 14][x2 - 45] = id;dx[0][y2 + 14][x2 - 44] = id;dx[0][y2 + 14][x2 - 43] = id;dx[0][y2 + 14][x2 - 42] = id;dx[0][y2 + 14][x2 - 41] = id;dx[0][y2 + 14][x2 - 40] = id;dx[0][y2 + 14][x2 - 39] = id;dx[0][y2 + 14][x2 - 38] = id;dx[0][y2 + 14][x2 - 37] = id;
	dx[0][y2 + 14][x2 - 36] = id;dx[0][y2 + 14][x2 - 35] = id;dx[0][y2 + 14][x2 - 34] = id;dx[0][y2 + 14][x2 - 33] = id;dx[0][y2 + 14][x2 - 32] = id;dx[0][y2 + 14][x2 - 31] = id;dx[0][y2 + 14][x2 - 30] = id;dx[0][y2 + 14][x2 - 29] = id;dx[0][y2 + 14][x2 - 28] = id;
	dx[0][y2 + 14][x2 - 27] = id;dx[0][y2 + 14][x2 - 26] = id;dx[0][y2 + 14][x2 - 25] = id;dx[0][y2 + 14][x2 - 24] = id;dx[0][y2 + 14][x2 - 23] = id;dx[0][y2 + 14][x2 - 22] = id;dx[0][y2 + 14][x2 - 21] = id;dx[0][y2 + 14][x2 - 20] = id;dx[0][y2 + 14][x2 - 19] = id;
	dx[0][y2 + 14][x2 - 18] = id;dx[0][y2 + 14][x2 - 17] = id;dx[0][y2 + 14][x2 - 16] = id;dx[0][y2 + 14][x2 - 15] = id;dx[0][y2 + 14][x2 - 14] = id;dx[0][y2 + 14][x2 - 13] = id;dx[0][y2 + 14][x2 - 12] = id;dx[0][y2 + 14][x2 - 11] = id;dx[0][y2 + 14][x2 - 10] = id;
	dx[0][y2 + 14][x2 - 9] = id;dx[0][y2 + 14][x2 - 8] = id;dx[0][y2 + 14][x2 - 7] = id;dx[0][y2 + 14][x2 - 6] = id;dx[0][y2 + 14][x2 - 5] = id;dx[0][y2 + 14][x2 - 4] = id;dx[0][y2 + 14][x2 - 3] = id;dx[0][y2 + 14][x2 - 2] = id;dx[0][y2 + 14][x2 - 1] = id;
	dx[0][y2 + 14][x2 + 0] = id;dx[0][y2 + 14][x2 + 1] = id;dx[0][y2 + 14][x2 + 2] = id;dx[0][y2 + 14][x2 + 3] = id;dx[0][y2 + 14][x2 + 4] = id;dx[0][y2 + 14][x2 + 5] = id;dx[0][y2 + 14][x2 + 6] = id;dx[0][y2 + 14][x2 + 7] = id;dx[0][y2 + 14][x2 + 8] = id;
	dx[0][y2 + 14][x2 + 9] = id;dx[0][y2 + 14][x2 + 10] = id;dx[0][y2 + 14][x2 + 11] = id;dx[0][y2 + 14][x2 + 12] = id;dx[0][y2 + 14][x2 + 13] = id;dx[0][y2 + 14][x2 + 14] = id;dx[0][y2 + 14][x2 + 15] = id;dx[0][y2 + 14][x2 + 16] = id;dx[0][y2 + 14][x2 + 17] = id;
	dx[0][y2 + 14][x2 + 18] = id;dx[0][y2 + 14][x2 + 19] = id;

	doorf(x1-1,y1-14);



	y2 -= 2;
	x2 += 23; 
	dx[0][y2 - 9][x2 + 0] = id;dx[0][y2 - 9][x2 + 1] = id;dx[0][y2 - 9][x2 + 2] = id;dx[0][y2 - 9][x2 + 3] = id;dx[0][y2 - 9][x2 + 4] = id;dx[0][y2 - 9][x2 + 5] = id;dx[0][y2 - 9][x2 + 6] = id;dx[0][y2 - 9][x2 + 7] = id;dx[0][y2 - 9][x2 + 8] = id;
	dx[0][y2 - 9][x2 + 9] = id;dx[0][y2 - 9][x2 + 10] = id;dx[0][y2 - 9][x2 + 11] = id;dx[0][y2 - 9][x2 + 12] = id;dx[0][y2 - 9][x2 + 13] = id;dx[0][y2 - 9][x2 + 14] = id;dx[0][y2 - 9][x2 + 15] = id;dx[0][y2 - 9][x2 + 16] = id;dx[0][y2 - 8][x2 + 0] = id;
	dx[0][y2 - 8][x2 + 5] = id;dx[0][y2 - 8][x2 + 7] = id;dx[0][y2 - 8][x2 + 16] = id;dx[0][y2 - 7][x2 + 0] = id;dx[0][y2 - 7][x2 + 4] = id;dx[0][y2 - 7][x2 + 6] = id;dx[0][y2 - 7][x2 + 16] = id;dx[0][y2 - 6][x2 + 0] = id;dx[0][y2 - 6][x2 + 3] = id;
	dx[0][y2 - 6][x2 + 5] = id;dx[0][y2 - 6][x2 + 16] = id;dx[0][y2 - 5][x2 + 0] = id;dx[0][y2 - 5][x2 + 2] = id;dx[0][y2 - 5][x2 + 3] = id;dx[0][y2 - 5][x2 + 16] = id;dx[0][y2 - 4][x2 + 0] = id;dx[0][y2 - 4][x2 + 1] = id;dx[0][y2 - 4][x2 + 2] = id;
	dx[0][y2 - 4][x2 + 15] = id;dx[0][y2 - 4][x2 + 16] = id;dx[0][y2 - 4][x2 + 17] = id;dx[0][y2 - 3][x2 + 0] = id;dx[0][y2 - 3][x2 + 1] = id;dx[0][y2 - 3][x2 + 14] = id;dx[0][y2 - 3][x2 + 16] = id;dx[0][y2 - 3][x2 + 19] = id;dx[0][y2 - 2][x2 + 0] = id;
	dx[0][y2 - 2][x2 + 13] = id;dx[0][y2 - 2][x2 + 20] = id;dx[0][y2 - 1][x2 + 0] = id;dx[0][y2 - 1][x2 + 11] = id;dx[0][y2 - 1][x2 + 21] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 10] = id;dx[0][y2 + 0][x2 + 22] = id;dx[0][y2 + 1][x2 + 0] = id;
	dx[0][y2 + 1][x2 + 9] = id;dx[0][y2 + 1][x2 + 10] = id;dx[0][y2 + 1][x2 + 11] = id;dx[0][y2 + 1][x2 + 12] = id;dx[0][y2 + 1][x2 + 13] = id;dx[0][y2 + 1][x2 + 14] = id;dx[0][y2 + 1][x2 + 15] = id;dx[0][y2 + 1][x2 + 16] = id;dx[0][y2 + 1][x2 + 17] = id;
	dx[0][y2 + 1][x2 + 18] = id;dx[0][y2 + 1][x2 + 19] = id;dx[0][y2 + 1][x2 + 20] = id;dx[0][y2 + 1][x2 + 21] = id;dx[0][y2 + 1][x2 + 22] = id;dx[0][y2 + 1][x2 + 23] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 3][x2 + 0] = id;dx[0][y2 + 4][x2 + 0] = id;
	dx[0][y2 + 5][x2 + 0] = id;dx[0][y2 + 6][x2 + 0] = id;dx[0][y2 + 7][x2 + 0] = id;dx[0][y2 + 8][x2 + 0] = id;dx[0][y2 + 8][x2 + 1] = id;dx[0][y2 + 9][x2 + 0] = id;dx[0][y2 + 9][x2 + 1] = id;dx[0][y2 + 9][x2 + 2] = id;dx[0][y2 + 10][x2 + 0] = id;
	dx[0][y2 + 10][x2 + 2] = id;dx[0][y2 + 10][x2 + 3] = id;dx[0][y2 + 10][x2 + 4] = id;dx[0][y2 + 11][x2 + 0] = id;dx[0][y2 + 11][x2 + 4] = id;dx[0][y2 + 11][x2 + 5] = id;dx[0][y2 + 11][x2 + 6] = id;dx[0][y2 + 12][x2 + 0] = id;dx[0][y2 + 12][x2 + 6] = id;
	dx[0][y2 + 12][x2 + 7] = id;dx[0][y2 + 13][x2 + 0] = id;dx[0][y2 + 13][x2 + 7] = id;dx[0][y2 + 13][x2 + 8] = id;dx[0][y2 + 13][x2 + 9] = id;dx[0][y2 + 14][x2 + 0] = id;dx[0][y2 + 14][x2 + 10] = id;dx[0][y2 + 14][x2 + 11] = id;dx[0][y2 + 15][x2 + 0] = id;
	dx[0][y2 + 15][x2 + 1] = id;dx[0][y2 + 15][x2 + 2] = id;dx[0][y2 + 15][x2 + 3] = id;dx[0][y2 + 15][x2 + 4] = id;dx[0][y2 + 15][x2 + 5] = id;dx[0][y2 + 15][x2 + 6] = id;dx[0][y2 + 15][x2 + 7] = id;dx[0][y2 + 15][x2 + 8] = id;dx[0][y2 + 15][x2 + 9] = id;
	dx[0][y2 + 15][x2 + 10] = id;dx[0][y2 + 15][x2 + 11] = id;dx[0][y2 + 15][x2 + 12] = id;dx[0][y2 + 15][x2 + 13] = id;dx[0][y2 + 15][x2 + 14] = id;dx[0][y2 + 15][x2 + 15] = id;dx[0][y2 + 15][x2 + 16] = id;dx[0][y2 + 15][x2 + 17] = id;dx[0][y2 + 15][x2 + 18] = id;
	dx[0][y2 + 15][x2 + 19] = id;dx[0][y2 + 15][x2 + 20] = id;dx[0][y2 + 16][x2 + 0] = id;dx[0][y2 + 16][x2 + 1] = id;dx[0][y2 + 16][x2 + 2] = id;dx[0][y2 + 16][x2 + 3] = id;dx[0][y2 + 16][x2 + 4] = id;dx[0][y2 + 16][x2 + 5] = id;dx[0][y2 + 16][x2 + 6] = id;
	dx[0][y2 + 16][x2 + 7] = id;dx[0][y2 + 16][x2 + 8] = id;dx[0][y2 + 16][x2 + 9] = id;dx[0][y2 + 16][x2 + 10] = id;dx[0][y2 + 16][x2 + 11] = id;dx[0][y2 + 16][x2 + 12] = id;dx[0][y2 + 16][x2 + 13] = id;dx[0][y2 + 16][x2 + 14] = id;dx[0][y2 + 16][x2 + 15] = id;
	dx[0][y2 + 16][x2 + 16] = id;dx[0][y2 + 16][x2 + 17] = id;dx[0][y2 + 16][x2 + 18] = id;dx[0][y2 + 16][x2 + 19] = id;dx[0][y2 + 16][x2 + 20] = id;dx[0][y2 + 16][x2 + 21] = id;dx[0][y2 + 16][x2 + 22] = id;dx[0][y2 + 16][x2 + 23] = id;
}

void dimondchair(int x2, int y2) 
{ x2 = x2 + 30 + 30;y2 = 600 - y2;
int id = 15;

dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 1][x2 - 1] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 1] = id;dx[0][y2 + 2][x2 - 5] = id;dx[0][y2 + 2][x2 - 4] = id;dx[0][y2 + 2][x2 - 3] = id;
dx[0][y2 + 2][x2 - 2] = id;dx[0][y2 + 2][x2 - 1] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 1] = id;dx[0][y2 + 2][x2 + 2] = id;dx[0][y2 + 2][x2 + 3] = id;dx[0][y2 + 2][x2 + 4] = id;dx[0][y2 + 2][x2 + 5] = id;dx[0][y2 + 3][x2 - 5] = id;
dx[0][y2 + 3][x2 - 4] = id;dx[0][y2 + 3][x2 - 3] = id;dx[0][y2 + 3][x2 - 2] = id;dx[0][y2 + 3][x2 - 1] = id;dx[0][y2 + 3][x2 + 0] = id;dx[0][y2 + 3][x2 + 1] = id;dx[0][y2 + 3][x2 + 2] = id;dx[0][y2 + 3][x2 + 3] = id;dx[0][y2 + 3][x2 + 4] = id;
dx[0][y2 + 3][x2 + 5] = id;dx[0][y2 + 4][x2 - 1] = id;dx[0][y2 + 4][x2 + 0] = id;dx[0][y2 + 4][x2 + 1] = id;dx[0][y2 + 5][x2 - 1] = id;dx[0][y2 + 5][x2 + 0] = id;dx[0][y2 + 5][x2 + 1] = id;dx[0][y2 + 6][x2 - 5] = id;dx[0][y2 + 6][x2 - 4] = id;
dx[0][y2 + 6][x2 - 3] = id;dx[0][y2 + 6][x2 - 2] = id;dx[0][y2 + 6][x2 - 1] = id;dx[0][y2 + 6][x2 + 0] = id;dx[0][y2 + 6][x2 + 1] = id;dx[0][y2 + 6][x2 + 2] = id;dx[0][y2 + 6][x2 + 3] = id;dx[0][y2 + 6][x2 + 4] = id;dx[0][y2 + 6][x2 + 5] = id;
dx[0][y2 + 7][x2 - 6] = id;dx[0][y2 + 7][x2 - 3] = id;dx[0][y2 + 7][x2 + 3] = id;dx[0][y2 + 7][x2 + 6] = id;dx[0][y2 + 8][x2 - 8] = id;dx[0][y2 + 8][x2 - 4] = id;dx[0][y2 + 8][x2 + 5] = id;dx[0][y2 + 8][x2 + 8] = id;dx[0][y2 + 9][x2 - 9] = id;
dx[0][y2 + 9][x2 - 8] = id;dx[0][y2 + 9][x2 - 7] = id;dx[0][y2 + 9][x2 - 6] = id;dx[0][y2 + 9][x2 - 5] = id;dx[0][y2 + 9][x2 - 4] = id;dx[0][y2 + 9][x2 - 3] = id;dx[0][y2 + 9][x2 - 2] = id;dx[0][y2 + 9][x2 - 1] = id;dx[0][y2 + 9][x2 + 0] = id;
dx[0][y2 + 9][x2 + 1] = id;dx[0][y2 + 9][x2 + 2] = id;dx[0][y2 + 9][x2 + 3] = id;dx[0][y2 + 9][x2 + 4] = id;dx[0][y2 + 9][x2 + 5] = id;dx[0][y2 + 9][x2 + 6] = id;dx[0][y2 + 9][x2 + 7] = id;dx[0][y2 + 9][x2 + 8] = id;dx[0][y2 + 9][x2 + 9] = id;
dx[0][y2 + 10][x2 - 9] = id;dx[0][y2 + 10][x2 - 6] = id;dx[0][y2 + 10][x2 + 0] = id;dx[0][y2 + 10][x2 + 6] = id;dx[0][y2 + 10][x2 + 9] = id;dx[0][y2 + 11][x2 - 8] = id;dx[0][y2 + 11][x2 - 7] = id;dx[0][y2 + 11][x2 - 4] = id;dx[0][y2 + 11][x2 + 0] = id;
dx[0][y2 + 11][x2 + 4] = id;dx[0][y2 + 11][x2 + 7] = id;dx[0][y2 + 11][x2 + 8] = id;dx[0][y2 + 12][x2 - 6] = id;dx[0][y2 + 12][x2 - 5] = id;dx[0][y2 + 12][x2 - 2] = id;dx[0][y2 + 12][x2 + 0] = id;dx[0][y2 + 12][x2 + 2] = id;dx[0][y2 + 12][x2 + 5] = id;
dx[0][y2 + 12][x2 + 6] = id;dx[0][y2 + 13][x2 - 3] = id;dx[0][y2 + 13][x2 + 0] = id;dx[0][y2 + 13][x2 + 3] = id;dx[0][y2 + 14][x2 - 1] = id;dx[0][y2 + 14][x2 + 0] = id;dx[0][y2 + 14][x2 + 1] = id;dx[0][y2 + 15][x2 - 4] = id;dx[0][y2 + 15][x2 - 3] = id;
dx[0][y2 + 15][x2 - 2] = id;dx[0][y2 + 15][x2 - 1] = id;dx[0][y2 + 15][x2 + 0] = id;dx[0][y2 + 15][x2 + 1] = id;dx[0][y2 + 15][x2 + 2] = id;dx[0][y2 + 15][x2 + 3] = id;dx[0][y2 + 15][x2 + 4] = id;dx[0][y2 + 16][x2 - 7] = id;dx[0][y2 + 16][x2 - 6] = id;
dx[0][y2 + 16][x2 - 5] = id;dx[0][y2 + 16][x2 - 4] = id;dx[0][y2 + 16][x2 + 4] = id;dx[0][y2 + 16][x2 + 5] = id;dx[0][y2 + 16][x2 + 6] = id;dx[0][y2 + 16][x2 + 7] = id;dx[0][y2 + 17][x2 - 10] = id;dx[0][y2 + 17][x2 - 9] = id;dx[0][y2 + 17][x2 - 8] = id;
dx[0][y2 + 17][x2 + 7] = id;dx[0][y2 + 17][x2 + 8] = id;dx[0][y2 + 17][x2 + 9] = id;dx[0][y2 + 18][x2 - 11] = id;dx[0][y2 + 18][x2 - 10] = id;dx[0][y2 + 18][x2 + 9] = id;dx[0][y2 + 18][x2 + 10] = id;dx[0][y2 + 18][x2 + 11] = id;dx[0][y2 + 19][x2 - 13] = id;
dx[0][y2 + 19][x2 - 12] = id;dx[0][y2 + 19][x2 - 11] = id;dx[0][y2 + 19][x2 + 11] = id;dx[0][y2 + 19][x2 + 12] = id;dx[0][y2 + 19][x2 + 13] = id;dx[0][y2 + 20][x2 - 14] = id;dx[0][y2 + 20][x2 - 13] = id;dx[0][y2 + 20][x2 + 13] = id;dx[0][y2 + 20][x2 + 14] = id;
dx[0][y2 + 21][x2 - 15] = id;dx[0][y2 + 21][x2 - 14] = id;dx[0][y2 + 21][x2 + 14] = id;dx[0][y2 + 21][x2 + 15] = id;dx[0][y2 + 22][x2 - 16] = id;dx[0][y2 + 22][x2 - 15] = id;dx[0][y2 + 22][x2 + 15] = id;dx[0][y2 + 23][x2 - 17] = id;dx[0][y2 + 23][x2 - 16] = id;
dx[0][y2 + 23][x2 + 15] = id;dx[0][y2 + 23][x2 + 16] = id;dx[0][y2 + 24][x2 - 17] = id;dx[0][y2 + 24][x2 + 16] = id;dx[0][y2 + 25][x2 - 18] = id;dx[0][y2 + 25][x2 - 17] = id;dx[0][y2 + 25][x2 + 16] = id;dx[0][y2 + 26][x2 - 18] = id;dx[0][y2 + 26][x2 + 16] = id;
dx[0][y2 + 26][x2 + 17] = id;dx[0][y2 + 27][x2 - 18] = id;dx[0][y2 + 27][x2 + 17] = id;dx[0][y2 + 28][x2 - 18] = id;dx[0][y2 + 28][x2 + 17] = id;dx[0][y2 + 28][x2 + 18] = id;dx[0][y2 + 29][x2 - 18] = id;dx[0][y2 + 29][x2 + 18] = id;dx[0][y2 + 30][x2 - 19] = id;
dx[0][y2 + 30][x2 - 18] = id;dx[0][y2 + 30][x2 - 17] = id;dx[0][y2 + 30][x2 - 16] = id;dx[0][y2 + 30][x2 - 15] = id;dx[0][y2 + 30][x2 - 14] = id;dx[0][y2 + 30][x2 - 13] = id;dx[0][y2 + 30][x2 - 12] = id;dx[0][y2 + 30][x2 - 11] = id;dx[0][y2 + 30][x2 - 10] = id;
dx[0][y2 + 30][x2 - 9] = id;dx[0][y2 + 30][x2 - 8] = id;dx[0][y2 + 30][x2 - 7] = id;dx[0][y2 + 30][x2 - 6] = id;dx[0][y2 + 30][x2 + 18] = id;dx[0][y2 + 31][x2 - 19] = id;dx[0][y2 + 31][x2 - 9] = id;dx[0][y2 + 31][x2 - 6] = id;dx[0][y2 + 31][x2 + 18] = id;
dx[0][y2 + 31][x2 + 19] = id;dx[0][y2 + 31][x2 + 20] = id;dx[0][y2 + 31][x2 + 21] = id;dx[0][y2 + 31][x2 + 22] = id;dx[0][y2 + 31][x2 + 23] = id;dx[0][y2 + 31][x2 + 24] = id;dx[0][y2 + 31][x2 + 25] = id;dx[0][y2 + 31][x2 + 26] = id;dx[0][y2 + 31][x2 + 27] = id;
dx[0][y2 + 31][x2 + 28] = id;dx[0][y2 + 32][x2 - 19] = id;dx[0][y2 + 32][x2 - 9] = id;dx[0][y2 + 32][x2 - 6] = id;dx[0][y2 + 32][x2 + 18] = id;dx[0][y2 + 32][x2 + 26] = id;dx[0][y2 + 32][x2 + 28] = id;dx[0][y2 + 33][x2 - 19] = id;dx[0][y2 + 33][x2 - 9] = id;
dx[0][y2 + 33][x2 - 6] = id;dx[0][y2 + 33][x2 + 18] = id;dx[0][y2 + 33][x2 + 26] = id;dx[0][y2 + 33][x2 + 28] = id;dx[0][y2 + 34][x2 - 19] = id;dx[0][y2 + 34][x2 - 9] = id;dx[0][y2 + 34][x2 - 6] = id;dx[0][y2 + 34][x2 + 18] = id;dx[0][y2 + 34][x2 + 26] = id;
dx[0][y2 + 34][x2 + 28] = id;dx[0][y2 + 35][x2 - 19] = id;dx[0][y2 + 35][x2 - 9] = id;dx[0][y2 + 35][x2 - 6] = id;dx[0][y2 + 35][x2 + 18] = id;dx[0][y2 + 35][x2 + 26] = id;dx[0][y2 + 35][x2 + 28] = id;dx[0][y2 + 36][x2 - 21] = id;dx[0][y2 + 36][x2 - 20] = id;
dx[0][y2 + 36][x2 - 19] = id;dx[0][y2 + 36][x2 - 18] = id;dx[0][y2 + 36][x2 - 17] = id;dx[0][y2 + 36][x2 - 16] = id;dx[0][y2 + 36][x2 - 15] = id;dx[0][y2 + 36][x2 - 14] = id;dx[0][y2 + 36][x2 - 13] = id;dx[0][y2 + 36][x2 - 12] = id;dx[0][y2 + 36][x2 - 11] = id;

id = 3;
dx[0][y2 + 36][x2 - 10] = id;dx[0][y2 + 36][x2 - 9] = id;dx[0][y2 + 36][x2 - 8] = id;dx[0][y2 + 36][x2 - 7] = id;dx[0][y2 + 36][x2 - 6] = id;dx[0][y2 + 36][x2 - 5] = id;dx[0][y2 + 36][x2 - 4] = id;dx[0][y2 + 36][x2 - 3] = id;dx[0][y2 + 36][x2 - 2] = id;
dx[0][y2 + 36][x2 - 1] = id;dx[0][y2 + 36][x2 + 0] = id;dx[0][y2 + 36][x2 + 1] = id;dx[0][y2 + 36][x2 + 2] = id;dx[0][y2 + 36][x2 + 3] = id;dx[0][y2 + 36][x2 + 4] = id;dx[0][y2 + 36][x2 + 5] = id;dx[0][y2 + 36][x2 + 6] = id;dx[0][y2 + 36][x2 + 7] = id;
dx[0][y2 + 36][x2 + 8] = id;dx[0][y2 + 36][x2 + 9] = id;dx[0][y2 + 36][x2 + 10] = id;dx[0][y2 + 36][x2 + 11] = id;dx[0][y2 + 36][x2 + 12] = id;dx[0][y2 + 36][x2 + 13] = id;dx[0][y2 + 36][x2 + 14] = id;dx[0][y2 + 36][x2 + 15] = id;dx[0][y2 + 36][x2 + 16] = id;
dx[0][y2 + 36][x2 + 17] = id;dx[0][y2 + 36][x2 + 18] = id;dx[0][y2 + 36][x2 + 19] = id;dx[0][y2 + 36][x2 + 20] = id;dx[0][y2 + 36][x2 + 21] = id;dx[0][y2 + 36][x2 + 22] = id;dx[0][y2 + 36][x2 + 23] = id;dx[0][y2 + 36][x2 + 24] = id;dx[0][y2 + 36][x2 + 25] = id;
dx[0][y2 + 36][x2 + 26] = id;dx[0][y2 + 36][x2 + 27] = id;dx[0][y2 + 36][x2 + 28] = id;dx[0][y2 + 36][x2 + 29] = id;dx[0][y2 + 37][x2 - 21] = id;dx[0][y2 + 37][x2 - 20] = id;dx[0][y2 + 37][x2 - 19] = id;dx[0][y2 + 37][x2 - 18] = id;dx[0][y2 + 37][x2 - 17] = id;
dx[0][y2 + 37][x2 - 16] = id;dx[0][y2 + 37][x2 - 15] = id;dx[0][y2 + 37][x2 - 14] = id;dx[0][y2 + 37][x2 - 13] = id;dx[0][y2 + 37][x2 - 12] = id;dx[0][y2 + 37][x2 - 11] = id;dx[0][y2 + 37][x2 - 10] = id;dx[0][y2 + 37][x2 - 9] = id;dx[0][y2 + 37][x2 - 8] = id;
dx[0][y2 + 37][x2 - 7] = id;dx[0][y2 + 37][x2 - 6] = id;dx[0][y2 + 37][x2 - 5] = id;dx[0][y2 + 37][x2 - 4] = id;dx[0][y2 + 37][x2 - 3] = id;dx[0][y2 + 37][x2 - 2] = id;dx[0][y2 + 37][x2 - 1] = id;dx[0][y2 + 37][x2 + 0] = id;dx[0][y2 + 37][x2 + 1] = id;
dx[0][y2 + 37][x2 + 2] = id;dx[0][y2 + 37][x2 + 3] = id;dx[0][y2 + 37][x2 + 4] = id;dx[0][y2 + 37][x2 + 5] = id;dx[0][y2 + 37][x2 + 6] = id;dx[0][y2 + 37][x2 + 7] = id;dx[0][y2 + 37][x2 + 8] = id;dx[0][y2 + 37][x2 + 9] = id;dx[0][y2 + 37][x2 + 10] = id;
dx[0][y2 + 37][x2 + 11] = id;dx[0][y2 + 37][x2 + 12] = id;dx[0][y2 + 37][x2 + 13] = id;dx[0][y2 + 37][x2 + 14] = id;dx[0][y2 + 37][x2 + 15] = id;dx[0][y2 + 37][x2 + 16] = id;dx[0][y2 + 37][x2 + 17] = id;dx[0][y2 + 37][x2 + 18] = id;dx[0][y2 + 37][x2 + 19] = id;
dx[0][y2 + 37][x2 + 20] = id;dx[0][y2 + 37][x2 + 21] = id;dx[0][y2 + 37][x2 + 22] = id;dx[0][y2 + 37][x2 + 23] = id;dx[0][y2 + 37][x2 + 24] = id;dx[0][y2 + 37][x2 + 25] = id;dx[0][y2 + 37][x2 + 26] = id;dx[0][y2 + 37][x2 + 27] = id;dx[0][y2 + 37][x2 + 28] = id;
dx[0][y2 + 37][x2 + 29] = id;

id = 15;
    y2 += 35;
dx[0][y2 - 10][x2 - 4] = id;dx[0][y2 - 10][x2 - 3] = id;dx[0][y2 - 10][x2 - 2] = id;dx[0][y2 - 10][x2 - 1] = id;dx[0][y2 - 10][x2 + 0] = id;dx[0][y2 - 10][x2 + 1] = id;dx[0][y2 - 9][x2 - 5] = id;dx[0][y2 - 9][x2 - 4] = id;dx[0][y2 - 9][x2 + 1] = id;
dx[0][y2 - 9][x2 + 2] = id;dx[0][y2 - 9][x2 + 3] = id;dx[0][y2 - 8][x2 - 5] = id;dx[0][y2 - 8][x2 + 3] = id;dx[0][y2 - 8][x2 + 4] = id;dx[0][y2 - 7][x2 + 4] = id;dx[0][y2 - 6][x2 + 4] = id;dx[0][y2 - 5][x2 + 4] = id;dx[0][y2 - 5][x2 + 5] = id;

dx[0][y2 - 4][x2 + 5] = id;dx[0][y2 - 3][x2 - 6] = id;dx[0][y2 - 3][x2 + 5] = id;
id = 2;
dx[0][y2 - 2][x2 - 6] = id;dx[0][y2 - 2][x2 - 5] = id;dx[0][y2 - 2][x2 - 4] = id;dx[0][y2 - 2][x2 - 3] = id;dx[0][y2 - 2][x2 - 2] = id;dx[0][y2 - 2][x2 - 1] = id;
dx[0][y2 - 2][x2 + 0] = id;dx[0][y2 - 2][x2 + 1] = id;dx[0][y2 - 2][x2 + 2] = id;dx[0][y2 - 2][x2 + 3] = id;dx[0][y2 - 2][x2 + 4] = id;dx[0][y2 - 2][x2 + 5] = id;dx[0][y2 - 2][x2 + 6] = id;dx[0][y2 - 2][x2 + 7] = id;dx[0][y2 - 2][x2 + 8] = id;
dx[0][y2 - 2][x2 + 9] = id;dx[0][y2 - 1][x2 - 6] = id;dx[0][y2 - 1][x2 + 5] = id;dx[0][y2 - 1][x2 + 9] = id;dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;
dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;dx[0][y2 + 0][x2 + 7] = id;
dx[0][y2 + 0][x2 + 8] = id;dx[0][y2 + 0][x2 + 9] = id;



}

void dimondstairs(int x2, int y2, short int count, short int con)
{
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	int id = 15;
	
	while (count) {
		if (con > 0) {
			dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 2] = id;dx[0][y2 + 3][x2 + 0] = id;dx[0][y2 + 3][x2 + 2] = id;dx[0][y2 + 3][x2 + 5] = id;dx[0][y2 + 4][x2 + 0] = id;
			dx[0][y2 + 4][x2 + 5] = id;dx[0][y2 + 4][x2 + 9] = id;dx[0][y2 + 4][x2 + 17] = id;dx[0][y2 + 4][x2 + 18] = id;dx[0][y2 + 5][x2 + 0] = id;dx[0][y2 + 5][x2 + 9] = id;dx[0][y2 + 5][x2 + 12] = id;dx[0][y2 + 5][x2 + 18] = id;dx[0][y2 + 6][x2 + 0] = id;
			dx[0][y2 + 6][x2 + 12] = id;dx[0][y2 + 6][x2 + 16] = id;dx[0][y2 + 6][x2 + 18] = id;
			dx[0][y2 + 7][x2 + 0] = 3;dx[0][y2 + 7][x2 + 1] = 3;dx[0][y2 + 7][x2 + 2] = 3;dx[0][y2 + 7][x2 + 3] = 3;dx[0][y2 + 7][x2 + 16] = id;dx[0][y2 + 7][x2 + 18] = id;
			dx[0][y2 + 8][x2 + 0] = 3;dx[0][y2 + 8][x2 + 3] = 3;dx[0][y2 + 8][x2 + 4] = 3;dx[0][y2 + 8][x2 + 5] = 3;dx[0][y2 + 8][x2 + 6] = 3;dx[0][y2 + 8][x2 + 7] = 3;dx[0][y2 + 8][x2 + 18] = id;
			dx[0][y2 + 9][x2 + 0] = 3;dx[0][y2 + 9][x2 + 1] = 3;dx[0][y2 + 9][x2 + 2] = id;dx[0][y2 + 9][x2 + 3] = id;dx[0][y2 + 9][x2 + 7] = 3;dx[0][y2 + 9][x2 + 8] = 3;dx[0][y2 + 9][x2 + 9] = 3;dx[0][y2 + 9][x2 + 10] = 3;dx[0][y2 + 9][x2 + 11] = 3;dx[0][y2 + 9][x2 + 18] = id;
			dx[0][y2 + 10][x2 + 3] = 3;dx[0][y2 + 10][x2 + 4] = 3;dx[0][y2 + 10][x2 + 5] = 3;dx[0][y2 + 10][x2 + 6] = 3;dx[0][y2 + 10][x2 + 7] = 3;dx[0][y2 + 10][x2 + 11] = 3;dx[0][y2 + 10][x2 + 12] = 3;dx[0][y2 + 10][x2 + 13] = 3;dx[0][y2 + 10][x2 + 14] = 3;dx[0][y2 + 10][x2 + 15] = 3;dx[0][y2 + 10][x2 + 18] = id;
			dx[0][y2 + 11][x2 + 7] = id;dx[0][y2 + 11][x2 + 8] = id;dx[0][y2 + 11][x2 + 9] = id;dx[0][y2 + 11][x2 + 10] = id;dx[0][y2 + 11][x2 + 11] = id;dx[0][y2 + 11][x2 + 15] = 3;dx[0][y2 + 11][x2 + 16] = 3;dx[0][y2 + 11][x2 + 17] = 3;dx[0][y2 + 11][x2 + 18] = 3;
			dx[0][y2 + 12][x2 + 11] = id;dx[0][y2 + 12][x2 + 12] = id;dx[0][y2 + 12][x2 + 13] = id;dx[0][y2 + 12][x2 + 14] = id;dx[0][y2 + 12][x2 + 15] = id;dx[0][y2 + 12][x2 + 18] = id;dx[0][y2 + 13][x2 + 18] = id;
			
			x2 += 19;
		}
		else 
		{
			dx[0][y2 + 0][x2 -0] = id;dx[0][y2 + 0][x2 -1] = id;dx[0][y2 + 1][x2 -0] = id;dx[0][y2 + 2][x2 -0] = id;dx[0][y2 + 2][x2 -2] = id;dx[0][y2 + 3][x2 -0] = id;dx[0][y2 + 3][x2 -2] = id;dx[0][y2 + 3][x2 -5] = id;dx[0][y2 + 4][x2 -0] = id;
			dx[0][y2 + 4][x2 -5] = id;dx[0][y2 + 4][x2 -9] = id;dx[0][y2 + 4][x2 -17] = id;dx[0][y2 + 4][x2 -18] = id;dx[0][y2 + 5][x2 -0] = id;dx[0][y2 + 5][x2 -9] = id;dx[0][y2 + 5][x2 -12] = id;dx[0][y2 + 5][x2 -18] = id;dx[0][y2 + 6][x2 -0] = id;
			dx[0][y2 + 6][x2 -12] = id;dx[0][y2 + 6][x2 -16] = id;dx[0][y2 + 6][x2 -18] = id;
			dx[0][y2 + 7][x2 -0] = 3;dx[0][y2 + 7][x2 -1] = 3;dx[0][y2 + 7][x2 -2] = 3;dx[0][y2 + 7][x2 -3] = 3;dx[0][y2 + 7][x2 -16] = id;dx[0][y2 + 7][x2 -18] = id;
			dx[0][y2 + 8][x2 -0] = 3;dx[0][y2 + 8][x2 -3] = 3;dx[0][y2 + 8][x2 -4] = 3;dx[0][y2 + 8][x2 -5] = 3;dx[0][y2 + 8][x2 -6] = 3;dx[0][y2 + 8][x2 -7] = 3;dx[0][y2 + 8][x2 -18] = id;
			dx[0][y2 + 9][x2 -0] = 3;dx[0][y2 + 9][x2 -1] = 3;dx[0][y2 + 9][x2 -2] = id;dx[0][y2 + 9][x2 -3] = id;dx[0][y2 + 9][x2 -7] = 3;dx[0][y2 + 9][x2 -8] = 3;dx[0][y2 + 9][x2 -9] = 3;dx[0][y2 + 9][x2 -10] = 3;dx[0][y2 + 9][x2 -11] = 3;dx[0][y2 + 9][x2 -18] = id;
			dx[0][y2 + 10][x2 -3] = 3;dx[0][y2 + 10][x2 -4] = 3;dx[0][y2 + 10][x2 -5] = 3;dx[0][y2 + 10][x2 -6] = 3;dx[0][y2 + 10][x2 -7] = 3;dx[0][y2 + 10][x2 -11] = 3;dx[0][y2 + 10][x2 -12] = 3;dx[0][y2 + 10][x2 -13] = 3;dx[0][y2 + 10][x2 -14] = 3;dx[0][y2 + 10][x2 -15] = 3;dx[0][y2 + 10][x2 -18] = id;
			dx[0][y2 + 11][x2 -7] = id;dx[0][y2 + 11][x2 -8] = id;dx[0][y2 + 11][x2 -9] = id;dx[0][y2 + 11][x2 -10] = id;dx[0][y2 + 11][x2 -11] = id;dx[0][y2 + 11][x2 -15] = 3;dx[0][y2 + 11][x2 -16] = 3;dx[0][y2 + 11][x2 -17] = 3;dx[0][y2 + 11][x2 -18] = 3;
			dx[0][y2 + 12][x2 -11] = id;dx[0][y2 + 12][x2 -12] = id;dx[0][y2 + 12][x2 -13] = id;dx[0][y2 + 12][x2 -14] = id;dx[0][y2 + 12][x2 -15] = id;dx[0][y2 + 12][x2 -18] = id;dx[0][y2 + 13][x2 -18] = id;

			x2 -= 19;
		}
		y2 = y2 + 4;
		count--;
	}
		
	
	
}

void kingdomwindow(int x2, int y2)
{
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	int id = 15;
	dx[0][y2 - 17][x2 - 7] = id;dx[0][y2 - 17][x2 - 6] = id;dx[0][y2 - 17][x2 - 5] = id;dx[0][y2 - 17][x2 - 4] = id;dx[0][y2 - 17][x2 - 3] = id;dx[0][y2 - 17][x2 - 2] = id;dx[0][y2 - 17][x2 - 1] = id;dx[0][y2 - 17][x2 + 0] = id;dx[0][y2 - 17][x2 + 1] = id;
	dx[0][y2 - 17][x2 + 2] = id;dx[0][y2 - 17][x2 + 3] = id;dx[0][y2 - 17][x2 + 4] = id;dx[0][y2 - 17][x2 + 5] = id;dx[0][y2 - 17][x2 + 6] = id;dx[0][y2 - 16][x2 - 10] = id;dx[0][y2 - 16][x2 - 9] = id;dx[0][y2 - 16][x2 - 8] = id;dx[0][y2 - 16][x2 - 7] = id;
	dx[0][y2 - 16][x2 - 6] = id;dx[0][y2 - 16][x2 - 5] = id;dx[0][y2 - 16][x2 + 0] = id;dx[0][y2 - 16][x2 + 5] = id;dx[0][y2 - 16][x2 + 6] = id;dx[0][y2 - 16][x2 + 7] = id;dx[0][y2 - 16][x2 + 8] = id;dx[0][y2 - 16][x2 + 9] = id;dx[0][y2 - 15][x2 - 13] = id;
	dx[0][y2 - 15][x2 - 12] = id;dx[0][y2 - 15][x2 - 11] = id;dx[0][y2 - 15][x2 - 10] = id;dx[0][y2 - 15][x2 + 0] = id;dx[0][y2 - 15][x2 + 9] = id;dx[0][y2 - 15][x2 + 10] = id;dx[0][y2 - 15][x2 + 11] = id;dx[0][y2 - 15][x2 + 12] = id;dx[0][y2 - 15][x2 + 13] = id;
	dx[0][y2 - 14][x2 - 17] = id;dx[0][y2 - 14][x2 - 16] = id;dx[0][y2 - 14][x2 - 15] = id;dx[0][y2 - 14][x2 - 14] = id;dx[0][y2 - 14][x2 + 0] = id;dx[0][y2 - 14][x2 + 13] = id;dx[0][y2 - 14][x2 + 14] = id;dx[0][y2 - 14][x2 + 15] = id;dx[0][y2 - 14][x2 + 16] = id;
	dx[0][y2 - 13][x2 - 19] = id;dx[0][y2 - 13][x2 - 18] = id;dx[0][y2 - 13][x2 - 17] = id;dx[0][y2 - 13][x2 + 0] = id;dx[0][y2 - 13][x2 + 16] = id;dx[0][y2 - 13][x2 + 17] = id;dx[0][y2 - 13][x2 + 18] = id;dx[0][y2 - 12][x2 - 20] = id;dx[0][y2 - 12][x2 - 19] = id;
	dx[0][y2 - 12][x2 - 18] = id;dx[0][y2 - 12][x2 - 17] = id;dx[0][y2 - 12][x2 - 16] = id;dx[0][y2 - 12][x2 - 15] = id;dx[0][y2 - 12][x2 - 14] = id;dx[0][y2 - 12][x2 - 13] = id;dx[0][y2 - 12][x2 - 12] = id;dx[0][y2 - 12][x2 - 11] = id;dx[0][y2 - 12][x2 - 10] = id;
	dx[0][y2 - 12][x2 - 9] = id;dx[0][y2 - 12][x2 - 8] = id;dx[0][y2 - 12][x2 - 7] = id;dx[0][y2 - 12][x2 - 6] = id;dx[0][y2 - 12][x2 - 5] = id;dx[0][y2 - 12][x2 - 4] = id;dx[0][y2 - 12][x2 - 3] = id;dx[0][y2 - 12][x2 - 2] = id;dx[0][y2 - 12][x2 - 1] = id;
	dx[0][y2 - 12][x2 + 0] = id;dx[0][y2 - 12][x2 + 1] = id;dx[0][y2 - 12][x2 + 2] = id;dx[0][y2 - 12][x2 + 3] = id;dx[0][y2 - 12][x2 + 4] = id;dx[0][y2 - 12][x2 + 5] = id;dx[0][y2 - 12][x2 + 6] = id;dx[0][y2 - 12][x2 + 7] = id;dx[0][y2 - 12][x2 + 8] = id;
	dx[0][y2 - 12][x2 + 9] = id;dx[0][y2 - 12][x2 + 10] = id;dx[0][y2 - 12][x2 + 11] = id;dx[0][y2 - 12][x2 + 12] = id;dx[0][y2 - 12][x2 + 13] = id;dx[0][y2 - 12][x2 + 14] = id;dx[0][y2 - 12][x2 + 15] = id;dx[0][y2 - 12][x2 + 16] = id;dx[0][y2 - 12][x2 + 17] = id;
	dx[0][y2 - 12][x2 + 18] = id;dx[0][y2 - 12][x2 + 19] = id;dx[0][y2 - 11][x2 - 21] = id;dx[0][y2 - 11][x2 - 20] = id;dx[0][y2 - 11][x2 - 14] = id;dx[0][y2 - 11][x2 + 0] = id;dx[0][y2 - 11][x2 + 13] = id;dx[0][y2 - 11][x2 + 19] = id;dx[0][y2 - 10][x2 - 23] = id;
	dx[0][y2 - 10][x2 - 22] = id;dx[0][y2 - 10][x2 - 20] = id;dx[0][y2 - 10][x2 - 16] = id;dx[0][y2 - 10][x2 - 14] = id;dx[0][y2 - 10][x2 - 12] = id;dx[0][y2 - 10][x2 - 2] = id;dx[0][y2 - 10][x2 + 0] = id;dx[0][y2 - 10][x2 + 2] = id;dx[0][y2 - 10][x2 + 11] = id;
	dx[0][y2 - 10][x2 + 13] = id;dx[0][y2 - 10][x2 + 15] = id;dx[0][y2 - 10][x2 + 19] = id;dx[0][y2 - 10][x2 + 20] = id;dx[0][y2 - 10][x2 + 21] = id;dx[0][y2 - 9][x2 - 24] = id;dx[0][y2 - 9][x2 - 23] = id;dx[0][y2 - 9][x2 - 22] = id;dx[0][y2 - 9][x2 - 20] = id;
	dx[0][y2 - 9][x2 - 17] = id;dx[0][y2 - 9][x2 - 15] = id;dx[0][y2 - 9][x2 - 14] = id;dx[0][y2 - 9][x2 - 13] = id;dx[0][y2 - 9][x2 - 11] = id;dx[0][y2 - 9][x2 - 3] = id;dx[0][y2 - 9][x2 - 1] = id;dx[0][y2 - 9][x2 + 0] = id;dx[0][y2 - 9][x2 + 1] = id;
	dx[0][y2 - 9][x2 + 3] = id;dx[0][y2 - 9][x2 + 10] = id;dx[0][y2 - 9][x2 + 12] = id;dx[0][y2 - 9][x2 + 13] = id;dx[0][y2 - 9][x2 + 14] = id;dx[0][y2 - 9][x2 + 16] = id;dx[0][y2 - 9][x2 + 19] = id;dx[0][y2 - 9][x2 + 20] = id;dx[0][y2 - 9][x2 + 21] = id;
	dx[0][y2 - 9][x2 + 22] = id;dx[0][y2 - 8][x2 - 24] = id;dx[0][y2 - 8][x2 - 23] = id;dx[0][y2 - 8][x2 - 20] = id;dx[0][y2 - 8][x2 - 18] = id;dx[0][y2 - 8][x2 - 14] = id;dx[0][y2 - 8][x2 - 10] = id;dx[0][y2 - 8][x2 - 4] = id;dx[0][y2 - 8][x2 + 0] = id;
	dx[0][y2 - 8][x2 + 4] = id;dx[0][y2 - 8][x2 + 9] = id;dx[0][y2 - 8][x2 + 13] = id;dx[0][y2 - 8][x2 + 17] = id;dx[0][y2 - 8][x2 + 19] = id;dx[0][y2 - 8][x2 + 21] = id;dx[0][y2 - 8][x2 + 22] = id;dx[0][y2 - 8][x2 + 23] = id;dx[0][y2 - 7][x2 - 25] = id;
	dx[0][y2 - 7][x2 - 23] = id;dx[0][y2 - 7][x2 - 20] = id;dx[0][y2 - 7][x2 - 18] = id;dx[0][y2 - 7][x2 - 16] = id;dx[0][y2 - 7][x2 - 15] = id;dx[0][y2 - 7][x2 - 14] = id;dx[0][y2 - 7][x2 - 13] = id;dx[0][y2 - 7][x2 - 12] = id;dx[0][y2 - 7][x2 - 10] = id;
	dx[0][y2 - 7][x2 - 4] = id;dx[0][y2 - 7][x2 - 2] = id;dx[0][y2 - 7][x2 - 1] = id;dx[0][y2 - 7][x2 + 0] = id;dx[0][y2 - 7][x2 + 1] = id;dx[0][y2 - 7][x2 + 2] = id;dx[0][y2 - 7][x2 + 4] = id;dx[0][y2 - 7][x2 + 9] = id;dx[0][y2 - 7][x2 + 11] = id;
	dx[0][y2 - 7][x2 + 12] = id;dx[0][y2 - 7][x2 + 13] = id;dx[0][y2 - 7][x2 + 14] = id;dx[0][y2 - 7][x2 + 15] = id;dx[0][y2 - 7][x2 + 17] = id;dx[0][y2 - 7][x2 + 19] = id;dx[0][y2 - 7][x2 + 21] = id;dx[0][y2 - 7][x2 + 22] = id;dx[0][y2 - 7][x2 + 23] = id;
	dx[0][y2 - 6][x2 - 25] = id;dx[0][y2 - 6][x2 - 24] = id;dx[0][y2 - 6][x2 - 23] = id;dx[0][y2 - 6][x2 - 20] = id;dx[0][y2 - 6][x2 - 18] = id;dx[0][y2 - 6][x2 - 14] = id;dx[0][y2 - 6][x2 - 10] = id;dx[0][y2 - 6][x2 - 4] = id;dx[0][y2 - 6][x2 + 0] = id;
	dx[0][y2 - 6][x2 + 4] = id;dx[0][y2 - 6][x2 + 9] = id;dx[0][y2 - 6][x2 + 13] = id;dx[0][y2 - 6][x2 + 17] = id;dx[0][y2 - 6][x2 + 19] = id;dx[0][y2 - 6][x2 + 22] = id;dx[0][y2 - 6][x2 + 23] = id;dx[0][y2 - 5][x2 - 25] = id;dx[0][y2 - 5][x2 - 24] = id;
	dx[0][y2 - 5][x2 - 23] = id;dx[0][y2 - 5][x2 - 20] = id;dx[0][y2 - 5][x2 - 18] = id;dx[0][y2 - 5][x2 - 16] = id;dx[0][y2 - 5][x2 - 15] = id;dx[0][y2 - 5][x2 - 14] = id;dx[0][y2 - 5][x2 - 13] = id;dx[0][y2 - 5][x2 - 12] = id;dx[0][y2 - 5][x2 - 10] = id;
	dx[0][y2 - 5][x2 - 4] = id;dx[0][y2 - 5][x2 - 2] = id;dx[0][y2 - 5][x2 - 1] = id;dx[0][y2 - 5][x2 + 0] = id;dx[0][y2 - 5][x2 + 1] = id;dx[0][y2 - 5][x2 + 2] = id;dx[0][y2 - 5][x2 + 4] = id;dx[0][y2 - 5][x2 + 9] = id;dx[0][y2 - 5][x2 + 11] = id;
	dx[0][y2 - 5][x2 + 12] = id;dx[0][y2 - 5][x2 + 13] = id;dx[0][y2 - 5][x2 + 14] = id;dx[0][y2 - 5][x2 + 15] = id;dx[0][y2 - 5][x2 + 17] = id;dx[0][y2 - 5][x2 + 19] = id;dx[0][y2 - 5][x2 + 22] = id;dx[0][y2 - 5][x2 + 23] = id;dx[0][y2 - 4][x2 - 25] = id;
	dx[0][y2 - 4][x2 - 23] = id;dx[0][y2 - 4][x2 - 20] = id;dx[0][y2 - 4][x2 - 18] = id;dx[0][y2 - 4][x2 - 14] = id;dx[0][y2 - 4][x2 - 10] = id;dx[0][y2 - 4][x2 - 4] = id;dx[0][y2 - 4][x2 + 0] = id;dx[0][y2 - 4][x2 + 4] = id;dx[0][y2 - 4][x2 + 9] = id;
	dx[0][y2 - 4][x2 + 13] = id;dx[0][y2 - 4][x2 + 17] = id;dx[0][y2 - 4][x2 + 19] = id;dx[0][y2 - 4][x2 + 22] = id;dx[0][y2 - 4][x2 + 23] = id;dx[0][y2 - 4][x2 + 24] = id;dx[0][y2 - 3][x2 - 26] = id;dx[0][y2 - 3][x2 - 25] = id;dx[0][y2 - 3][x2 - 23] = id;
	dx[0][y2 - 3][x2 - 20] = id;dx[0][y2 - 3][x2 - 18] = id;dx[0][y2 - 3][x2 - 16] = id;dx[0][y2 - 3][x2 - 15] = id;dx[0][y2 - 3][x2 - 14] = id;dx[0][y2 - 3][x2 - 13] = id;dx[0][y2 - 3][x2 - 12] = id;dx[0][y2 - 3][x2 - 10] = id;dx[0][y2 - 3][x2 - 4] = id;
	dx[0][y2 - 3][x2 - 2] = id;dx[0][y2 - 3][x2 - 1] = id;dx[0][y2 - 3][x2 + 0] = id;dx[0][y2 - 3][x2 + 1] = id;dx[0][y2 - 3][x2 + 2] = id;dx[0][y2 - 3][x2 + 4] = id;dx[0][y2 - 3][x2 + 9] = id;dx[0][y2 - 3][x2 + 11] = id;dx[0][y2 - 3][x2 + 12] = id;
	dx[0][y2 - 3][x2 + 13] = id;dx[0][y2 - 3][x2 + 14] = id;dx[0][y2 - 3][x2 + 15] = id;dx[0][y2 - 3][x2 + 17] = id;dx[0][y2 - 3][x2 + 19] = id;dx[0][y2 - 3][x2 + 22] = id;dx[0][y2 - 3][x2 + 23] = id;dx[0][y2 - 3][x2 + 24] = id;dx[0][y2 - 2][x2 - 26] = id;
	dx[0][y2 - 2][x2 - 23] = id;dx[0][y2 - 2][x2 - 20] = id;dx[0][y2 - 2][x2 - 18] = id;dx[0][y2 - 2][x2 - 14] = id;dx[0][y2 - 2][x2 - 10] = id;dx[0][y2 - 2][x2 - 4] = id;dx[0][y2 - 2][x2 + 0] = id;dx[0][y2 - 2][x2 + 4] = id;dx[0][y2 - 2][x2 + 9] = id;
	dx[0][y2 - 2][x2 + 13] = id;dx[0][y2 - 2][x2 + 17] = id;dx[0][y2 - 2][x2 + 19] = id;dx[0][y2 - 2][x2 + 22] = id;dx[0][y2 - 2][x2 + 24] = id;dx[0][y2 - 1][x2 - 26] = id;dx[0][y2 - 1][x2 - 23] = id;dx[0][y2 - 1][x2 - 20] = id;dx[0][y2 - 1][x2 - 18] = id;
	dx[0][y2 - 1][x2 - 14] = id;dx[0][y2 - 1][x2 - 10] = id;dx[0][y2 - 1][x2 - 4] = id;dx[0][y2 - 1][x2 + 0] = id;dx[0][y2 - 1][x2 + 4] = id;dx[0][y2 - 1][x2 + 9] = id;dx[0][y2 - 1][x2 + 13] = id;dx[0][y2 - 1][x2 + 17] = id;dx[0][y2 - 1][x2 + 19] = id;
	dx[0][y2 - 1][x2 + 22] = id;dx[0][y2 - 1][x2 + 24] = id;dx[0][y2 + 0][x2 - 26] = id;dx[0][y2 + 0][x2 - 25] = id;dx[0][y2 + 0][x2 - 24] = id;dx[0][y2 + 0][x2 - 23] = id;dx[0][y2 + 0][x2 - 22] = id;dx[0][y2 + 0][x2 - 21] = id;dx[0][y2 + 0][x2 - 20] = id;
	dx[0][y2 + 0][x2 - 19] = id;dx[0][y2 + 0][x2 - 18] = id;dx[0][y2 + 0][x2 - 17] = id;dx[0][y2 + 0][x2 - 16] = id;dx[0][y2 + 0][x2 - 15] = id;dx[0][y2 + 0][x2 - 14] = id;dx[0][y2 + 0][x2 - 13] = id;dx[0][y2 + 0][x2 - 12] = id;dx[0][y2 + 0][x2 - 11] = id;
	dx[0][y2 + 0][x2 - 10] = id;dx[0][y2 + 0][x2 - 9] = id;dx[0][y2 + 0][x2 - 8] = id;dx[0][y2 + 0][x2 - 7] = id;dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;
	dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;dx[0][y2 + 0][x2 + 7] = id;
	dx[0][y2 + 0][x2 + 8] = id;dx[0][y2 + 0][x2 + 9] = id;dx[0][y2 + 0][x2 + 10] = id;dx[0][y2 + 0][x2 + 11] = id;dx[0][y2 + 0][x2 + 12] = id;dx[0][y2 + 0][x2 + 13] = id;dx[0][y2 + 0][x2 + 14] = id;dx[0][y2 + 0][x2 + 15] = id;dx[0][y2 + 0][x2 + 16] = id;
	dx[0][y2 + 0][x2 + 17] = id;dx[0][y2 + 0][x2 + 18] = id;dx[0][y2 + 0][x2 + 19] = id;dx[0][y2 + 0][x2 + 20] = id;dx[0][y2 + 0][x2 + 21] = id;dx[0][y2 + 0][x2 + 22] = id;dx[0][y2 + 0][x2 + 23] = id;dx[0][y2 + 0][x2 + 24] = id;dx[0][y2 + 0][x2 + 25] = id;
	dx[0][y2 + 1][x2 - 26] = id;dx[0][y2 + 1][x2 + 25] = id;dx[0][y2 + 2][x2 - 26] = id;dx[0][y2 + 2][x2 - 23] = id;dx[0][y2 + 2][x2 - 22] = id;dx[0][y2 + 2][x2 - 21] = id;dx[0][y2 + 2][x2 - 20] = id;dx[0][y2 + 2][x2 - 19] = id;dx[0][y2 + 2][x2 - 18] = id;
	dx[0][y2 + 2][x2 - 17] = id;dx[0][y2 + 2][x2 - 16] = id;dx[0][y2 + 2][x2 - 15] = id;dx[0][y2 + 2][x2 - 14] = id;dx[0][y2 + 2][x2 - 10] = id;dx[0][y2 + 2][x2 - 9] = id;dx[0][y2 + 2][x2 - 8] = id;dx[0][y2 + 2][x2 - 7] = id;dx[0][y2 + 2][x2 - 6] = id;
	dx[0][y2 + 2][x2 - 5] = id;dx[0][y2 + 2][x2 - 4] = id;dx[0][y2 + 2][x2 - 3] = id;dx[0][y2 + 2][x2 - 2] = id;dx[0][y2 + 2][x2 + 2] = id;dx[0][y2 + 2][x2 + 3] = id;dx[0][y2 + 2][x2 + 4] = id;dx[0][y2 + 2][x2 + 5] = id;dx[0][y2 + 2][x2 + 6] = id;
	dx[0][y2 + 2][x2 + 7] = id;dx[0][y2 + 2][x2 + 8] = id;dx[0][y2 + 2][x2 + 9] = id;dx[0][y2 + 2][x2 + 10] = id;dx[0][y2 + 2][x2 + 14] = id;dx[0][y2 + 2][x2 + 15] = id;dx[0][y2 + 2][x2 + 16] = id;dx[0][y2 + 2][x2 + 17] = id;dx[0][y2 + 2][x2 + 18] = id;
	dx[0][y2 + 2][x2 + 19] = id;dx[0][y2 + 2][x2 + 20] = id;dx[0][y2 + 2][x2 + 21] = id;dx[0][y2 + 2][x2 + 22] = id;dx[0][y2 + 2][x2 + 23] = id;dx[0][y2 + 2][x2 + 25] = id;dx[0][y2 + 3][x2 - 26] = id;dx[0][y2 + 3][x2 - 23] = id;dx[0][y2 + 3][x2 - 13] = id;
	dx[0][y2 + 3][x2 - 11] = id;dx[0][y2 + 3][x2 - 1] = id;dx[0][y2 + 3][x2 + 1] = id;dx[0][y2 + 3][x2 + 11] = id;dx[0][y2 + 3][x2 + 13] = id;dx[0][y2 + 3][x2 + 23] = id;dx[0][y2 + 3][x2 + 25] = id;dx[0][y2 + 4][x2 - 26] = id;dx[0][y2 + 4][x2 - 23] = id;
	dx[0][y2 + 4][x2 - 13] = id;dx[0][y2 + 4][x2 - 11] = id;dx[0][y2 + 4][x2 - 1] = id;dx[0][y2 + 4][x2 + 1] = id;dx[0][y2 + 4][x2 + 11] = id;dx[0][y2 + 4][x2 + 13] = id;dx[0][y2 + 4][x2 + 23] = id;dx[0][y2 + 4][x2 + 25] = id;dx[0][y2 + 5][x2 - 26] = id;
	dx[0][y2 + 5][x2 - 23] = id;dx[0][y2 + 5][x2 - 13] = id;dx[0][y2 + 5][x2 - 11] = id;dx[0][y2 + 5][x2 - 1] = id;dx[0][y2 + 5][x2 + 1] = id;dx[0][y2 + 5][x2 + 11] = id;dx[0][y2 + 5][x2 + 13] = id;dx[0][y2 + 5][x2 + 23] = id;dx[0][y2 + 5][x2 + 25] = id;
	dx[0][y2 + 6][x2 - 26] = id;dx[0][y2 + 6][x2 - 23] = id;dx[0][y2 + 6][x2 - 13] = id;dx[0][y2 + 6][x2 - 11] = id;dx[0][y2 + 6][x2 - 1] = id;dx[0][y2 + 6][x2 + 1] = id;dx[0][y2 + 6][x2 + 11] = id;dx[0][y2 + 6][x2 + 13] = id;dx[0][y2 + 6][x2 + 23] = id;
	dx[0][y2 + 6][x2 + 25] = id;dx[0][y2 + 7][x2 - 26] = id;dx[0][y2 + 7][x2 - 23] = id;dx[0][y2 + 7][x2 - 22] = id;dx[0][y2 + 7][x2 - 21] = id;dx[0][y2 + 7][x2 - 20] = id;dx[0][y2 + 7][x2 - 19] = id;dx[0][y2 + 7][x2 - 18] = id;dx[0][y2 + 7][x2 - 17] = id;
	dx[0][y2 + 7][x2 - 16] = id;dx[0][y2 + 7][x2 - 15] = id;dx[0][y2 + 7][x2 - 14] = id;dx[0][y2 + 7][x2 - 10] = id;dx[0][y2 + 7][x2 - 9] = id;dx[0][y2 + 7][x2 - 8] = id;dx[0][y2 + 7][x2 - 7] = id;dx[0][y2 + 7][x2 - 6] = id;dx[0][y2 + 7][x2 - 5] = id;
	dx[0][y2 + 7][x2 - 4] = id;dx[0][y2 + 7][x2 - 3] = id;dx[0][y2 + 7][x2 - 2] = id;dx[0][y2 + 7][x2 + 2] = id;dx[0][y2 + 7][x2 + 3] = id;dx[0][y2 + 7][x2 + 4] = id;dx[0][y2 + 7][x2 + 5] = id;dx[0][y2 + 7][x2 + 6] = id;dx[0][y2 + 7][x2 + 7] = id;
	dx[0][y2 + 7][x2 + 8] = id;dx[0][y2 + 7][x2 + 9] = id;dx[0][y2 + 7][x2 + 10] = id;dx[0][y2 + 7][x2 + 14] = id;dx[0][y2 + 7][x2 + 15] = id;dx[0][y2 + 7][x2 + 16] = id;dx[0][y2 + 7][x2 + 17] = id;dx[0][y2 + 7][x2 + 18] = id;dx[0][y2 + 7][x2 + 19] = id;
	dx[0][y2 + 7][x2 + 20] = id;dx[0][y2 + 7][x2 + 21] = id;dx[0][y2 + 7][x2 + 22] = id;dx[0][y2 + 7][x2 + 23] = id;dx[0][y2 + 7][x2 + 25] = id;dx[0][y2 + 8][x2 - 26] = id;dx[0][y2 + 8][x2 + 25] = id;dx[0][y2 + 9][x2 - 26] = id;dx[0][y2 + 9][x2 - 25] = id;
	dx[0][y2 + 9][x2 - 24] = id;dx[0][y2 + 9][x2 - 23] = id;dx[0][y2 + 9][x2 - 22] = id;dx[0][y2 + 9][x2 - 21] = id;dx[0][y2 + 9][x2 - 20] = id;dx[0][y2 + 9][x2 - 19] = id;dx[0][y2 + 9][x2 - 18] = id;dx[0][y2 + 9][x2 - 17] = id;dx[0][y2 + 9][x2 - 16] = id;
	dx[0][y2 + 9][x2 - 15] = id;dx[0][y2 + 9][x2 - 14] = id;dx[0][y2 + 9][x2 - 13] = id;dx[0][y2 + 9][x2 - 12] = id;dx[0][y2 + 9][x2 - 11] = id;dx[0][y2 + 9][x2 - 10] = id;dx[0][y2 + 9][x2 - 9] = id;dx[0][y2 + 9][x2 - 8] = id;dx[0][y2 + 9][x2 - 7] = id;
	dx[0][y2 + 9][x2 - 6] = id;dx[0][y2 + 9][x2 - 5] = id;dx[0][y2 + 9][x2 - 4] = id;dx[0][y2 + 9][x2 - 3] = id;dx[0][y2 + 9][x2 - 2] = id;dx[0][y2 + 9][x2 - 1] = id;dx[0][y2 + 9][x2 + 0] = id;dx[0][y2 + 9][x2 + 1] = id;dx[0][y2 + 9][x2 + 2] = id;
	dx[0][y2 + 9][x2 + 3] = id;dx[0][y2 + 9][x2 + 4] = id;dx[0][y2 + 9][x2 + 5] = id;dx[0][y2 + 9][x2 + 6] = id;dx[0][y2 + 9][x2 + 7] = id;dx[0][y2 + 9][x2 + 8] = id;dx[0][y2 + 9][x2 + 9] = id;dx[0][y2 + 9][x2 + 10] = id;dx[0][y2 + 9][x2 + 11] = id;
	dx[0][y2 + 9][x2 + 12] = id;dx[0][y2 + 9][x2 + 13] = id;dx[0][y2 + 9][x2 + 14] = id;dx[0][y2 + 9][x2 + 15] = id;dx[0][y2 + 9][x2 + 16] = id;dx[0][y2 + 9][x2 + 17] = id;dx[0][y2 + 9][x2 + 18] = id;dx[0][y2 + 9][x2 + 19] = id;dx[0][y2 + 9][x2 + 20] = id;
	dx[0][y2 + 9][x2 + 21] = id;dx[0][y2 + 9][x2 + 22] = id;dx[0][y2 + 9][x2 + 23] = id;dx[0][y2 + 9][x2 + 24] = id;dx[0][y2 + 9][x2 + 25] = id;
}

void hurtchair(int x2, int y2)
{
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	int id = 15;
	dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 1][x2 - 1] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 1] = id;dx[0][y2 + 2][x2 - 2] = id;dx[0][y2 + 2][x2 - 1] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 1] = id;dx[0][y2 + 2][x2 + 2] = id;
	dx[0][y2 + 3][x2 - 3] = id;dx[0][y2 + 3][x2 - 2] = id;dx[0][y2 + 3][x2 - 1] = id;dx[0][y2 + 3][x2 + 0] = id;dx[0][y2 + 3][x2 + 1] = id;dx[0][y2 + 3][x2 + 2] = id;dx[0][y2 + 3][x2 + 3] = id;dx[0][y2 + 4][x2 - 4] = id;dx[0][y2 + 4][x2 + 4] = id;
	dx[0][y2 + 5][x2 - 5] = id;dx[0][y2 + 5][x2 + 5] = id;dx[0][y2 + 6][x2 - 6] = id;dx[0][y2 + 6][x2 - 5] = id;dx[0][y2 + 6][x2 - 4] = id;dx[0][y2 + 6][x2 - 3] = id;dx[0][y2 + 6][x2 - 2] = id;dx[0][y2 + 6][x2 - 1] = id;dx[0][y2 + 6][x2 + 0] = id;
	dx[0][y2 + 6][x2 + 1] = id;dx[0][y2 + 6][x2 + 2] = id;dx[0][y2 + 6][x2 + 3] = id;dx[0][y2 + 6][x2 + 4] = id;dx[0][y2 + 6][x2 + 5] = id;dx[0][y2 + 6][x2 + 6] = id;dx[0][y2 + 7][x2 - 6] = id;dx[0][y2 + 7][x2 - 5] = id;dx[0][y2 + 7][x2 - 4] = id;
	dx[0][y2 + 7][x2 - 3] = id;dx[0][y2 + 7][x2 - 2] = id;dx[0][y2 + 7][x2 - 1] = id;dx[0][y2 + 7][x2 + 0] = id;dx[0][y2 + 7][x2 + 1] = id;dx[0][y2 + 7][x2 + 2] = id;dx[0][y2 + 7][x2 + 3] = id;dx[0][y2 + 7][x2 + 4] = id;dx[0][y2 + 7][x2 + 5] = id;
	dx[0][y2 + 7][x2 + 6] = id;dx[0][y2 + 8][x2 - 6] = id;dx[0][y2 + 8][x2 - 5] = id;dx[0][y2 + 8][x2 + 5] = id;dx[0][y2 + 8][x2 + 6] = id;dx[0][y2 + 9][x2 - 6] = id;dx[0][y2 + 9][x2 - 5] = id;dx[0][y2 + 9][x2 + 5] = id;dx[0][y2 + 9][x2 + 6] = id;
	dx[0][y2 + 10][x2 - 6] = id;dx[0][y2 + 10][x2 - 5] = id;dx[0][y2 + 10][x2 - 4] = id;dx[0][y2 + 10][x2 - 3] = id;dx[0][y2 + 10][x2 - 2] = id;dx[0][y2 + 10][x2 - 1] = id;dx[0][y2 + 10][x2 + 0] = id;dx[0][y2 + 10][x2 + 1] = id;dx[0][y2 + 10][x2 + 2] = id;
	dx[0][y2 + 10][x2 + 3] = id;dx[0][y2 + 10][x2 + 4] = id;dx[0][y2 + 10][x2 + 5] = id;dx[0][y2 + 10][x2 + 6] = id;dx[0][y2 + 11][x2 - 6] = id;dx[0][y2 + 11][x2 - 5] = id;dx[0][y2 + 11][x2 + 5] = id;dx[0][y2 + 11][x2 + 6] = id;dx[0][y2 + 12][x2 - 6] = id;
	dx[0][y2 + 12][x2 - 5] = id;dx[0][y2 + 12][x2 + 5] = id;dx[0][y2 + 12][x2 + 6] = id;
}

void celldoor(int x2, int y2)
{
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	int id = 15;

	dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;
	dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 1][x2 - 8] = id;dx[0][y2 + 1][x2 - 7] = id;dx[0][y2 + 1][x2 - 6] = id;dx[0][y2 + 1][x2 - 5] = id;dx[0][y2 + 1][x2 + 5] = id;dx[0][y2 + 1][x2 + 6] = id;dx[0][y2 + 1][x2 + 7] = id;
	dx[0][y2 + 1][x2 + 8] = id;dx[0][y2 + 2][x2 - 10] = id;dx[0][y2 + 2][x2 - 9] = id;dx[0][y2 + 2][x2 - 8] = id;dx[0][y2 + 2][x2 - 5] = id;dx[0][y2 + 2][x2 + 5] = id;dx[0][y2 + 2][x2 + 8] = id;dx[0][y2 + 2][x2 + 9] = id;dx[0][y2 + 2][x2 + 10] = id;
	dx[0][y2 + 3][x2 - 12] = id;dx[0][y2 + 3][x2 - 11] = id;dx[0][y2 + 3][x2 - 10] = id;dx[0][y2 + 3][x2 - 5] = id;dx[0][y2 + 3][x2 + 5] = id;dx[0][y2 + 3][x2 + 11] = id;dx[0][y2 + 3][x2 + 12] = id;dx[0][y2 + 3][x2 + 13] = id;dx[0][y2 + 4][x2 - 14] = id;
	dx[0][y2 + 4][x2 - 13] = id;dx[0][y2 + 4][x2 - 12] = id;dx[0][y2 + 4][x2 - 5] = id;dx[0][y2 + 4][x2 + 5] = id;dx[0][y2 + 4][x2 + 13] = id;dx[0][y2 + 4][x2 + 14] = id;dx[0][y2 + 4][x2 + 15] = id;dx[0][y2 + 5][x2 - 16] = id;dx[0][y2 + 5][x2 - 15] = id;
	dx[0][y2 + 5][x2 - 14] = id;dx[0][y2 + 5][x2 - 13] = id;dx[0][y2 + 5][x2 - 12] = id;dx[0][y2 + 5][x2 - 11] = id;dx[0][y2 + 5][x2 - 10] = id;dx[0][y2 + 5][x2 - 9] = id;dx[0][y2 + 5][x2 - 8] = id;dx[0][y2 + 5][x2 - 7] = id;dx[0][y2 + 5][x2 - 6] = id;
	dx[0][y2 + 5][x2 - 5] = id;dx[0][y2 + 5][x2 - 4] = id;dx[0][y2 + 5][x2 - 3] = id;dx[0][y2 + 5][x2 - 2] = id;dx[0][y2 + 5][x2 - 1] = id;dx[0][y2 + 5][x2 + 0] = id;dx[0][y2 + 5][x2 + 1] = id;dx[0][y2 + 5][x2 + 2] = id;dx[0][y2 + 5][x2 + 3] = id;
	dx[0][y2 + 5][x2 + 4] = id;dx[0][y2 + 5][x2 + 5] = id;dx[0][y2 + 5][x2 + 6] = id;dx[0][y2 + 5][x2 + 7] = id;dx[0][y2 + 5][x2 + 8] = id;dx[0][y2 + 5][x2 + 9] = id;dx[0][y2 + 5][x2 + 10] = id;dx[0][y2 + 5][x2 + 11] = id;dx[0][y2 + 5][x2 + 12] = id;
	dx[0][y2 + 5][x2 + 13] = id;dx[0][y2 + 5][x2 + 14] = id;dx[0][y2 + 5][x2 + 15] = id;dx[0][y2 + 5][x2 + 16] = id;dx[0][y2 + 6][x2 - 17] = id;dx[0][y2 + 6][x2 - 16] = id;dx[0][y2 + 6][x2 - 15] = id;dx[0][y2 + 6][x2 - 13] = id;dx[0][y2 + 6][x2 - 5] = id;
	dx[0][y2 + 6][x2 + 5] = id;dx[0][y2 + 6][x2 + 13] = id;dx[0][y2 + 6][x2 + 15] = id;dx[0][y2 + 6][x2 + 16] = id;dx[0][y2 + 6][x2 + 17] = id;dx[0][y2 + 7][x2 - 18] = id;dx[0][y2 + 7][x2 - 17] = id;dx[0][y2 + 7][x2 - 16] = id;dx[0][y2 + 7][x2 - 13] = id;
	dx[0][y2 + 7][x2 - 5] = id;dx[0][y2 + 7][x2 + 5] = id;dx[0][y2 + 7][x2 + 13] = id;dx[0][y2 + 7][x2 + 16] = id;dx[0][y2 + 7][x2 + 17] = id;dx[0][y2 + 7][x2 + 18] = id;dx[0][y2 + 8][x2 - 19] = id;dx[0][y2 + 8][x2 - 18] = id;dx[0][y2 + 8][x2 - 13] = id;
	dx[0][y2 + 8][x2 - 5] = id;dx[0][y2 + 8][x2 + 5] = id;dx[0][y2 + 8][x2 + 13] = id;dx[0][y2 + 8][x2 + 16] = id;dx[0][y2 + 8][x2 + 17] = id;dx[0][y2 + 8][x2 + 18] = id;dx[0][y2 + 8][x2 + 19] = id;dx[0][y2 + 9][x2 - 20] = id;dx[0][y2 + 9][x2 - 19] = id;
	dx[0][y2 + 9][x2 - 18] = id;dx[0][y2 + 9][x2 - 17] = id;dx[0][y2 + 9][x2 - 16] = id;dx[0][y2 + 9][x2 - 15] = id;dx[0][y2 + 9][x2 - 14] = id;dx[0][y2 + 9][x2 - 13] = id;dx[0][y2 + 9][x2 - 12] = id;dx[0][y2 + 9][x2 - 11] = id;dx[0][y2 + 9][x2 - 10] = id;
	dx[0][y2 + 9][x2 - 9] = id;dx[0][y2 + 9][x2 - 8] = id;dx[0][y2 + 9][x2 - 7] = id;dx[0][y2 + 9][x2 - 6] = id;dx[0][y2 + 9][x2 - 5] = id;dx[0][y2 + 9][x2 - 4] = id;dx[0][y2 + 9][x2 - 3] = id;dx[0][y2 + 9][x2 - 2] = id;dx[0][y2 + 9][x2 - 1] = id;
	dx[0][y2 + 9][x2 + 0] = id;dx[0][y2 + 9][x2 + 1] = id;dx[0][y2 + 9][x2 + 2] = id;dx[0][y2 + 9][x2 + 3] = id;dx[0][y2 + 9][x2 + 4] = id;dx[0][y2 + 9][x2 + 5] = id;dx[0][y2 + 9][x2 + 6] = id;dx[0][y2 + 9][x2 + 7] = id;dx[0][y2 + 9][x2 + 8] = id;
	dx[0][y2 + 9][x2 + 9] = id;dx[0][y2 + 9][x2 + 10] = id;dx[0][y2 + 9][x2 + 11] = id;dx[0][y2 + 9][x2 + 12] = id;dx[0][y2 + 9][x2 + 13] = id;dx[0][y2 + 9][x2 + 14] = id;dx[0][y2 + 9][x2 + 15] = id;dx[0][y2 + 9][x2 + 16] = id;dx[0][y2 + 9][x2 + 17] = id;
	dx[0][y2 + 9][x2 + 18] = id;dx[0][y2 + 9][x2 + 19] = id;dx[0][y2 + 9][x2 + 20] = id;dx[0][y2 + 10][x2 - 21] = id;dx[0][y2 + 10][x2 - 20] = id;dx[0][y2 + 10][x2 - 19] = id;dx[0][y2 + 10][x2 - 13] = id;dx[0][y2 + 10][x2 - 5] = id;dx[0][y2 + 10][x2 + 5] = id;
	dx[0][y2 + 10][x2 + 13] = id;dx[0][y2 + 10][x2 + 18] = id;dx[0][y2 + 10][x2 + 19] = id;dx[0][y2 + 10][x2 + 20] = id;dx[0][y2 + 10][x2 + 21] = id;dx[0][y2 + 11][x2 - 22] = id;dx[0][y2 + 11][x2 - 21] = id;dx[0][y2 + 11][x2 - 20] = id;dx[0][y2 + 11][x2 - 13] = id;
	dx[0][y2 + 11][x2 - 5] = id;dx[0][y2 + 11][x2 + 5] = id;dx[0][y2 + 11][x2 + 13] = id;dx[0][y2 + 11][x2 + 19] = id;dx[0][y2 + 11][x2 + 20] = id;dx[0][y2 + 11][x2 + 21] = id;dx[0][y2 + 12][x2 - 22] = id;dx[0][y2 + 12][x2 - 21] = id;dx[0][y2 + 12][x2 - 20] = id;
	dx[0][y2 + 12][x2 - 13] = id;dx[0][y2 + 12][x2 - 5] = id;dx[0][y2 + 12][x2 + 5] = id;dx[0][y2 + 12][x2 + 13] = id;dx[0][y2 + 12][x2 + 19] = id;dx[0][y2 + 12][x2 + 20] = id;dx[0][y2 + 12][x2 + 21] = id;dx[0][y2 + 13][x2 - 22] = id;dx[0][y2 + 13][x2 - 21] = id;
	dx[0][y2 + 13][x2 - 20] = id;dx[0][y2 + 13][x2 - 19] = id;dx[0][y2 + 13][x2 - 18] = id;dx[0][y2 + 13][x2 - 17] = id;dx[0][y2 + 13][x2 - 16] = id;dx[0][y2 + 13][x2 - 15] = id;dx[0][y2 + 13][x2 - 14] = id;dx[0][y2 + 13][x2 - 13] = id;dx[0][y2 + 13][x2 - 12] = id;
	dx[0][y2 + 13][x2 - 11] = id;dx[0][y2 + 13][x2 - 10] = id;dx[0][y2 + 13][x2 - 9] = id;dx[0][y2 + 13][x2 - 8] = id;dx[0][y2 + 13][x2 - 7] = id;dx[0][y2 + 13][x2 - 6] = id;dx[0][y2 + 13][x2 - 5] = id;dx[0][y2 + 13][x2 - 4] = id;dx[0][y2 + 13][x2 - 3] = id;
	dx[0][y2 + 13][x2 - 2] = id;dx[0][y2 + 13][x2 - 1] = id;dx[0][y2 + 13][x2 + 0] = id;dx[0][y2 + 13][x2 + 1] = id;dx[0][y2 + 13][x2 + 2] = id;dx[0][y2 + 13][x2 + 3] = id;dx[0][y2 + 13][x2 + 4] = id;dx[0][y2 + 13][x2 + 5] = id;dx[0][y2 + 13][x2 + 6] = id;
	dx[0][y2 + 13][x2 + 7] = id;dx[0][y2 + 13][x2 + 8] = id;dx[0][y2 + 13][x2 + 9] = id;dx[0][y2 + 13][x2 + 10] = id;dx[0][y2 + 13][x2 + 11] = id;dx[0][y2 + 13][x2 + 12] = id;dx[0][y2 + 13][x2 + 13] = id;dx[0][y2 + 13][x2 + 14] = id;dx[0][y2 + 13][x2 + 15] = id;
	dx[0][y2 + 13][x2 + 16] = id;dx[0][y2 + 13][x2 + 17] = id;dx[0][y2 + 13][x2 + 18] = id;dx[0][y2 + 13][x2 + 19] = id;dx[0][y2 + 13][x2 + 20] = id;dx[0][y2 + 13][x2 + 21] = id;dx[0][y2 + 14][x2 - 22] = id;dx[0][y2 + 14][x2 - 21] = id;dx[0][y2 + 14][x2 - 13] = id;
	dx[0][y2 + 14][x2 - 5] = id;dx[0][y2 + 14][x2 + 5] = id;dx[0][y2 + 14][x2 + 13] = id;dx[0][y2 + 14][x2 + 20] = id;dx[0][y2 + 14][x2 + 21] = id;dx[0][y2 + 15][x2 - 22] = id;dx[0][y2 + 15][x2 - 21] = id;dx[0][y2 + 15][x2 - 13] = id;dx[0][y2 + 15][x2 - 5] = id;
	dx[0][y2 + 15][x2 + 5] = id;dx[0][y2 + 15][x2 + 13] = id;dx[0][y2 + 15][x2 + 20] = id;dx[0][y2 + 15][x2 + 21] = id;dx[0][y2 + 16][x2 - 22] = id;dx[0][y2 + 16][x2 - 21] = id;dx[0][y2 + 16][x2 - 13] = id;dx[0][y2 + 16][x2 - 5] = id;dx[0][y2 + 16][x2 + 5] = id;
	dx[0][y2 + 16][x2 + 13] = id;dx[0][y2 + 16][x2 + 20] = id;dx[0][y2 + 16][x2 + 21] = id;dx[0][y2 + 17][x2 - 22] = id;dx[0][y2 + 17][x2 - 21] = id;dx[0][y2 + 17][x2 - 13] = id;dx[0][y2 + 17][x2 - 5] = id;dx[0][y2 + 17][x2 + 5] = id;dx[0][y2 + 17][x2 + 13] = id;
	dx[0][y2 + 17][x2 + 20] = id;dx[0][y2 + 17][x2 + 21] = id;dx[0][y2 + 18][x2 - 22] = id;dx[0][y2 + 18][x2 - 21] = id;dx[0][y2 + 18][x2 - 20] = id;dx[0][y2 + 18][x2 - 19] = id;dx[0][y2 + 18][x2 - 18] = id;dx[0][y2 + 18][x2 - 17] = id;dx[0][y2 + 18][x2 - 16] = id;
	dx[0][y2 + 18][x2 - 15] = id;dx[0][y2 + 18][x2 - 14] = id;dx[0][y2 + 18][x2 - 13] = id;dx[0][y2 + 18][x2 - 12] = id;dx[0][y2 + 18][x2 - 11] = id;dx[0][y2 + 18][x2 - 10] = id;dx[0][y2 + 18][x2 - 9] = id;dx[0][y2 + 18][x2 - 8] = id;dx[0][y2 + 18][x2 - 7] = id;
	dx[0][y2 + 18][x2 - 6] = id;dx[0][y2 + 18][x2 - 5] = id;dx[0][y2 + 18][x2 - 4] = id;dx[0][y2 + 18][x2 - 3] = id;dx[0][y2 + 18][x2 - 2] = id;dx[0][y2 + 18][x2 - 1] = id;dx[0][y2 + 18][x2 + 0] = id;dx[0][y2 + 18][x2 + 1] = id;dx[0][y2 + 18][x2 + 2] = id;
	dx[0][y2 + 18][x2 + 3] = id;dx[0][y2 + 18][x2 + 4] = id;dx[0][y2 + 18][x2 + 5] = id;dx[0][y2 + 18][x2 + 6] = id;dx[0][y2 + 18][x2 + 7] = id;dx[0][y2 + 18][x2 + 8] = id;dx[0][y2 + 18][x2 + 9] = id;dx[0][y2 + 18][x2 + 10] = id;dx[0][y2 + 18][x2 + 11] = id;
	dx[0][y2 + 18][x2 + 12] = id;dx[0][y2 + 18][x2 + 13] = id;dx[0][y2 + 18][x2 + 14] = id;dx[0][y2 + 18][x2 + 15] = id;dx[0][y2 + 18][x2 + 16] = id;dx[0][y2 + 18][x2 + 17] = id;dx[0][y2 + 18][x2 + 18] = id;dx[0][y2 + 18][x2 + 19] = id;dx[0][y2 + 18][x2 + 20] = id;
	dx[0][y2 + 18][x2 + 21] = id;dx[0][y2 + 19][x2 - 22] = id;dx[0][y2 + 19][x2 - 21] = id;dx[0][y2 + 19][x2 - 13] = id;dx[0][y2 + 19][x2 - 5] = id;dx[0][y2 + 19][x2 + 5] = id;dx[0][y2 + 19][x2 + 13] = id;dx[0][y2 + 19][x2 + 20] = id;dx[0][y2 + 19][x2 + 21] = id;
	dx[0][y2 + 20][x2 - 22] = id;dx[0][y2 + 20][x2 - 21] = id;dx[0][y2 + 20][x2 - 13] = id;dx[0][y2 + 20][x2 - 5] = id;dx[0][y2 + 20][x2 + 5] = id;dx[0][y2 + 20][x2 + 13] = id;dx[0][y2 + 20][x2 + 20] = id;dx[0][y2 + 20][x2 + 21] = id;dx[0][y2 + 21][x2 - 22] = id;
	dx[0][y2 + 21][x2 - 21] = id;dx[0][y2 + 21][x2 - 13] = id;dx[0][y2 + 21][x2 - 5] = id;dx[0][y2 + 21][x2 + 5] = id;dx[0][y2 + 21][x2 + 13] = id;dx[0][y2 + 21][x2 + 20] = id;dx[0][y2 + 21][x2 + 21] = id;dx[0][y2 + 22][x2 - 22] = id;dx[0][y2 + 22][x2 - 21] = id;
	dx[0][y2 + 22][x2 - 13] = id;dx[0][y2 + 22][x2 - 5] = id;dx[0][y2 + 22][x2 + 5] = id;dx[0][y2 + 22][x2 + 13] = id;dx[0][y2 + 22][x2 + 20] = id;dx[0][y2 + 22][x2 + 21] = id;dx[0][y2 + 23][x2 - 22] = id;dx[0][y2 + 23][x2 - 21] = id;dx[0][y2 + 23][x2 - 20] = id;
	dx[0][y2 + 23][x2 - 19] = id;dx[0][y2 + 23][x2 - 18] = id;dx[0][y2 + 23][x2 - 17] = id;dx[0][y2 + 23][x2 - 16] = id;dx[0][y2 + 23][x2 - 15] = id;dx[0][y2 + 23][x2 - 14] = id;dx[0][y2 + 23][x2 - 13] = id;dx[0][y2 + 23][x2 - 12] = id;dx[0][y2 + 23][x2 - 11] = id;
	dx[0][y2 + 23][x2 - 10] = id;dx[0][y2 + 23][x2 - 9] = id;dx[0][y2 + 23][x2 - 8] = id;dx[0][y2 + 23][x2 - 7] = id;dx[0][y2 + 23][x2 - 6] = id;dx[0][y2 + 23][x2 - 5] = id;dx[0][y2 + 23][x2 - 4] = id;dx[0][y2 + 23][x2 - 3] = id;dx[0][y2 + 23][x2 - 2] = id;
	dx[0][y2 + 23][x2 - 1] = id;dx[0][y2 + 23][x2 + 0] = id;dx[0][y2 + 23][x2 + 1] = id;dx[0][y2 + 23][x2 + 2] = id;dx[0][y2 + 23][x2 + 3] = id;dx[0][y2 + 23][x2 + 4] = id;dx[0][y2 + 23][x2 + 5] = id;dx[0][y2 + 23][x2 + 6] = id;dx[0][y2 + 23][x2 + 7] = id;
	dx[0][y2 + 23][x2 + 8] = id;dx[0][y2 + 23][x2 + 9] = id;dx[0][y2 + 23][x2 + 10] = id;dx[0][y2 + 23][x2 + 11] = id;dx[0][y2 + 23][x2 + 12] = id;dx[0][y2 + 23][x2 + 13] = id;dx[0][y2 + 23][x2 + 14] = id;dx[0][y2 + 23][x2 + 15] = id;dx[0][y2 + 23][x2 + 16] = id;
	dx[0][y2 + 23][x2 + 17] = id;dx[0][y2 + 23][x2 + 18] = id;dx[0][y2 + 23][x2 + 19] = id;dx[0][y2 + 23][x2 + 20] = id;dx[0][y2 + 23][x2 + 21] = id;dx[0][y2 + 24][x2 - 22] = id;dx[0][y2 + 24][x2 - 21] = id;dx[0][y2 + 24][x2 - 13] = id;dx[0][y2 + 24][x2 - 5] = id;
	dx[0][y2 + 24][x2 + 5] = id;dx[0][y2 + 24][x2 + 13] = id;dx[0][y2 + 24][x2 + 20] = id;dx[0][y2 + 24][x2 + 21] = id;dx[0][y2 + 25][x2 - 22] = id;dx[0][y2 + 25][x2 - 21] = id;dx[0][y2 + 25][x2 - 13] = id;dx[0][y2 + 25][x2 - 5] = id;dx[0][y2 + 25][x2 + 5] = id;
	dx[0][y2 + 25][x2 + 13] = id;dx[0][y2 + 25][x2 + 20] = id;dx[0][y2 + 25][x2 + 21] = id;dx[0][y2 + 26][x2 - 22] = id;dx[0][y2 + 26][x2 - 21] = id;dx[0][y2 + 26][x2 - 13] = id;dx[0][y2 + 26][x2 - 5] = id;dx[0][y2 + 26][x2 + 5] = id;dx[0][y2 + 26][x2 + 13] = id;
	dx[0][y2 + 26][x2 + 20] = id;dx[0][y2 + 26][x2 + 21] = id;
}

void cross(int x2, int y2)
{
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	int id = 15;
	dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 1][x2 - 2] = id;dx[0][y2 + 1][x2 - 1] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 1] = id;dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 2][x2 - 6] = id;
	dx[0][y2 + 2][x2 - 1] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 1] = id;dx[0][y2 + 2][x2 + 6] = id;dx[0][y2 + 3][x2 - 9] = id;dx[0][y2 + 3][x2 - 1] = id;dx[0][y2 + 3][x2 + 0] = id;dx[0][y2 + 3][x2 + 1] = id;dx[0][y2 + 3][x2 + 10] = id;
	dx[0][y2 + 4][x2 - 14] = id;dx[0][y2 + 4][x2 - 13] = id;dx[0][y2 + 4][x2 - 12] = id;dx[0][y2 + 4][x2 - 11] = id;dx[0][y2 + 4][x2 - 10] = id;dx[0][y2 + 4][x2 - 9] = id;dx[0][y2 + 4][x2 - 8] = id;dx[0][y2 + 4][x2 - 7] = id;dx[0][y2 + 4][x2 - 6] = id;
	dx[0][y2 + 4][x2 - 5] = id;dx[0][y2 + 4][x2 - 4] = id;dx[0][y2 + 4][x2 - 3] = id;dx[0][y2 + 4][x2 - 2] = id;dx[0][y2 + 4][x2 - 1] = id;dx[0][y2 + 4][x2 + 0] = id;dx[0][y2 + 4][x2 + 1] = id;dx[0][y2 + 4][x2 + 2] = id;dx[0][y2 + 4][x2 + 3] = id;
	dx[0][y2 + 4][x2 + 4] = id;dx[0][y2 + 4][x2 + 5] = id;dx[0][y2 + 4][x2 + 6] = id;dx[0][y2 + 4][x2 + 7] = id;dx[0][y2 + 4][x2 + 8] = id;dx[0][y2 + 4][x2 + 9] = id;dx[0][y2 + 4][x2 + 10] = id;dx[0][y2 + 4][x2 + 11] = id;dx[0][y2 + 4][x2 + 12] = id;
	dx[0][y2 + 4][x2 + 13] = id;dx[0][y2 + 4][x2 + 14] = id;dx[0][y2 + 5][x2 - 14] = id;dx[0][y2 + 5][x2 - 13] = id;dx[0][y2 + 5][x2 - 12] = id;dx[0][y2 + 5][x2 - 11] = id;dx[0][y2 + 5][x2 - 10] = id;dx[0][y2 + 5][x2 - 9] = id;dx[0][y2 + 5][x2 - 8] = id;
	dx[0][y2 + 5][x2 - 7] = id;dx[0][y2 + 5][x2 - 6] = id;dx[0][y2 + 5][x2 - 5] = id;dx[0][y2 + 5][x2 - 4] = id;dx[0][y2 + 5][x2 - 3] = id;dx[0][y2 + 5][x2 - 2] = id;dx[0][y2 + 5][x2 - 1] = id;dx[0][y2 + 5][x2 + 0] = id;dx[0][y2 + 5][x2 + 1] = id;
	dx[0][y2 + 5][x2 + 2] = id;dx[0][y2 + 5][x2 + 3] = id;dx[0][y2 + 5][x2 + 4] = id;dx[0][y2 + 5][x2 + 5] = id;dx[0][y2 + 5][x2 + 6] = id;dx[0][y2 + 5][x2 + 7] = id;dx[0][y2 + 5][x2 + 8] = id;dx[0][y2 + 5][x2 + 9] = id;dx[0][y2 + 5][x2 + 10] = id;
	dx[0][y2 + 5][x2 + 11] = id;dx[0][y2 + 5][x2 + 12] = id;dx[0][y2 + 5][x2 + 13] = id;dx[0][y2 + 5][x2 + 14] = id;dx[0][y2 + 6][x2 - 12] = id;dx[0][y2 + 6][x2 - 1] = id;dx[0][y2 + 6][x2 + 0] = id;dx[0][y2 + 6][x2 + 1] = id;dx[0][y2 + 6][x2 + 12] = id;
	dx[0][y2 + 7][x2 - 1] = id;dx[0][y2 + 7][x2 + 0] = id;dx[0][y2 + 7][x2 + 1] = id;dx[0][y2 + 8][x2 - 1] = id;dx[0][y2 + 8][x2 + 0] = id;dx[0][y2 + 8][x2 + 1] = id;dx[0][y2 + 9][x2 - 1] = id;dx[0][y2 + 9][x2 + 0] = id;dx[0][y2 + 9][x2 + 1] = id;
	dx[0][y2 + 10][x2 - 1] = id;dx[0][y2 + 10][x2 + 0] = id;dx[0][y2 + 10][x2 + 1] = id;dx[0][y2 + 11][x2 - 1] = 2;dx[0][y2 + 11][x2 + 0] = 2;dx[0][y2 + 11][x2 + 1] = 2;dx[0][y2 + 12][x2 - 1] = id;dx[0][y2 + 12][x2 + 0] = id;dx[0][y2 + 12][x2 + 1] = id;
	dx[0][y2 + 13][x2 - 1] = id;dx[0][y2 + 13][x2 + 0] = id;dx[0][y2 + 13][x2 + 1] = id;dx[0][y2 + 14][x2 - 1] = id;dx[0][y2 + 14][x2 + 0] = id;dx[0][y2 + 14][x2 + 1] = id;dx[0][y2 + 15][x2 - 1] = id;dx[0][y2 + 15][x2 + 0] = id;dx[0][y2 + 15][x2 + 1] = id;
}

void headdown(int x2, int y2)//断头台
{
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	int id = 15;
	dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 1][x2 - 11] = id;dx[0][y2 + 1][x2 - 10] = id;dx[0][y2 + 1][x2 - 9] = id;dx[0][y2 + 1][x2 - 8] = id;dx[0][y2 + 1][x2 - 7] = id;dx[0][y2 + 1][x2 - 6] = id;dx[0][y2 + 1][x2 - 5] = id;dx[0][y2 + 1][x2 - 4] = id;
	dx[0][y2 + 1][x2 - 3] = id;dx[0][y2 + 1][x2 - 2] = id;dx[0][y2 + 1][x2 - 1] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 1] = id;dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 1][x2 + 3] = id;dx[0][y2 + 1][x2 + 4] = id;dx[0][y2 + 1][x2 + 5] = id;
	dx[0][y2 + 1][x2 + 6] = id;dx[0][y2 + 1][x2 + 7] = id;dx[0][y2 + 1][x2 + 8] = id;dx[0][y2 + 1][x2 + 9] = id;dx[0][y2 + 1][x2 + 10] = id;dx[0][y2 + 1][x2 + 11] = id;dx[0][y2 + 1][x2 + 12] = id;dx[0][y2 + 2][x2 - 11] = id;dx[0][y2 + 2][x2 - 9] = id;
	dx[0][y2 + 2][x2 - 8] = id;dx[0][y2 + 2][x2 - 7] = id;dx[0][y2 + 2][x2 - 6] = id;dx[0][y2 + 2][x2 - 5] = id;dx[0][y2 + 2][x2 - 4] = id;dx[0][y2 + 2][x2 - 3] = id;dx[0][y2 + 2][x2 - 2] = id;dx[0][y2 + 2][x2 - 1] = id;dx[0][y2 + 2][x2 + 0] = id;
	dx[0][y2 + 2][x2 + 1] = id;dx[0][y2 + 2][x2 + 2] = id;dx[0][y2 + 2][x2 + 3] = id;dx[0][y2 + 2][x2 + 4] = id;dx[0][y2 + 2][x2 + 5] = id;dx[0][y2 + 2][x2 + 6] = id;dx[0][y2 + 2][x2 + 7] = id;dx[0][y2 + 2][x2 + 8] = id;dx[0][y2 + 2][x2 + 9] = id;
	dx[0][y2 + 2][x2 + 10] = id;dx[0][y2 + 2][x2 + 12] = id;dx[0][y2 + 3][x2 - 11] = id;dx[0][y2 + 3][x2 - 9] = id;dx[0][y2 + 3][x2 - 8] = id;dx[0][y2 + 3][x2 - 7] = id;dx[0][y2 + 3][x2 - 6] = id;dx[0][y2 + 3][x2 - 5] = id;dx[0][y2 + 3][x2 - 4] = id;
	dx[0][y2 + 3][x2 - 3] = id;dx[0][y2 + 3][x2 - 2] = id;dx[0][y2 + 3][x2 - 1] = id;dx[0][y2 + 3][x2 + 0] = id;dx[0][y2 + 3][x2 + 1] = id;dx[0][y2 + 3][x2 + 2] = id;dx[0][y2 + 3][x2 + 3] = id;dx[0][y2 + 3][x2 + 4] = id;dx[0][y2 + 3][x2 + 5] = id;
	dx[0][y2 + 3][x2 + 6] = id;dx[0][y2 + 3][x2 + 7] = id;dx[0][y2 + 3][x2 + 8] = id;dx[0][y2 + 3][x2 + 9] = id;dx[0][y2 + 3][x2 + 10] = id;dx[0][y2 + 3][x2 + 12] = id;dx[0][y2 + 4][x2 - 11] = id;dx[0][y2 + 4][x2 - 9] = id;dx[0][y2 + 4][x2 - 8] = id;
	dx[0][y2 + 4][x2 - 7] = id;dx[0][y2 + 4][x2 - 6] = id;dx[0][y2 + 4][x2 - 5] = id;dx[0][y2 + 4][x2 - 4] = id;dx[0][y2 + 4][x2 - 3] = id;dx[0][y2 + 4][x2 - 2] = id;dx[0][y2 + 4][x2 - 1] = id;dx[0][y2 + 4][x2 + 0] = id;dx[0][y2 + 4][x2 + 1] = id;
	dx[0][y2 + 4][x2 + 2] = id;dx[0][y2 + 4][x2 + 3] = id;dx[0][y2 + 4][x2 + 4] = id;dx[0][y2 + 4][x2 + 5] = id;dx[0][y2 + 4][x2 + 6] = id;dx[0][y2 + 4][x2 + 7] = id;dx[0][y2 + 4][x2 + 8] = id;dx[0][y2 + 4][x2 + 9] = id;dx[0][y2 + 4][x2 + 10] = id;
	dx[0][y2 + 4][x2 + 12] = id;dx[0][y2 + 5][x2 - 11] = id;dx[0][y2 + 5][x2 - 9] = id;dx[0][y2 + 5][x2 + 7] = id;dx[0][y2 + 5][x2 + 8] = id;dx[0][y2 + 5][x2 + 12] = id;dx[0][y2 + 6][x2 - 11] = id;dx[0][y2 + 6][x2 - 9] = id;dx[0][y2 + 6][x2 + 3] = id;
	dx[0][y2 + 6][x2 + 4] = id;dx[0][y2 + 6][x2 + 12] = id;dx[0][y2 + 7][x2 - 11] = id;dx[0][y2 + 7][x2 - 9] = id;dx[0][y2 + 7][x2 + 0] = id;dx[0][y2 + 7][x2 + 1] = id;dx[0][y2 + 7][x2 + 12] = id;dx[0][y2 + 8][x2 - 11] = id;dx[0][y2 + 8][x2 - 9] = id;
	dx[0][y2 + 8][x2 - 3] = id;dx[0][y2 + 8][x2 - 2] = id;dx[0][y2 + 8][x2 + 12] = id;dx[0][y2 + 9][x2 - 11] = id;dx[0][y2 + 9][x2 - 9] = id;dx[0][y2 + 9][x2 - 6] = id;dx[0][y2 + 9][x2 - 5] = id;dx[0][y2 + 9][x2 + 12] = id;dx[0][y2 + 10][x2 - 11] = id;
	dx[0][y2 + 10][x2 - 9] = id;dx[0][y2 + 10][x2 - 8] = id;dx[0][y2 + 10][x2 + 12] = id;dx[0][y2 + 11][x2 - 11] = id;dx[0][y2 + 11][x2 + 12] = id;dx[0][y2 + 12][x2 - 11] = id;dx[0][y2 + 12][x2 + 12] = id;dx[0][y2 + 13][x2 - 11] = id;dx[0][y2 + 13][x2 + 12] = id;
	dx[0][y2 + 14][x2 - 11] = id;dx[0][y2 + 14][x2 + 12] = id;dx[0][y2 + 15][x2 - 11] = id;dx[0][y2 + 15][x2 + 12] = id;dx[0][y2 + 16][x2 - 11] = id;dx[0][y2 + 16][x2 + 12] = id;dx[0][y2 + 17][x2 - 11] = id;dx[0][y2 + 17][x2 + 12] = id;dx[0][y2 + 18][x2 - 11] = id;
	dx[0][y2 + 18][x2 + 12] = id;dx[0][y2 + 19][x2 - 11] = id;dx[0][y2 + 19][x2 + 12] = id;dx[0][y2 + 20][x2 - 11] = id;dx[0][y2 + 20][x2 - 10] = id;dx[0][y2 + 20][x2 - 9] = id;dx[0][y2 + 20][x2 - 8] = id;dx[0][y2 + 20][x2 - 7] = id;dx[0][y2 + 20][x2 - 6] = id;
	dx[0][y2 + 20][x2 - 5] = id;dx[0][y2 + 20][x2 - 4] = id;dx[0][y2 + 20][x2 - 3] = id;dx[0][y2 + 20][x2 - 2] = id;dx[0][y2 + 20][x2 - 1] = id;dx[0][y2 + 20][x2 + 0] = id;dx[0][y2 + 20][x2 + 1] = id;dx[0][y2 + 20][x2 + 2] = id;dx[0][y2 + 20][x2 + 3] = id;
	dx[0][y2 + 20][x2 + 4] = id;dx[0][y2 + 20][x2 + 5] = id;dx[0][y2 + 20][x2 + 6] = id;dx[0][y2 + 20][x2 + 7] = id;dx[0][y2 + 20][x2 + 8] = id;dx[0][y2 + 20][x2 + 9] = id;dx[0][y2 + 20][x2 + 10] = id;dx[0][y2 + 20][x2 + 11] = id;dx[0][y2 + 20][x2 + 12] = id;
	dx[0][y2 + 21][x2 - 11] = id;dx[0][y2 + 21][x2 + 12] = id;dx[0][y2 + 22][x2 - 11] = id;dx[0][y2 + 22][x2 - 1] = id;dx[0][y2 + 22][x2 + 0] = id;dx[0][y2 + 22][x2 + 1] = id;dx[0][y2 + 22][x2 + 2] = id;dx[0][y2 + 22][x2 + 12] = id;dx[0][y2 + 23][x2 - 11] = id;
	dx[0][y2 + 23][x2 - 3] = id;dx[0][y2 + 23][x2 - 2] = id;dx[0][y2 + 23][x2 + 3] = id;dx[0][y2 + 23][x2 + 4] = id;dx[0][y2 + 23][x2 + 5] = id;dx[0][y2 + 23][x2 + 6] = id;dx[0][y2 + 23][x2 + 7] = id;dx[0][y2 + 23][x2 + 8] = id;dx[0][y2 + 23][x2 + 9] = id;
	dx[0][y2 + 23][x2 + 10] = id;dx[0][y2 + 23][x2 + 11] = id;dx[0][y2 + 23][x2 + 12] = id;dx[0][y2 + 24][x2 - 11] = id;dx[0][y2 + 24][x2 - 10] = id;dx[0][y2 + 24][x2 - 9] = id;dx[0][y2 + 24][x2 - 8] = id;dx[0][y2 + 24][x2 - 7] = id;dx[0][y2 + 24][x2 - 6] = id;
	dx[0][y2 + 24][x2 - 5] = id;dx[0][y2 + 24][x2 - 4] = id;dx[0][y2 + 24][x2 - 3] = id;dx[0][y2 + 24][x2 - 2] = id;dx[0][y2 + 24][x2 + 3] = id;dx[0][y2 + 24][x2 + 4] = id;dx[0][y2 + 24][x2 + 12] = id;dx[0][y2 + 25][x2 - 11] = id;dx[0][y2 + 25][x2 - 1] = id;
	dx[0][y2 + 25][x2 + 0] = id;dx[0][y2 + 25][x2 + 1] = id;dx[0][y2 + 25][x2 + 2] = id;dx[0][y2 + 25][x2 + 12] = id;dx[0][y2 + 26][x2 - 11] = id;dx[0][y2 + 26][x2 + 12] = id;dx[0][y2 + 27][x2 - 11] = id;dx[0][y2 + 27][x2 - 10] = id;dx[0][y2 + 27][x2 - 9] = id;
	dx[0][y2 + 27][x2 - 8] = id;dx[0][y2 + 27][x2 - 7] = id;dx[0][y2 + 27][x2 - 6] = id;dx[0][y2 + 27][x2 - 5] = id;dx[0][y2 + 27][x2 - 4] = id;dx[0][y2 + 27][x2 - 3] = id;dx[0][y2 + 27][x2 - 2] = id;dx[0][y2 + 27][x2 - 1] = id;dx[0][y2 + 27][x2 + 0] = id;
	dx[0][y2 + 27][x2 + 1] = id;dx[0][y2 + 27][x2 + 2] = id;dx[0][y2 + 27][x2 + 3] = id;dx[0][y2 + 27][x2 + 4] = id;dx[0][y2 + 27][x2 + 5] = id;dx[0][y2 + 27][x2 + 6] = id;dx[0][y2 + 27][x2 + 7] = id;dx[0][y2 + 27][x2 + 8] = id;dx[0][y2 + 27][x2 + 9] = id;
	dx[0][y2 + 27][x2 + 10] = id;dx[0][y2 + 27][x2 + 11] = id;dx[0][y2 + 27][x2 + 12] = id;
}

void hangdie(int x2, int y2)
{
	x2 = x2 + 30 + 30;
	y2 = 600 - y2;
	int id = 15;
	dx[0][y2 + 0][x2 - 14] = id;dx[0][y2 + 0][x2 - 13] = id;dx[0][y2 + 0][x2 - 12] = id;dx[0][y2 + 0][x2 - 11] = id;dx[0][y2 + 0][x2 - 10] = id;dx[0][y2 + 0][x2 - 9] = id;dx[0][y2 + 0][x2 - 8] = id;dx[0][y2 + 0][x2 - 7] = id;dx[0][y2 + 0][x2 - 6] = id;
	dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;
	dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;dx[0][y2 + 0][x2 + 7] = id;dx[0][y2 + 0][x2 + 8] = id;dx[0][y2 + 0][x2 + 9] = id;dx[0][y2 + 0][x2 + 10] = id;dx[0][y2 + 0][x2 + 11] = id;dx[0][y2 + 0][x2 + 12] = id;
	dx[0][y2 + 0][x2 + 13] = id;dx[0][y2 + 0][x2 + 14] = id;dx[0][y2 + 0][x2 + 15] = id;dx[0][y2 + 0][x2 + 16] = id;dx[0][y2 + 0][x2 + 17] = id;dx[0][y2 + 1][x2 - 14] = id;dx[0][y2 + 1][x2 - 13] = id;dx[0][y2 + 1][x2 - 12] = id;dx[0][y2 + 1][x2 - 11] = id;
	dx[0][y2 + 1][x2 - 10] = id;dx[0][y2 + 1][x2 - 9] = id;dx[0][y2 + 1][x2 - 8] = id;dx[0][y2 + 1][x2 - 7] = id;dx[0][y2 + 1][x2 - 6] = id;dx[0][y2 + 1][x2 - 5] = id;dx[0][y2 + 1][x2 - 4] = id;dx[0][y2 + 1][x2 - 3] = id;dx[0][y2 + 1][x2 - 2] = id;
	dx[0][y2 + 1][x2 - 1] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 1] = id;dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 1][x2 + 3] = id;dx[0][y2 + 1][x2 + 4] = id;dx[0][y2 + 1][x2 + 5] = id;dx[0][y2 + 1][x2 + 6] = id;dx[0][y2 + 1][x2 + 7] = id;
	dx[0][y2 + 1][x2 + 8] = id;dx[0][y2 + 1][x2 + 9] = id;dx[0][y2 + 1][x2 + 10] = id;dx[0][y2 + 1][x2 + 11] = id;dx[0][y2 + 1][x2 + 12] = id;dx[0][y2 + 1][x2 + 13] = id;dx[0][y2 + 1][x2 + 14] = id;dx[0][y2 + 1][x2 + 15] = id;dx[0][y2 + 1][x2 + 16] = id;
	dx[0][y2 + 1][x2 + 17] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 7] = id;dx[0][y2 + 2][x2 + 8] = id;dx[0][y2 + 2][x2 + 9] = id;dx[0][y2 + 2][x2 + 15] = id;dx[0][y2 + 2][x2 + 16] = id;dx[0][y2 + 2][x2 + 17] = id;dx[0][y2 + 3][x2 + 0] = id;
	dx[0][y2 + 3][x2 + 8] = id;dx[0][y2 + 3][x2 + 9] = id;dx[0][y2 + 3][x2 + 10] = id;dx[0][y2 + 3][x2 + 15] = id;dx[0][y2 + 3][x2 + 16] = id;dx[0][y2 + 3][x2 + 17] = id;dx[0][y2 + 4][x2 + 0] = id;dx[0][y2 + 4][x2 + 10] = id;dx[0][y2 + 4][x2 + 11] = id;
	dx[0][y2 + 4][x2 + 12] = id;dx[0][y2 + 4][x2 + 15] = id;dx[0][y2 + 4][x2 + 16] = id;dx[0][y2 + 4][x2 + 17] = id;dx[0][y2 + 5][x2 + 0] = id;dx[0][y2 + 5][x2 + 11] = id;dx[0][y2 + 5][x2 + 12] = id;dx[0][y2 + 5][x2 + 13] = id;dx[0][y2 + 5][x2 + 15] = id;
	dx[0][y2 + 5][x2 + 16] = id;dx[0][y2 + 5][x2 + 17] = id;dx[0][y2 + 6][x2 - 2] = id;dx[0][y2 + 6][x2 - 1] = id;dx[0][y2 + 6][x2 + 0] = id;dx[0][y2 + 6][x2 + 1] = id;dx[0][y2 + 6][x2 + 2] = id;dx[0][y2 + 6][x2 + 12] = id;dx[0][y2 + 6][x2 + 13] = id;
	dx[0][y2 + 6][x2 + 14] = id;dx[0][y2 + 6][x2 + 15] = id;dx[0][y2 + 6][x2 + 16] = id;dx[0][y2 + 6][x2 + 17] = id;dx[0][y2 + 7][x2 - 3] = id;dx[0][y2 + 7][x2 - 2] = id;dx[0][y2 + 7][x2 + 2] = id;dx[0][y2 + 7][x2 + 3] = id;dx[0][y2 + 7][x2 + 14] = id;
	dx[0][y2 + 7][x2 + 15] = id;dx[0][y2 + 7][x2 + 16] = id;dx[0][y2 + 7][x2 + 17] = id;dx[0][y2 + 8][x2 - 3] = id;dx[0][y2 + 8][x2 + 3] = id;dx[0][y2 + 8][x2 + 15] = id;dx[0][y2 + 8][x2 + 16] = id;dx[0][y2 + 8][x2 + 17] = id;dx[0][y2 + 9][x2 - 3] = id;
	dx[0][y2 + 9][x2 - 2] = id;dx[0][y2 + 9][x2 + 2] = id;dx[0][y2 + 9][x2 + 3] = id;dx[0][y2 + 9][x2 + 15] = id;dx[0][y2 + 9][x2 + 16] = id;dx[0][y2 + 9][x2 + 17] = id;dx[0][y2 + 10][x2 - 2] = id;dx[0][y2 + 10][x2 - 1] = id;dx[0][y2 + 10][x2 + 0] = id;
	dx[0][y2 + 10][x2 + 1] = id;dx[0][y2 + 10][x2 + 2] = id;dx[0][y2 + 10][x2 + 15] = id;dx[0][y2 + 10][x2 + 16] = id;dx[0][y2 + 10][x2 + 17] = id;dx[0][y2 + 11][x2 + 15] = id;dx[0][y2 + 11][x2 + 16] = id;dx[0][y2 + 11][x2 + 17] = id;dx[0][y2 + 12][x2 + 15] = id;
	dx[0][y2 + 12][x2 + 16] = id;dx[0][y2 + 12][x2 + 17] = id;dx[0][y2 + 13][x2 + 15] = id;dx[0][y2 + 13][x2 + 16] = id;dx[0][y2 + 13][x2 + 17] = id;dx[0][y2 + 14][x2 + 15] = id;dx[0][y2 + 14][x2 + 16] = id;dx[0][y2 + 14][x2 + 17] = id;dx[0][y2 + 15][x2 + 15] = id;
	dx[0][y2 + 15][x2 + 16] = id;dx[0][y2 + 15][x2 + 17] = id;dx[0][y2 + 16][x2 + 15] = id;dx[0][y2 + 16][x2 + 16] = id;dx[0][y2 + 16][x2 + 17] = id;dx[0][y2 + 17][x2 + 15] = id;dx[0][y2 + 17][x2 + 16] = id;dx[0][y2 + 17][x2 + 17] = id;dx[0][y2 + 18][x2 + 15] = id;
	dx[0][y2 + 18][x2 + 16] = id;dx[0][y2 + 18][x2 + 17] = id;dx[0][y2 + 19][x2 + 15] = id;dx[0][y2 + 19][x2 + 16] = id;dx[0][y2 + 19][x2 + 17] = id;dx[0][y2 + 20][x2 + 15] = id;dx[0][y2 + 20][x2 + 16] = id;dx[0][y2 + 20][x2 + 17] = id;
	id = 2;
	dx[0][y2 + 21][x2 - 6] = id;
	dx[0][y2 + 21][x2 - 5] = id;dx[0][y2 + 21][x2 - 4] = id;dx[0][y2 + 21][x2 - 3] = id;dx[0][y2 + 21][x2 - 2] = id;dx[0][y2 + 21][x2 - 1] = id;dx[0][y2 + 21][x2 + 0] = id;dx[0][y2 + 21][x2 + 1] = id;dx[0][y2 + 21][x2 + 2] = id;dx[0][y2 + 21][x2 + 3] = id;
	dx[0][y2 + 21][x2 + 4] = id;dx[0][y2 + 21][x2 + 5] = id;dx[0][y2 + 21][x2 + 6] = id;dx[0][y2 + 22][x2 - 6] = id;dx[0][y2 + 22][x2 - 5] = id;dx[0][y2 + 22][x2 - 4] = id;
	dx[0][y2 + 22][x2 - 3] = id;dx[0][y2 + 22][x2 - 2] = id;dx[0][y2 + 22][x2 - 1] = id;dx[0][y2 + 22][x2 + 0] = id;dx[0][y2 + 22][x2 + 1] = id;dx[0][y2 + 22][x2 + 2] = id;dx[0][y2 + 22][x2 + 3] = id;dx[0][y2 + 22][x2 + 4] = id;dx[0][y2 + 22][x2 + 5] = id;
	dx[0][y2 + 22][x2 + 6] = id;
	
	
	id = 15;
	dx[0][y2 + 21][x2 + 15] = id;dx[0][y2 + 21][x2 + 16] = id;dx[0][y2 + 21][x2 + 17] = id;dx[0][y2 + 22][x2 + 15] = id;dx[0][y2 + 22][x2 + 16] = id;dx[0][y2 + 22][x2 + 17] = id;
	dx[0][y2 + 23][x2 - 4] = id;dx[0][y2 + 23][x2 + 4] = id;dx[0][y2 + 23][x2 + 15] = id;dx[0][y2 + 23][x2 + 16] = id;dx[0][y2 + 23][x2 + 17] = id;
	dx[0][y2 + 24][x2 - 4] = id;dx[0][y2 + 24][x2 + 4] = id;dx[0][y2 + 24][x2 + 15] = id;dx[0][y2 + 24][x2 + 16] = id;dx[0][y2 + 24][x2 + 17] = id;
	id = 3;
	dx[0][y2 + 25][x2 - 19] = id;dx[0][y2 + 25][x2 - 18] = id;dx[0][y2 + 25][x2 - 17] = id;dx[0][y2 + 25][x2 - 16] = id;
	dx[0][y2 + 25][x2 - 15] = id;dx[0][y2 + 25][x2 - 14] = id;dx[0][y2 + 25][x2 - 13] = id;dx[0][y2 + 25][x2 - 12] = id;dx[0][y2 + 25][x2 - 11] = id;dx[0][y2 + 25][x2 - 10] = id;dx[0][y2 + 25][x2 - 9] = id;dx[0][y2 + 25][x2 - 8] = id;dx[0][y2 + 25][x2 - 7] = id;
	dx[0][y2 + 25][x2 - 6] = id;dx[0][y2 + 25][x2 - 5] = id;dx[0][y2 + 25][x2 - 4] = id;dx[0][y2 + 25][x2 - 3] = id;dx[0][y2 + 25][x2 - 2] = id;dx[0][y2 + 25][x2 - 1] = id;dx[0][y2 + 25][x2 + 0] = id;dx[0][y2 + 25][x2 + 1] = id;dx[0][y2 + 25][x2 + 2] = id;
	dx[0][y2 + 25][x2 + 3] = id;dx[0][y2 + 25][x2 + 4] = id;dx[0][y2 + 25][x2 + 5] = id;dx[0][y2 + 25][x2 + 6] = id;dx[0][y2 + 25][x2 + 7] = id;dx[0][y2 + 25][x2 + 8] = id;dx[0][y2 + 25][x2 + 9] = id;dx[0][y2 + 25][x2 + 10] = id;dx[0][y2 + 25][x2 + 11] = id;
	dx[0][y2 + 25][x2 + 12] = id;dx[0][y2 + 25][x2 + 13] = id;dx[0][y2 + 25][x2 + 14] = id;dx[0][y2 + 25][x2 + 15] = id;dx[0][y2 + 25][x2 + 16] = id;dx[0][y2 + 25][x2 + 17] = id;dx[0][y2 + 25][x2 + 18] = id;dx[0][y2 + 25][x2 + 19] = id;dx[0][y2 + 25][x2 + 20] = id;
	dx[0][y2 + 26][x2 - 21] = id;dx[0][y2 + 26][x2 - 20] = id;dx[0][y2 + 26][x2 - 19] = id;dx[0][y2 + 26][x2 - 18] = id;dx[0][y2 + 26][x2 - 17] = id;dx[0][y2 + 26][x2 - 16] = id;dx[0][y2 + 26][x2 - 15] = id;dx[0][y2 + 26][x2 - 14] = id;dx[0][y2 + 26][x2 - 13] = id;
	dx[0][y2 + 26][x2 - 12] = id;dx[0][y2 + 26][x2 - 11] = id;dx[0][y2 + 26][x2 - 10] = id;dx[0][y2 + 26][x2 - 9] = id;dx[0][y2 + 26][x2 - 8] = id;dx[0][y2 + 26][x2 - 7] = id;dx[0][y2 + 26][x2 - 6] = id;dx[0][y2 + 26][x2 - 5] = id;dx[0][y2 + 26][x2 - 4] = id;
	dx[0][y2 + 26][x2 - 3] = id;dx[0][y2 + 26][x2 - 2] = id;dx[0][y2 + 26][x2 - 1] = id;dx[0][y2 + 26][x2 + 0] = id;dx[0][y2 + 26][x2 + 1] = id;dx[0][y2 + 26][x2 + 2] = id;dx[0][y2 + 26][x2 + 3] = id;dx[0][y2 + 26][x2 + 4] = id;dx[0][y2 + 26][x2 + 5] = id;
	dx[0][y2 + 26][x2 + 6] = id;dx[0][y2 + 26][x2 + 7] = id;dx[0][y2 + 26][x2 + 8] = id;dx[0][y2 + 26][x2 + 9] = id;dx[0][y2 + 26][x2 + 10] = id;dx[0][y2 + 26][x2 + 11] = id;dx[0][y2 + 26][x2 + 12] = id;dx[0][y2 + 26][x2 + 13] = id;dx[0][y2 + 26][x2 + 14] = id;
	dx[0][y2 + 26][x2 + 15] = id;dx[0][y2 + 26][x2 + 16] = id;dx[0][y2 + 26][x2 + 17] = id;dx[0][y2 + 26][x2 + 18] = id;dx[0][y2 + 26][x2 + 19] = id;dx[0][y2 + 26][x2 + 20] = id;dx[0][y2 + 26][x2 + 21] = id;dx[0][y2 + 26][x2 + 22] = id;dx[0][y2 + 27][x2 - 23] = id;
	dx[0][y2 + 27][x2 - 22] = id;dx[0][y2 + 27][x2 - 21] = id;dx[0][y2 + 27][x2 - 20] = id;dx[0][y2 + 27][x2 - 19] = id;dx[0][y2 + 27][x2 - 18] = id;dx[0][y2 + 27][x2 - 17] = id;dx[0][y2 + 27][x2 - 16] = id;dx[0][y2 + 27][x2 - 15] = id;dx[0][y2 + 27][x2 - 14] = id;
	dx[0][y2 + 27][x2 - 13] = id;dx[0][y2 + 27][x2 - 12] = id;dx[0][y2 + 27][x2 - 11] = id;dx[0][y2 + 27][x2 - 10] = id;dx[0][y2 + 27][x2 - 9] = id;dx[0][y2 + 27][x2 - 8] = id;dx[0][y2 + 27][x2 - 7] = id;dx[0][y2 + 27][x2 - 6] = id;dx[0][y2 + 27][x2 - 5] = id;
	dx[0][y2 + 27][x2 - 4] = id;dx[0][y2 + 27][x2 - 3] = id;dx[0][y2 + 27][x2 - 2] = id;dx[0][y2 + 27][x2 - 1] = id;dx[0][y2 + 27][x2 + 0] = id;dx[0][y2 + 27][x2 + 1] = id;dx[0][y2 + 27][x2 + 2] = id;dx[0][y2 + 27][x2 + 3] = id;dx[0][y2 + 27][x2 + 4] = id;
	dx[0][y2 + 27][x2 + 5] = id;dx[0][y2 + 27][x2 + 6] = id;dx[0][y2 + 27][x2 + 7] = id;dx[0][y2 + 27][x2 + 8] = id;dx[0][y2 + 27][x2 + 9] = id;dx[0][y2 + 27][x2 + 10] = id;dx[0][y2 + 27][x2 + 11] = id;dx[0][y2 + 27][x2 + 12] = id;dx[0][y2 + 27][x2 + 13] = id;
	dx[0][y2 + 27][x2 + 14] = id;dx[0][y2 + 27][x2 + 15] = id;dx[0][y2 + 27][x2 + 16] = id;dx[0][y2 + 27][x2 + 17] = id;dx[0][y2 + 27][x2 + 18] = id;dx[0][y2 + 27][x2 + 19] = id;dx[0][y2 + 27][x2 + 20] = id;dx[0][y2 + 27][x2 + 21] = id;dx[0][y2 + 27][x2 + 22] = id;
	dx[0][y2 + 27][x2 + 23] = id;dx[0][y2 + 27][x2 + 24] = id;
}

void woodpie(int x2, int y2) 
{
	x2 = x2 + 30 + 30;
	y2 = 600 - y2;
	int id = 15;
	dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 1][x2 - 1] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 1] = id;dx[0][y2 + 2][x2 - 1] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 1] = id;dx[0][y2 + 3][x2 - 1] = id;dx[0][y2 + 3][x2 + 0] = id;
	dx[0][y2 + 3][x2 + 1] = id;dx[0][y2 + 4][x2 - 1] = id;dx[0][y2 + 4][x2 + 0] = id;dx[0][y2 + 4][x2 + 1] = id;dx[0][y2 + 5][x2 - 1] = id;dx[0][y2 + 5][x2 + 0] = id;dx[0][y2 + 5][x2 + 1] = id;dx[0][y2 + 6][x2 - 1] = id;dx[0][y2 + 6][x2 + 0] = id;
	dx[0][y2 + 6][x2 + 1] = id;dx[0][y2 + 7][x2 - 1] = id;dx[0][y2 + 7][x2 + 0] = id;dx[0][y2 + 7][x2 + 1] = id;dx[0][y2 + 8][x2 - 1] = id;dx[0][y2 + 8][x2 + 0] = id;dx[0][y2 + 8][x2 + 1] = id;dx[0][y2 + 9][x2 - 1] = id;dx[0][y2 + 9][x2 + 0] = id;
	dx[0][y2 + 9][x2 + 1] = id;dx[0][y2 + 10][x2 - 1] = id;dx[0][y2 + 10][x2 + 0] = id;dx[0][y2 + 10][x2 + 1] = id;dx[0][y2 + 11][x2 - 1] = id;dx[0][y2 + 11][x2 + 0] = id;dx[0][y2 + 11][x2 + 1] = id;dx[0][y2 + 12][x2 - 1] = id;dx[0][y2 + 12][x2 + 0] = id;
	dx[0][y2 + 12][x2 + 1] = id;dx[0][y2 + 13][x2 - 1] = id;dx[0][y2 + 13][x2 + 0] = id;dx[0][y2 + 13][x2 + 1] = id;
	id = 3;
	dx[0][y2 + 14][x2 - 3] = id;dx[0][y2 + 14][x2 - 2] = id;dx[0][y2 + 14][x2 - 1] = id;dx[0][y2 + 14][x2 + 0] = id;dx[0][y2 + 14][x2 + 1] = id;
	dx[0][y2 + 14][x2 + 2] = id;dx[0][y2 + 14][x2 + 3] = id;dx[0][y2 + 15][x2 - 5] = id;dx[0][y2 + 15][x2 - 4] = id;dx[0][y2 + 15][x2 - 3] = id;dx[0][y2 + 15][x2 - 2] = id;dx[0][y2 + 15][x2 - 1] = id;dx[0][y2 + 15][x2 + 0] = id;dx[0][y2 + 15][x2 + 1] = id;
	dx[0][y2 + 15][x2 + 2] = id;dx[0][y2 + 15][x2 + 3] = id;dx[0][y2 + 15][x2 + 4] = id;dx[0][y2 + 15][x2 + 5] = id;
}

void xcross(int x2, int y2) {

	x2 = x2 + 30 + 30;
	y2 = 600 - y2;
	int id = 15;
	dx[0][y2 - 10][x2 - 15] = id;dx[0][y2 - 10][x2 - 14] = id;dx[0][y2 - 10][x2 - 13] = id;dx[0][y2 - 10][x2 - 12] = id;dx[0][y2 - 10][x2 - 11] = id;dx[0][y2 - 10][x2 - 10] = id;dx[0][y2 - 10][x2 + 11] = id;dx[0][y2 - 10][x2 + 12] = id;dx[0][y2 - 10][x2 + 13] = id;
	dx[0][y2 - 10][x2 + 14] = id;dx[0][y2 - 10][x2 + 15] = id;dx[0][y2 - 10][x2 + 16] = id;dx[0][y2 - 9][x2 - 14] = id;dx[0][y2 - 9][x2 - 13] = id;dx[0][y2 - 9][x2 - 12] = id;dx[0][y2 - 9][x2 - 11] = id;dx[0][y2 - 9][x2 - 10] = id;dx[0][y2 - 9][x2 - 9] = id;
	dx[0][y2 - 9][x2 + 10] = id;dx[0][y2 - 9][x2 + 11] = id;dx[0][y2 - 9][x2 + 12] = id;dx[0][y2 - 9][x2 + 13] = id;dx[0][y2 - 9][x2 + 14] = id;dx[0][y2 - 9][x2 + 15] = id;dx[0][y2 - 8][x2 - 13] = id;dx[0][y2 - 8][x2 - 12] = id;dx[0][y2 - 8][x2 - 11] = id;
	dx[0][y2 - 8][x2 - 10] = id;dx[0][y2 - 8][x2 - 9] = id;dx[0][y2 - 8][x2 - 8] = id;dx[0][y2 - 8][x2 - 7] = id;dx[0][y2 - 8][x2 - 6] = id;dx[0][y2 - 8][x2 + 9] = id;dx[0][y2 - 8][x2 + 10] = id;dx[0][y2 - 8][x2 + 11] = id;dx[0][y2 - 8][x2 + 12] = id;
	dx[0][y2 - 8][x2 + 13] = id;dx[0][y2 - 8][x2 + 14] = id;dx[0][y2 - 7][x2 - 12] = id;dx[0][y2 - 7][x2 - 11] = id;dx[0][y2 - 7][x2 - 10] = id;dx[0][y2 - 7][x2 - 9] = id;dx[0][y2 - 7][x2 - 8] = id;dx[0][y2 - 7][x2 - 7] = id;dx[0][y2 - 7][x2 - 6] = id;
	dx[0][y2 - 7][x2 + 6] = id;dx[0][y2 - 7][x2 + 7] = id;dx[0][y2 - 7][x2 + 8] = id;dx[0][y2 - 7][x2 + 9] = id;dx[0][y2 - 7][x2 + 10] = id;dx[0][y2 - 7][x2 + 11] = id;dx[0][y2 - 7][x2 + 12] = id;dx[0][y2 - 7][x2 + 13] = id;dx[0][y2 - 6][x2 - 13] = id;
	dx[0][y2 - 6][x2 - 12] = id;dx[0][y2 - 6][x2 - 11] = id;dx[0][y2 - 6][x2 - 10] = id;dx[0][y2 - 6][x2 - 9] = id;dx[0][y2 - 6][x2 - 8] = id;dx[0][y2 - 6][x2 - 7] = id;dx[0][y2 - 6][x2 - 6] = id;dx[0][y2 - 6][x2 + 6] = id;dx[0][y2 - 6][x2 + 7] = id;
	dx[0][y2 - 6][x2 + 8] = id;dx[0][y2 - 6][x2 + 9] = id;dx[0][y2 - 6][x2 + 10] = id;dx[0][y2 - 6][x2 + 11] = id;dx[0][y2 - 6][x2 + 12] = id;dx[0][y2 - 6][x2 + 13] = id;dx[0][y2 - 6][x2 + 14] = id;dx[0][y2 - 5][x2 - 13] = id;dx[0][y2 - 5][x2 - 12] = id;
	dx[0][y2 - 5][x2 - 11] = id;dx[0][y2 - 5][x2 - 10] = id;dx[0][y2 - 5][x2 - 9] = id;dx[0][y2 - 5][x2 - 8] = id;dx[0][y2 - 5][x2 - 7] = id;dx[0][y2 - 5][x2 - 6] = id;dx[0][y2 - 5][x2 - 5] = id;dx[0][y2 - 5][x2 + 6] = id;dx[0][y2 - 5][x2 + 7] = id;
	dx[0][y2 - 5][x2 + 8] = id;dx[0][y2 - 5][x2 + 9] = id;dx[0][y2 - 5][x2 + 10] = id;dx[0][y2 - 5][x2 + 11] = id;dx[0][y2 - 5][x2 + 12] = id;dx[0][y2 - 5][x2 + 13] = id;dx[0][y2 - 5][x2 + 14] = id;dx[0][y2 - 4][x2 - 9] = id;dx[0][y2 - 4][x2 - 8] = id;
	dx[0][y2 - 4][x2 - 7] = id;dx[0][y2 - 4][x2 - 6] = id;dx[0][y2 - 4][x2 - 5] = id;dx[0][y2 - 4][x2 - 4] = id;dx[0][y2 - 4][x2 + 5] = id;dx[0][y2 - 4][x2 + 6] = id;dx[0][y2 - 4][x2 + 7] = id;dx[0][y2 - 4][x2 + 8] = id;dx[0][y2 - 4][x2 + 9] = id;
	dx[0][y2 - 4][x2 + 10] = id;dx[0][y2 - 3][x2 - 8] = id;dx[0][y2 - 3][x2 - 7] = id;dx[0][y2 - 3][x2 - 6] = id;dx[0][y2 - 3][x2 - 5] = id;dx[0][y2 - 3][x2 - 4] = id;dx[0][y2 - 3][x2 - 3] = id;dx[0][y2 - 3][x2 + 4] = id;dx[0][y2 - 3][x2 + 5] = id;
	dx[0][y2 - 3][x2 + 6] = id;dx[0][y2 - 3][x2 + 7] = id;dx[0][y2 - 3][x2 + 8] = id;dx[0][y2 - 3][x2 + 9] = id;dx[0][y2 - 2][x2 - 7] = id;dx[0][y2 - 2][x2 - 6] = id;dx[0][y2 - 2][x2 - 5] = id;dx[0][y2 - 2][x2 - 4] = id;dx[0][y2 - 2][x2 - 3] = id;
	dx[0][y2 - 2][x2 - 2] = id;dx[0][y2 - 2][x2 + 3] = id;dx[0][y2 - 2][x2 + 4] = id;dx[0][y2 - 2][x2 + 5] = id;dx[0][y2 - 2][x2 + 6] = id;dx[0][y2 - 2][x2 + 7] = id;dx[0][y2 - 2][x2 + 8] = id;dx[0][y2 - 1][x2 - 6] = id;dx[0][y2 - 1][x2 - 5] = id;
	dx[0][y2 - 1][x2 - 4] = id;dx[0][y2 - 1][x2 - 3] = id;dx[0][y2 - 1][x2 - 2] = id;dx[0][y2 - 1][x2 - 1] = id;dx[0][y2 - 1][x2 + 2] = id;dx[0][y2 - 1][x2 + 3] = id;dx[0][y2 - 1][x2 + 4] = id;dx[0][y2 - 1][x2 + 5] = id;dx[0][y2 - 1][x2 + 6] = id;
	dx[0][y2 - 1][x2 + 7] = id;dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;
	dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;dx[0][y2 + 1][x2 - 5] = id;dx[0][y2 + 1][x2 - 4] = id;dx[0][y2 + 1][x2 - 3] = id;dx[0][y2 + 1][x2 - 2] = id;dx[0][y2 + 1][x2 - 1] = id;
	dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 1] = id;dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 1][x2 + 3] = id;dx[0][y2 + 1][x2 + 4] = id;dx[0][y2 + 1][x2 + 5] = id;dx[0][y2 + 2][x2 - 5] = id;dx[0][y2 + 2][x2 - 4] = id;dx[0][y2 + 2][x2 - 3] = id;
	dx[0][y2 + 2][x2 - 2] = id;dx[0][y2 + 2][x2 - 1] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 1] = id;dx[0][y2 + 2][x2 + 2] = id;dx[0][y2 + 2][x2 + 3] = id;dx[0][y2 + 2][x2 + 4] = id;dx[0][y2 + 2][x2 + 5] = id;dx[0][y2 + 2][x2 + 6] = id;
	dx[0][y2 + 3][x2 - 6] = id;dx[0][y2 + 3][x2 - 5] = id;dx[0][y2 + 3][x2 - 4] = id;dx[0][y2 + 3][x2 - 3] = id;dx[0][y2 + 3][x2 - 2] = id;dx[0][y2 + 3][x2 - 1] = id;dx[0][y2 + 3][x2 + 1] = id;dx[0][y2 + 3][x2 + 2] = id;dx[0][y2 + 3][x2 + 3] = id;
	dx[0][y2 + 3][x2 + 4] = id;dx[0][y2 + 3][x2 + 5] = id;dx[0][y2 + 3][x2 + 6] = id;dx[0][y2 + 3][x2 + 7] = id;dx[0][y2 + 4][x2 - 7] = id;dx[0][y2 + 4][x2 - 6] = id;dx[0][y2 + 4][x2 - 5] = id;dx[0][y2 + 4][x2 - 4] = id;dx[0][y2 + 4][x2 - 3] = id;
	dx[0][y2 + 4][x2 - 2] = id;dx[0][y2 + 4][x2 + 2] = id;dx[0][y2 + 4][x2 + 3] = id;dx[0][y2 + 4][x2 + 4] = id;dx[0][y2 + 4][x2 + 5] = id;dx[0][y2 + 4][x2 + 6] = id;dx[0][y2 + 4][x2 + 7] = id;dx[0][y2 + 4][x2 + 8] = id;dx[0][y2 + 5][x2 - 8] = id;
	dx[0][y2 + 5][x2 - 7] = id;dx[0][y2 + 5][x2 - 6] = id;dx[0][y2 + 5][x2 - 5] = id;dx[0][y2 + 5][x2 - 4] = id;dx[0][y2 + 5][x2 - 3] = id;dx[0][y2 + 5][x2 + 3] = id;dx[0][y2 + 5][x2 + 4] = id;dx[0][y2 + 5][x2 + 5] = id;dx[0][y2 + 5][x2 + 6] = id;
	dx[0][y2 + 5][x2 + 7] = id;dx[0][y2 + 5][x2 + 8] = id;dx[0][y2 + 5][x2 + 9] = id;dx[0][y2 + 5][x2 + 10] = id;dx[0][y2 + 5][x2 + 11] = id;dx[0][y2 + 6][x2 - 11] = id;dx[0][y2 + 6][x2 - 10] = id;dx[0][y2 + 6][x2 - 9] = id;dx[0][y2 + 6][x2 - 8] = id;
	dx[0][y2 + 6][x2 - 7] = id;dx[0][y2 + 6][x2 - 6] = id;dx[0][y2 + 6][x2 - 5] = id;dx[0][y2 + 6][x2 - 4] = id;dx[0][y2 + 6][x2 + 4] = id;dx[0][y2 + 6][x2 + 5] = id;dx[0][y2 + 6][x2 + 6] = id;dx[0][y2 + 6][x2 + 7] = id;dx[0][y2 + 6][x2 + 8] = id;
	dx[0][y2 + 6][x2 + 9] = id;dx[0][y2 + 6][x2 + 10] = id;dx[0][y2 + 6][x2 + 11] = id;dx[0][y2 + 7][x2 - 11] = id;dx[0][y2 + 7][x2 - 10] = id;dx[0][y2 + 7][x2 - 9] = id;dx[0][y2 + 7][x2 - 8] = id;dx[0][y2 + 7][x2 - 7] = id;dx[0][y2 + 7][x2 - 6] = id;
	dx[0][y2 + 7][x2 - 5] = id;dx[0][y2 + 7][x2 - 4] = id;dx[0][y2 + 7][x2 + 3] = id;dx[0][y2 + 7][x2 + 4] = id;dx[0][y2 + 7][x2 + 5] = id;dx[0][y2 + 7][x2 + 6] = id;dx[0][y2 + 7][x2 + 7] = id;dx[0][y2 + 7][x2 + 8] = id;dx[0][y2 + 7][x2 + 9] = id;
	dx[0][y2 + 7][x2 + 10] = id;dx[0][y2 + 7][x2 + 11] = id;dx[0][y2 + 8][x2 - 11] = id;dx[0][y2 + 8][x2 - 10] = id;dx[0][y2 + 8][x2 - 9] = id;dx[0][y2 + 8][x2 - 8] = id;dx[0][y2 + 8][x2 - 7] = id;dx[0][y2 + 8][x2 - 6] = id;dx[0][y2 + 8][x2 - 5] = id;
	dx[0][y2 + 8][x2 - 4] = id;dx[0][y2 + 8][x2 + 3] = id;dx[0][y2 + 8][x2 + 4] = id;dx[0][y2 + 8][x2 + 5] = id;dx[0][y2 + 8][x2 + 6] = id;dx[0][y2 + 8][x2 + 7] = id;dx[0][y2 + 8][x2 + 8] = id;dx[0][y2 + 8][x2 + 9] = id;dx[0][y2 + 8][x2 + 10] = id;
	dx[0][y2 + 8][x2 + 11] = id;dx[0][y2 + 8][x2 + 12] = id;dx[0][y2 + 9][x2 - 12] = id;dx[0][y2 + 9][x2 - 11] = id;dx[0][y2 + 9][x2 - 10] = id;dx[0][y2 + 9][x2 - 9] = id;dx[0][y2 + 9][x2 - 8] = id;dx[0][y2 + 9][x2 - 7] = id;dx[0][y2 + 9][x2 + 7] = id;
	dx[0][y2 + 9][x2 + 8] = id;dx[0][y2 + 9][x2 + 9] = id;dx[0][y2 + 9][x2 + 10] = id;dx[0][y2 + 9][x2 + 11] = id;dx[0][y2 + 9][x2 + 12] = id;dx[0][y2 + 9][x2 + 13] = id;dx[0][y2 + 10][x2 - 13] = id;dx[0][y2 + 10][x2 - 12] = id;dx[0][y2 + 10][x2 - 11] = id;
	dx[0][y2 + 10][x2 - 10] = id;dx[0][y2 + 10][x2 - 9] = id;dx[0][y2 + 10][x2 - 8] = id;dx[0][y2 + 10][x2 + 8] = id;dx[0][y2 + 10][x2 + 9] = id;dx[0][y2 + 10][x2 + 10] = id;dx[0][y2 + 10][x2 + 11] = id;dx[0][y2 + 10][x2 + 12] = id;dx[0][y2 + 10][x2 + 13] = id;
	dx[0][y2 + 10][x2 + 14] = id;dx[0][y2 + 11][x2 - 14] = id;dx[0][y2 + 11][x2 - 13] = id;dx[0][y2 + 11][x2 - 12] = id;dx[0][y2 + 11][x2 - 11] = id;dx[0][y2 + 11][x2 - 10] = id;dx[0][y2 + 11][x2 - 9] = id;dx[0][y2 + 11][x2 + 9] = id;dx[0][y2 + 11][x2 + 10] = id;
	dx[0][y2 + 11][x2 + 11] = id;dx[0][y2 + 11][x2 + 12] = id;dx[0][y2 + 11][x2 + 13] = id;dx[0][y2 + 11][x2 + 14] = id;dx[0][y2 + 11][x2 + 15] = id;dx[0][y2 + 12][x2 - 18] = id;dx[0][y2 + 12][x2 - 17] = id;dx[0][y2 + 12][x2 - 16] = id;dx[0][y2 + 12][x2 - 15] = id;
	dx[0][y2 + 12][x2 - 14] = id;dx[0][y2 + 12][x2 - 13] = id;dx[0][y2 + 12][x2 - 12] = id;dx[0][y2 + 12][x2 - 11] = id;dx[0][y2 + 12][x2 - 10] = id;dx[0][y2 + 12][x2 - 9] = id;dx[0][y2 + 12][x2 - 8] = id;dx[0][y2 + 12][x2 - 7] = id;dx[0][y2 + 12][x2 - 6] = id;
	dx[0][y2 + 12][x2 - 5] = id;dx[0][y2 + 12][x2 - 4] = id;dx[0][y2 + 12][x2 - 3] = id;dx[0][y2 + 12][x2 - 2] = id;dx[0][y2 + 12][x2 - 1] = id;dx[0][y2 + 12][x2 + 0] = id;dx[0][y2 + 12][x2 + 1] = id;dx[0][y2 + 12][x2 + 2] = id;dx[0][y2 + 12][x2 + 3] = id;
	dx[0][y2 + 12][x2 + 4] = id;dx[0][y2 + 12][x2 + 5] = id;dx[0][y2 + 12][x2 + 6] = id;dx[0][y2 + 12][x2 + 7] = id;dx[0][y2 + 12][x2 + 8] = id;dx[0][y2 + 12][x2 + 9] = id;dx[0][y2 + 12][x2 + 10] = id;dx[0][y2 + 12][x2 + 11] = id;dx[0][y2 + 12][x2 + 12] = id;
	dx[0][y2 + 12][x2 + 13] = id;dx[0][y2 + 12][x2 + 14] = id;dx[0][y2 + 12][x2 + 15] = id;dx[0][y2 + 12][x2 + 16] = id;dx[0][y2 + 12][x2 + 17] = id;dx[0][y2 + 12][x2 + 18] = id;dx[0][y2 + 12][x2 + 19] = id;dx[0][y2 + 13][x2 - 20] = id;dx[0][y2 + 13][x2 - 19] = id;
	dx[0][y2 + 13][x2 - 18] = id;dx[0][y2 + 13][x2 - 17] = id;dx[0][y2 + 13][x2 - 16] = id;dx[0][y2 + 13][x2 - 15] = id;dx[0][y2 + 13][x2 - 14] = id;dx[0][y2 + 13][x2 - 13] = id;dx[0][y2 + 13][x2 - 12] = id;dx[0][y2 + 13][x2 - 11] = id;dx[0][y2 + 13][x2 - 10] = id;
	dx[0][y2 + 13][x2 - 9] = id;dx[0][y2 + 13][x2 - 8] = id;dx[0][y2 + 13][x2 - 7] = id;dx[0][y2 + 13][x2 - 6] = id;dx[0][y2 + 13][x2 - 5] = id;dx[0][y2 + 13][x2 - 4] = id;dx[0][y2 + 13][x2 - 3] = id;dx[0][y2 + 13][x2 - 2] = id;dx[0][y2 + 13][x2 - 1] = id;
	dx[0][y2 + 13][x2 + 0] = id;dx[0][y2 + 13][x2 + 1] = id;dx[0][y2 + 13][x2 + 2] = id;dx[0][y2 + 13][x2 + 3] = id;dx[0][y2 + 13][x2 + 4] = id;dx[0][y2 + 13][x2 + 5] = id;dx[0][y2 + 13][x2 + 6] = id;dx[0][y2 + 13][x2 + 7] = id;dx[0][y2 + 13][x2 + 8] = id;
	dx[0][y2 + 13][x2 + 9] = id;dx[0][y2 + 13][x2 + 10] = id;dx[0][y2 + 13][x2 + 11] = id;dx[0][y2 + 13][x2 + 12] = id;dx[0][y2 + 13][x2 + 13] = id;dx[0][y2 + 13][x2 + 14] = id;dx[0][y2 + 13][x2 + 15] = id;dx[0][y2 + 13][x2 + 16] = id;dx[0][y2 + 13][x2 + 17] = id;
	dx[0][y2 + 13][x2 + 18] = id;dx[0][y2 + 13][x2 + 19] = id;dx[0][y2 + 13][x2 + 20] = id;dx[0][y2 + 13][x2 + 21] = id;
}

int doorr(int x1, int y1)
{
	x1 = x1 + 30 + 30;
	y1 = 600 - y1;
	dx[0][y1][x1 + 1] = 右门;
	dx[0][y1][x1] = 右门;
	dx[0][y1][x1 - 1] = 右门;
	y1--;
	dx[0][y1][x1] = 右门;dx[0][y1][x1 + 1] = 右门;
	y1--;
	dx[0][y1][x1] = 右门;dx[0][y1][x1 + 1] = 右门;
	y1--;
	dx[0][y1][x1] = 右门;dx[0][y1][x1 + 1] = 右门;
	y1--;
	dx[0][y1][x1] = 右门;dx[0][y1][x1 - 1] = 右门;
	y1--;
	dx[0][y1][x1] = 右门;dx[0][y1][x1 + 1] = 右门;
	y1--;
	dx[0][y1][x1] = 右门;dx[0][y1][x1 + 1] = 右门;
	y1--;
	dx[0][y1][x1] = 右门;dx[0][y1][x1 + 1] = 右门;
	y1--;
	dx[0][y1][x1] = 右门;
	dx[0][y1][x1 + 1] = 右门;
	dx[0][y1][x1 - 1] = 右门;

	return x1 - 60;

}

int doorl(int x1, int y1)
{
	x1 = x1 + 30 + 30;
	y1 = 600 - y1;
	dx[0][y1][x1 + 1] = 左门;
	dx[0][y1][x1] = 左门;
	dx[0][y1][x1 - 1] = 左门;
	y1--;
	dx[0][y1][x1] = 左门;;dx[0][y1][x1 - 1] = 左门;
	y1--;
	dx[0][y1][x1] = 左门;;dx[0][y1][x1 - 1] = 左门;
	y1--;
	dx[0][y1][x1] = 左门;;dx[0][y1][x1 - 1] = 左门;
	y1--;
	dx[0][y1][x1] = 左门;;dx[0][y1][x1 + 1] = 左门;
	y1--;
	dx[0][y1][x1] = 左门;;dx[0][y1][x1 - 1] = 左门;
	y1--;
	dx[0][y1][x1] = 左门;;dx[0][y1][x1 - 1] = 左门;
	y1--;
	dx[0][y1][x1] = 左门;;dx[0][y1][x1 - 1] = 左门;
	y1--;
	dx[0][y1][x1] = 左门;
	dx[0][y1][x1 + 1] = 左门;
	dx[0][y1][x1 - 1] = 左门;

	return x1 - 60;


}

int doorf(int x1, int y1) {
	int a, b;
	x1 = x1 + 30 + 30;
	y1 = 600 - y1;
	for (a = 0;a < 10;a++)
		dx[0][y1][x1 + a] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;

	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	dx[0][y1][x1 + 3] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	y1--;
	dx[0][y1][x1] = 前门;
	dx[0][y1][x1 + 9] = 前门;
	for (a = 0;a < 10;a++)
		dx[0][y1][x1 + a] = 前门;

	return y1 + 8;

}

int doorb(int x1, int y1) {
	int a, b;
	x1 = x1 + 30 + 30;
	y1 = 600 - y1;
	for (a = 0;a < 10;a++)
		dx[0][y1][x1 + a] = 后门;
	y1--;
	dx[0][y1][x1] = 后门;
	dx[0][y1][x1 + 9] = 后门;
	y1--;
	dx[0][y1][x1] = 后门;
	dx[0][y1][x1 + 9] = 后门;
	y1--;
	dx[0][y1][x1] = 后门;
	dx[0][y1][x1 + 9] = 后门;

	y1--;
	dx[0][y1][x1] = 后门;
	dx[0][y1][x1 + 9] = 后门;
	dx[0][y1][x1 + 6] = 后门;
	y1--;
	dx[0][y1][x1] = 后门;
	dx[0][y1][x1 + 9] = 后门;
	y1--;
	dx[0][y1][x1] = 后门;
	dx[0][y1][x1 + 9] = 后门;
	y1--;
	dx[0][y1][x1] = 后门;
	dx[0][y1][x1 + 9] = 后门;
	y1--;
	dx[0][y1][x1] = 后门;
	dx[0][y1][x1 + 9] = 后门;
	for (a = 0;a < 10;a++)
		dx[0][y1][x1 + a] = 后门;

	return y1 + 8;
}

void juxing(int x1, int l1, int y1, int l2)
{
	x1 = x1 + 30 + 30;
	int f2, f1, c = l1;

	y1 = 600 - y1;
	for (f2 = y1;y1 + l2 - f2; f2++)
	{
		for (f1 = x1;x1 + l1 - f1; f1++)
		{

			dx[0][f2][f1] = 台;
		}
	}
}

void wall(int x1, int l1, int y1, int l2)
{
	x1 = x1 + 30 + 30;
	int f2, f1, c = l1;
	y1 = 600 - y1;
	for (f2 = y1;y1 + l2 - f2; f2++)
	{
		for (f1 = x1;x1 + l1 - f1; f1++)
		{
			dx[0][f2][f1] = 墙;

		}
	}
}

void visualt(int amount, int ix, int iy ,char viname[50])
{
	int ric=0;
	if (strcmp(viname, "flag")==0) { ric = 3;  }
	if (strcmp(viname, "thedoor")==0) { ric =4 ;  }
	if (strcmp(viname, "stick") == 0) { ric = 5; }
	/*
	if (strcmp(viname, "")) { ric = ; goto down; }
	if (strcmp(viname, "")) { ric = ; goto down; }
	if (strcmp(viname, "")) { ric = ; goto down; }
	if (strcmp(viname, "")) { ric = ; goto down; }
	*/
	down:
	visual[ric][amount] = ric;
	visualx[ric][amount] = ix;
	visualy[ric][amount] = iy;
}

void storehouse(int x1, int y1, int e)
{
	if (e == 0) {
		int x2 = x1;
		int y2 = y1;
		x2 = x2 + 30 + 30;

		y2 = 600 - y2;

		int id = 15;

		dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 1][x2 - 2] = id;dx[0][y2 + 1][x2 - 1] = id;dx[0][y2 + 1][x2 + 1] = id;dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 2][x2 - 4] = id;dx[0][y2 + 2][x2 - 3] = id;dx[0][y2 + 2][x2 - 2] = id;dx[0][y2 + 2][x2 + 2] = id;
		dx[0][y2 + 2][x2 + 3] = id;dx[0][y2 + 2][x2 + 4] = id;dx[0][y2 + 3][x2 - 6] = id;dx[0][y2 + 3][x2 - 5] = id;dx[0][y2 + 3][x2 - 4] = id;dx[0][y2 + 3][x2 - 3] = id;dx[0][y2 + 3][x2 + 3] = id;dx[0][y2 + 3][x2 + 4] = id;dx[0][y2 + 3][x2 + 5] = id;
		dx[0][y2 + 3][x2 + 6] = id;dx[0][y2 + 4][x2 - 10] = id;dx[0][y2 + 4][x2 - 9] = id;dx[0][y2 + 4][x2 - 8] = id;dx[0][y2 + 4][x2 - 7] = id;dx[0][y2 + 4][x2 - 6] = id;dx[0][y2 + 4][x2 + 6] = id;dx[0][y2 + 4][x2 + 7] = id;dx[0][y2 + 4][x2 + 8] = id;
		dx[0][y2 + 4][x2 + 9] = id;dx[0][y2 + 4][x2 + 10] = id;dx[0][y2 + 5][x2 - 13] = id;dx[0][y2 + 5][x2 - 12] = id;dx[0][y2 + 5][x2 - 11] = id;dx[0][y2 + 5][x2 - 10] = id;dx[0][y2 + 5][x2 + 10] = id;dx[0][y2 + 5][x2 + 11] = id;dx[0][y2 + 5][x2 + 12] = id;
		dx[0][y2 + 5][x2 + 13] = id;dx[0][y2 + 6][x2 - 13] = id;dx[0][y2 + 6][x2 - 12] = id;dx[0][y2 + 6][x2 + 12] = id;dx[0][y2 + 6][x2 + 13] = id;dx[0][y2 + 7][x2 - 13] = id;dx[0][y2 + 7][x2 - 12] = id;dx[0][y2 + 7][x2 + 12] = id;dx[0][y2 + 7][x2 + 13] = id;
		dx[0][y2 + 8][x2 - 13] = id;dx[0][y2 + 8][x2 - 12] = id;dx[0][y2 + 8][x2 + 12] = id;dx[0][y2 + 8][x2 + 13] = id;dx[0][y2 + 9][x2 - 13] = id;dx[0][y2 + 9][x2 - 12] = id;dx[0][y2 + 9][x2 - 2] = id;dx[0][y2 + 9][x2 - 1] = id;dx[0][y2 + 9][x2 + 0] = id;
		dx[0][y2 + 9][x2 + 1] = id;dx[0][y2 + 9][x2 + 2] = id;dx[0][y2 + 9][x2 + 12] = id;dx[0][y2 + 9][x2 + 13] = id;dx[0][y2 + 10][x2 - 13] = id;dx[0][y2 + 10][x2 - 12] = id;dx[0][y2 + 10][x2 - 4] = id;dx[0][y2 + 10][x2 - 3] = id;dx[0][y2 + 10][x2 - 2] = id;
		dx[0][y2 + 10][x2 - 1] = id;dx[0][y2 + 10][x2 + 0] = id;dx[0][y2 + 10][x2 + 1] = id;dx[0][y2 + 10][x2 + 2] = id;dx[0][y2 + 10][x2 + 3] = id;dx[0][y2 + 10][x2 + 4] = id;dx[0][y2 + 10][x2 + 12] = id;dx[0][y2 + 10][x2 + 13] = id;dx[0][y2 + 11][x2 - 37] = id;
		dx[0][y2 + 11][x2 - 36] = id;dx[0][y2 + 11][x2 - 35] = id;dx[0][y2 + 11][x2 - 34] = id;dx[0][y2 + 11][x2 - 33] = id;dx[0][y2 + 11][x2 - 32] = id;dx[0][y2 + 11][x2 - 31] = id;dx[0][y2 + 11][x2 - 30] = id;dx[0][y2 + 11][x2 - 29] = id;dx[0][y2 + 11][x2 - 28] = id;
		dx[0][y2 + 11][x2 - 27] = id;dx[0][y2 + 11][x2 - 26] = id;dx[0][y2 + 11][x2 - 25] = id;dx[0][y2 + 11][x2 - 24] = id;dx[0][y2 + 11][x2 - 23] = id;dx[0][y2 + 11][x2 - 22] = id;dx[0][y2 + 11][x2 - 21] = id;dx[0][y2 + 11][x2 - 20] = id;dx[0][y2 + 11][x2 - 19] = id;
		dx[0][y2 + 11][x2 - 18] = id;dx[0][y2 + 11][x2 - 17] = id;dx[0][y2 + 11][x2 - 16] = id;dx[0][y2 + 11][x2 - 15] = id;dx[0][y2 + 11][x2 - 14] = id;dx[0][y2 + 11][x2 - 13] = id;dx[0][y2 + 11][x2 - 12] = id;dx[0][y2 + 11][x2 - 5] = id;dx[0][y2 + 11][x2 - 4] = id;
		dx[0][y2 + 11][x2 - 3] = id;dx[0][y2 + 11][x2 + 3] = id;dx[0][y2 + 11][x2 + 4] = id;dx[0][y2 + 11][x2 + 5] = id;dx[0][y2 + 11][x2 + 12] = id;dx[0][y2 + 11][x2 + 13] = id;dx[0][y2 + 12][x2 - 23] = id;dx[0][y2 + 12][x2 - 22] = id;dx[0][y2 + 12][x2 - 13] = id;
		dx[0][y2 + 12][x2 - 12] = id;dx[0][y2 + 12][x2 - 5] = id;dx[0][y2 + 12][x2 + 5] = id;dx[0][y2 + 12][x2 + 12] = id;dx[0][y2 + 12][x2 + 13] = id;dx[0][y2 + 13][x2 - 22] = id;dx[0][y2 + 13][x2 - 21] = id;dx[0][y2 + 13][x2 - 13] = id;dx[0][y2 + 13][x2 - 12] = id;
		dx[0][y2 + 13][x2 - 5] = id;dx[0][y2 + 13][x2 - 4] = id;dx[0][y2 + 13][x2 - 3] = id;dx[0][y2 + 13][x2 - 2] = id;dx[0][y2 + 13][x2 + 1] = id;dx[0][y2 + 13][x2 + 2] = id;dx[0][y2 + 13][x2 + 3] = id;dx[0][y2 + 13][x2 + 4] = id;dx[0][y2 + 13][x2 + 5] = id;
		dx[0][y2 + 13][x2 + 12] = id;dx[0][y2 + 13][x2 + 13] = id;dx[0][y2 + 14][x2 - 21] = id;dx[0][y2 + 14][x2 - 20] = id;dx[0][y2 + 14][x2 - 13] = id;dx[0][y2 + 14][x2 - 12] = id;dx[0][y2 + 14][x2 - 4] = id;dx[0][y2 + 14][x2 - 3] = id;dx[0][y2 + 14][x2 - 2] = id;
		dx[0][y2 + 14][x2 - 1] = id;dx[0][y2 + 14][x2 + 0] = id;dx[0][y2 + 14][x2 + 1] = id;dx[0][y2 + 14][x2 + 2] = id;dx[0][y2 + 14][x2 + 3] = id;dx[0][y2 + 14][x2 + 4] = id;dx[0][y2 + 14][x2 + 12] = id;dx[0][y2 + 14][x2 + 13] = id;dx[0][y2 + 15][x2 - 20] = id;
		dx[0][y2 + 15][x2 - 19] = id;dx[0][y2 + 15][x2 - 13] = id;dx[0][y2 + 15][x2 - 12] = id;dx[0][y2 + 15][x2 - 2] = id;dx[0][y2 + 15][x2 - 1] = id;dx[0][y2 + 15][x2 + 0] = id;dx[0][y2 + 15][x2 + 1] = id;dx[0][y2 + 15][x2 + 2] = id;dx[0][y2 + 15][x2 + 12] = id;
		dx[0][y2 + 15][x2 + 13] = id;dx[0][y2 + 15][x2 + 14] = id;dx[0][y2 + 15][x2 + 15] = id;dx[0][y2 + 15][x2 + 16] = id;dx[0][y2 + 15][x2 + 17] = id;dx[0][y2 + 15][x2 + 18] = id;dx[0][y2 + 15][x2 + 19] = id;dx[0][y2 + 15][x2 + 20] = id;dx[0][y2 + 15][x2 + 21] = id;
		dx[0][y2 + 15][x2 + 22] = id;dx[0][y2 + 15][x2 + 23] = id;dx[0][y2 + 15][x2 + 24] = id;dx[0][y2 + 15][x2 + 25] = id;dx[0][y2 + 15][x2 + 26] = id;dx[0][y2 + 15][x2 + 27] = id;dx[0][y2 + 15][x2 + 28] = id;dx[0][y2 + 15][x2 + 29] = id;dx[0][y2 + 15][x2 + 30] = id;
		dx[0][y2 + 16][x2 - 19] = id;dx[0][y2 + 16][x2 - 18] = id;dx[0][y2 + 16][x2 - 13] = id;dx[0][y2 + 16][x2 - 12] = id;dx[0][y2 + 16][x2 + 12] = id;dx[0][y2 + 16][x2 + 13] = id;dx[0][y2 + 16][x2 + 14] = id;dx[0][y2 + 16][x2 + 15] = id;dx[0][y2 + 16][x2 + 16] = id;
		dx[0][y2 + 16][x2 + 17] = id;dx[0][y2 + 16][x2 + 18] = id;dx[0][y2 + 16][x2 + 19] = id;dx[0][y2 + 16][x2 + 20] = id;dx[0][y2 + 16][x2 + 21] = id;dx[0][y2 + 16][x2 + 22] = id;dx[0][y2 + 16][x2 + 23] = id;dx[0][y2 + 16][x2 + 24] = id;dx[0][y2 + 16][x2 + 25] = id;
		dx[0][y2 + 16][x2 + 27] = id;dx[0][y2 + 16][x2 + 28] = id;dx[0][y2 + 16][x2 + 29] = id;dx[0][y2 + 16][x2 + 30] = id;dx[0][y2 + 16][x2 + 31] = id;dx[0][y2 + 16][x2 + 32] = id;dx[0][y2 + 16][x2 + 33] = id;dx[0][y2 + 17][x2 - 18] = id;dx[0][y2 + 17][x2 - 17] = id;
		dx[0][y2 + 17][x2 - 13] = id;dx[0][y2 + 17][x2 - 12] = id;dx[0][y2 + 17][x2 + 12] = id;dx[0][y2 + 17][x2 + 13] = id;dx[0][y2 + 17][x2 + 14] = id;dx[0][y2 + 17][x2 + 16] = id;dx[0][y2 + 17][x2 + 17] = id;dx[0][y2 + 17][x2 + 18] = id;dx[0][y2 + 17][x2 + 24] = id;
		dx[0][y2 + 17][x2 + 25] = id;dx[0][y2 + 17][x2 + 30] = id;dx[0][y2 + 17][x2 + 31] = id;dx[0][y2 + 17][x2 + 32] = id;dx[0][y2 + 17][x2 + 33] = id;dx[0][y2 + 17][x2 + 34] = id;dx[0][y2 + 17][x2 + 35] = id;dx[0][y2 + 17][x2 + 36] = id;dx[0][y2 + 18][x2 - 17] = id;
		dx[0][y2 + 18][x2 - 16] = id;dx[0][y2 + 18][x2 - 13] = id;dx[0][y2 + 18][x2 - 12] = id;dx[0][y2 + 18][x2 + 12] = id;dx[0][y2 + 18][x2 + 13] = id;dx[0][y2 + 18][x2 + 16] = id;dx[0][y2 + 18][x2 + 17] = id;dx[0][y2 + 18][x2 + 18] = id;dx[0][y2 + 18][x2 + 19] = id;
		dx[0][y2 + 18][x2 + 20] = id;dx[0][y2 + 18][x2 + 21] = id;dx[0][y2 + 18][x2 + 24] = id;dx[0][y2 + 18][x2 + 25] = id;dx[0][y2 + 18][x2 + 33] = id;dx[0][y2 + 18][x2 + 34] = id;dx[0][y2 + 18][x2 + 35] = id;dx[0][y2 + 18][x2 + 36] = id;dx[0][y2 + 18][x2 + 37] = id;
		dx[0][y2 + 18][x2 + 38] = id;dx[0][y2 + 18][x2 + 39] = id;dx[0][y2 + 19][x2 - 16] = id;dx[0][y2 + 19][x2 - 15] = id;dx[0][y2 + 19][x2 - 13] = id;dx[0][y2 + 19][x2 - 12] = id;dx[0][y2 + 19][x2 + 12] = id;dx[0][y2 + 19][x2 + 13] = id;dx[0][y2 + 19][x2 + 14] = id;
		dx[0][y2 + 19][x2 + 20] = id;dx[0][y2 + 19][x2 + 21] = id;dx[0][y2 + 19][x2 + 23] = id;dx[0][y2 + 19][x2 + 24] = id;dx[0][y2 + 19][x2 + 25] = id;dx[0][y2 + 19][x2 + 37] = id;dx[0][y2 + 19][x2 + 38] = id;dx[0][y2 + 19][x2 + 39] = id;dx[0][y2 + 19][x2 + 40] = id;
		dx[0][y2 + 19][x2 + 41] = id;dx[0][y2 + 19][x2 + 42] = id;dx[0][y2 + 20][x2 - 15] = id;dx[0][y2 + 20][x2 - 14] = id;dx[0][y2 + 20][x2 - 13] = id;dx[0][y2 + 20][x2 - 12] = id;dx[0][y2 + 20][x2 - 11] = id;dx[0][y2 + 20][x2 - 10] = id;dx[0][y2 + 20][x2 - 9] = id;
		dx[0][y2 + 20][x2 - 8] = id;dx[0][y2 + 20][x2 - 7] = id;dx[0][y2 + 20][x2 - 6] = id;dx[0][y2 + 20][x2 - 5] = id;dx[0][y2 + 20][x2 - 4] = id;dx[0][y2 + 20][x2 - 3] = id;dx[0][y2 + 20][x2 - 2] = id;dx[0][y2 + 20][x2 - 1] = id;dx[0][y2 + 20][x2 + 0] = id;
		dx[0][y2 + 20][x2 + 1] = id;dx[0][y2 + 20][x2 + 2] = id;dx[0][y2 + 20][x2 + 3] = id;dx[0][y2 + 20][x2 + 4] = id;dx[0][y2 + 20][x2 + 5] = id;dx[0][y2 + 20][x2 + 6] = id;dx[0][y2 + 20][x2 + 7] = id;dx[0][y2 + 20][x2 + 8] = id;dx[0][y2 + 20][x2 + 9] = id;
		dx[0][y2 + 20][x2 + 10] = id;dx[0][y2 + 20][x2 + 11] = id;dx[0][y2 + 20][x2 + 12] = id;dx[0][y2 + 20][x2 + 13] = id;dx[0][y2 + 20][x2 + 14] = id;dx[0][y2 + 20][x2 + 15] = id;dx[0][y2 + 20][x2 + 16] = id;dx[0][y2 + 20][x2 + 17] = id;dx[0][y2 + 20][x2 + 18] = id;
		dx[0][y2 + 20][x2 + 19] = id;dx[0][y2 + 20][x2 + 20] = id;dx[0][y2 + 20][x2 + 21] = id;dx[0][y2 + 20][x2 + 22] = id;dx[0][y2 + 20][x2 + 23] = id;dx[0][y2 + 20][x2 + 24] = id;dx[0][y2 + 20][x2 + 25] = id;dx[0][y2 + 20][x2 + 40] = id;dx[0][y2 + 20][x2 + 41] = id;
		dx[0][y2 + 20][x2 + 42] = id;dx[0][y2 + 20][x2 + 43] = id;dx[0][y2 + 20][x2 + 44] = id;dx[0][y2 + 20][x2 + 45] = id;dx[0][y2 + 21][x2 - 22] = id;dx[0][y2 + 21][x2 - 21] = id;dx[0][y2 + 21][x2 - 20] = id;dx[0][y2 + 21][x2 - 19] = id;dx[0][y2 + 21][x2 - 18] = id;
		dx[0][y2 + 21][x2 - 17] = id;dx[0][y2 + 21][x2 - 16] = id;dx[0][y2 + 21][x2 - 15] = id;dx[0][y2 + 21][x2 - 14] = id;dx[0][y2 + 21][x2 - 13] = id;dx[0][y2 + 21][x2 - 12] = id;dx[0][y2 + 21][x2 - 11] = id;dx[0][y2 + 21][x2 - 10] = id;dx[0][y2 + 21][x2 - 9] = id;
		dx[0][y2 + 21][x2 - 8] = id;dx[0][y2 + 21][x2 - 7] = id;dx[0][y2 + 21][x2 - 6] = id;dx[0][y2 + 21][x2 - 5] = id;dx[0][y2 + 21][x2 - 4] = id;dx[0][y2 + 21][x2 - 3] = id;dx[0][y2 + 21][x2 - 2] = id;dx[0][y2 + 21][x2 - 1] = id;dx[0][y2 + 21][x2 + 0] = id;
		dx[0][y2 + 21][x2 + 1] = id;dx[0][y2 + 21][x2 + 2] = id;dx[0][y2 + 21][x2 + 3] = id;dx[0][y2 + 21][x2 + 4] = id;dx[0][y2 + 21][x2 + 5] = id;dx[0][y2 + 21][x2 + 6] = id;dx[0][y2 + 21][x2 + 7] = id;dx[0][y2 + 21][x2 + 8] = id;dx[0][y2 + 21][x2 + 9] = id;
		dx[0][y2 + 21][x2 + 10] = id;dx[0][y2 + 21][x2 + 11] = id;dx[0][y2 + 21][x2 + 12] = id;dx[0][y2 + 21][x2 + 13] = id;dx[0][y2 + 21][x2 + 14] = id;dx[0][y2 + 21][x2 + 15] = id;dx[0][y2 + 21][x2 + 16] = id;dx[0][y2 + 21][x2 + 17] = id;dx[0][y2 + 21][x2 + 18] = id;
		dx[0][y2 + 21][x2 + 19] = id;dx[0][y2 + 21][x2 + 20] = id;dx[0][y2 + 21][x2 + 21] = id;dx[0][y2 + 21][x2 + 22] = id;dx[0][y2 + 21][x2 + 23] = id;dx[0][y2 + 21][x2 + 24] = id;dx[0][y2 + 21][x2 + 25] = id;dx[0][y2 + 21][x2 + 26] = id;dx[0][y2 + 21][x2 + 27] = id;
		dx[0][y2 + 21][x2 + 43] = id;dx[0][y2 + 21][x2 + 44] = id;dx[0][y2 + 21][x2 + 45] = id;dx[0][y2 + 21][x2 + 46] = id;dx[0][y2 + 21][x2 + 47] = id;dx[0][y2 + 22][x2 - 22] = id;dx[0][y2 + 22][x2 - 21] = id;dx[0][y2 + 22][x2 - 12] = id;dx[0][y2 + 22][x2 - 1] = id;
		dx[0][y2 + 22][x2 + 0] = id;dx[0][y2 + 22][x2 + 1] = id;dx[0][y2 + 22][x2 + 12] = id;dx[0][y2 + 22][x2 + 27] = id;dx[0][y2 + 22][x2 + 28] = id;dx[0][y2 + 22][x2 + 45] = id;dx[0][y2 + 22][x2 + 46] = id;dx[0][y2 + 22][x2 + 47] = id;dx[0][y2 + 22][x2 + 48] = id;
		dx[0][y2 + 22][x2 + 49] = id;dx[0][y2 + 22][x2 + 50] = id;dx[0][y2 + 23][x2 - 22] = id;dx[0][y2 + 23][x2 - 21] = id;dx[0][y2 + 23][x2 - 12] = id;dx[0][y2 + 23][x2 - 3] = id;dx[0][y2 + 23][x2 - 2] = id;dx[0][y2 + 23][x2 - 1] = id;dx[0][y2 + 23][x2 + 0] = id;
		dx[0][y2 + 23][x2 + 1] = id;dx[0][y2 + 23][x2 + 2] = id;dx[0][y2 + 23][x2 + 3] = id;dx[0][y2 + 23][x2 + 12] = id;dx[0][y2 + 23][x2 + 27] = id;dx[0][y2 + 23][x2 + 28] = id;dx[0][y2 + 23][x2 + 29] = id;dx[0][y2 + 23][x2 + 30] = id;dx[0][y2 + 23][x2 + 31] = id;
		dx[0][y2 + 23][x2 + 32] = id;dx[0][y2 + 23][x2 + 33] = id;dx[0][y2 + 23][x2 + 34] = id;dx[0][y2 + 23][x2 + 35] = id;dx[0][y2 + 23][x2 + 36] = id;dx[0][y2 + 23][x2 + 37] = id;dx[0][y2 + 23][x2 + 38] = id;dx[0][y2 + 23][x2 + 39] = id;dx[0][y2 + 23][x2 + 40] = id;
		dx[0][y2 + 23][x2 + 41] = id;dx[0][y2 + 23][x2 + 42] = id;dx[0][y2 + 23][x2 + 43] = id;dx[0][y2 + 23][x2 + 44] = id;dx[0][y2 + 23][x2 + 45] = id;dx[0][y2 + 23][x2 + 46] = id;dx[0][y2 + 23][x2 + 47] = id;dx[0][y2 + 23][x2 + 48] = id;dx[0][y2 + 23][x2 + 49] = id;
		dx[0][y2 + 23][x2 + 50] = id;dx[0][y2 + 24][x2 - 22] = id;dx[0][y2 + 24][x2 - 21] = id;dx[0][y2 + 24][x2 - 12] = id;dx[0][y2 + 24][x2 - 7] = id;dx[0][y2 + 24][x2 - 6] = id;dx[0][y2 + 24][x2 - 5] = id;dx[0][y2 + 24][x2 - 4] = id;dx[0][y2 + 24][x2 - 3] = id;
		dx[0][y2 + 24][x2 - 2] = id;dx[0][y2 + 24][x2 - 1] = id;dx[0][y2 + 24][x2 + 0] = id;dx[0][y2 + 24][x2 + 1] = id;dx[0][y2 + 24][x2 + 2] = id;dx[0][y2 + 24][x2 + 3] = id;dx[0][y2 + 24][x2 + 4] = id;dx[0][y2 + 24][x2 + 5] = id;dx[0][y2 + 24][x2 + 6] = id;
		dx[0][y2 + 24][x2 + 7] = id;dx[0][y2 + 24][x2 + 8] = id;dx[0][y2 + 24][x2 + 12] = id;dx[0][y2 + 24][x2 + 27] = id;dx[0][y2 + 24][x2 + 28] = id;dx[0][y2 + 24][x2 + 29] = id;dx[0][y2 + 24][x2 + 30] = id;dx[0][y2 + 24][x2 + 31] = id;dx[0][y2 + 24][x2 + 32] = id;
		dx[0][y2 + 24][x2 + 33] = id;dx[0][y2 + 24][x2 + 34] = id;dx[0][y2 + 24][x2 + 35] = id;dx[0][y2 + 24][x2 + 36] = id;dx[0][y2 + 24][x2 + 37] = id;dx[0][y2 + 24][x2 + 38] = id;dx[0][y2 + 24][x2 + 39] = id;dx[0][y2 + 24][x2 + 40] = id;dx[0][y2 + 24][x2 + 41] = id;
		dx[0][y2 + 24][x2 + 42] = id;dx[0][y2 + 24][x2 + 43] = id;dx[0][y2 + 24][x2 + 44] = id;dx[0][y2 + 24][x2 + 45] = id;dx[0][y2 + 24][x2 + 46] = id;dx[0][y2 + 24][x2 + 47] = id;dx[0][y2 + 24][x2 + 48] = id;dx[0][y2 + 24][x2 + 49] = id;dx[0][y2 + 24][x2 + 50] = id;
		dx[0][y2 + 25][x2 - 22] = id;dx[0][y2 + 25][x2 - 21] = id;dx[0][y2 + 25][x2 - 12] = id;dx[0][y2 + 25][x2 - 11] = id;dx[0][y2 + 25][x2 - 10] = id;dx[0][y2 + 25][x2 - 9] = id;dx[0][y2 + 25][x2 - 8] = id;dx[0][y2 + 25][x2 - 7] = id;dx[0][y2 + 25][x2 - 6] = id;
		dx[0][y2 + 25][x2 - 5] = id;dx[0][y2 + 25][x2 - 4] = id;dx[0][y2 + 25][x2 - 3] = id;dx[0][y2 + 25][x2 - 2] = id;dx[0][y2 + 25][x2 - 1] = id;dx[0][y2 + 25][x2 + 0] = id;dx[0][y2 + 25][x2 + 1] = id;dx[0][y2 + 25][x2 + 2] = id;dx[0][y2 + 25][x2 + 3] = id;
		dx[0][y2 + 25][x2 + 4] = id;dx[0][y2 + 25][x2 + 5] = id;dx[0][y2 + 25][x2 + 6] = id;dx[0][y2 + 25][x2 + 7] = id;dx[0][y2 + 25][x2 + 8] = id;dx[0][y2 + 25][x2 + 9] = id;dx[0][y2 + 25][x2 + 10] = id;dx[0][y2 + 25][x2 + 11] = id;dx[0][y2 + 25][x2 + 12] = id;
		dx[0][y2 + 25][x2 + 27] = id;dx[0][y2 + 25][x2 + 31] = id;dx[0][y2 + 25][x2 + 32] = id;dx[0][y2 + 25][x2 + 33] = id;dx[0][y2 + 25][x2 + 34] = id;dx[0][y2 + 25][x2 + 35] = id;dx[0][y2 + 25][x2 + 36] = id;dx[0][y2 + 25][x2 + 37] = id;dx[0][y2 + 25][x2 + 38] = id;
		dx[0][y2 + 25][x2 + 39] = id;dx[0][y2 + 25][x2 + 40] = id;dx[0][y2 + 25][x2 + 41] = id;dx[0][y2 + 25][x2 + 42] = id;dx[0][y2 + 25][x2 + 43] = id;dx[0][y2 + 25][x2 + 44] = id;dx[0][y2 + 25][x2 + 45] = id;dx[0][y2 + 25][x2 + 46] = id;dx[0][y2 + 25][x2 + 47] = id;
		dx[0][y2 + 25][x2 + 48] = id;dx[0][y2 + 25][x2 + 49] = id;dx[0][y2 + 25][x2 + 50] = id;dx[0][y2 + 26][x2 - 22] = id;dx[0][y2 + 26][x2 - 21] = id;dx[0][y2 + 26][x2 - 15] = id;dx[0][y2 + 26][x2 - 14] = id;dx[0][y2 + 26][x2 - 13] = id;dx[0][y2 + 26][x2 - 12] = id;
		dx[0][y2 + 26][x2 - 11] = id;dx[0][y2 + 26][x2 - 10] = id;dx[0][y2 + 26][x2 - 9] = id;dx[0][y2 + 26][x2 - 8] = id;dx[0][y2 + 26][x2 - 7] = id;dx[0][y2 + 26][x2 - 6] = id;dx[0][y2 + 26][x2 - 5] = id;dx[0][y2 + 26][x2 - 4] = id;dx[0][y2 + 26][x2 - 3] = id;
		dx[0][y2 + 26][x2 - 2] = id;dx[0][y2 + 26][x2 - 1] = id;dx[0][y2 + 26][x2 + 0] = id;dx[0][y2 + 26][x2 + 1] = id;dx[0][y2 + 26][x2 + 2] = id;dx[0][y2 + 26][x2 + 3] = id;dx[0][y2 + 26][x2 + 4] = id;dx[0][y2 + 26][x2 + 5] = id;dx[0][y2 + 26][x2 + 6] = id;
		dx[0][y2 + 26][x2 + 7] = id;dx[0][y2 + 26][x2 + 8] = id;dx[0][y2 + 26][x2 + 9] = id;dx[0][y2 + 26][x2 + 10] = id;dx[0][y2 + 26][x2 + 11] = id;dx[0][y2 + 26][x2 + 12] = id;dx[0][y2 + 26][x2 + 13] = id;dx[0][y2 + 26][x2 + 14] = id;dx[0][y2 + 26][x2 + 15] = id;
		dx[0][y2 + 26][x2 + 16] = id;dx[0][y2 + 26][x2 + 27] = id;dx[0][y2 + 26][x2 + 31] = id;dx[0][y2 + 26][x2 + 32] = id;dx[0][y2 + 26][x2 + 39] = id;dx[0][y2 + 26][x2 + 40] = id;dx[0][y2 + 26][x2 + 41] = id;dx[0][y2 + 26][x2 + 42] = id;dx[0][y2 + 26][x2 + 49] = id;
		dx[0][y2 + 26][x2 + 50] = id;dx[0][y2 + 27][x2 - 22] = id;dx[0][y2 + 27][x2 - 21] = id;dx[0][y2 + 27][x2 - 18] = id;dx[0][y2 + 27][x2 - 17] = id;dx[0][y2 + 27][x2 - 16] = id;dx[0][y2 + 27][x2 - 15] = id;dx[0][y2 + 27][x2 - 14] = id;dx[0][y2 + 27][x2 - 13] = id;
		dx[0][y2 + 27][x2 - 12] = id;dx[0][y2 + 27][x2 - 11] = id;dx[0][y2 + 27][x2 - 10] = id;dx[0][y2 + 27][x2 - 9] = id;dx[0][y2 + 27][x2 - 8] = id;dx[0][y2 + 27][x2 - 7] = id;dx[0][y2 + 27][x2 - 6] = id;dx[0][y2 + 27][x2 - 5] = id;dx[0][y2 + 27][x2 - 4] = id;
		dx[0][y2 + 27][x2 - 3] = id;dx[0][y2 + 27][x2 - 2] = id;dx[0][y2 + 27][x2 - 1] = id;dx[0][y2 + 27][x2 + 0] = id;dx[0][y2 + 27][x2 + 1] = id;dx[0][y2 + 27][x2 + 2] = id;dx[0][y2 + 27][x2 + 3] = id;dx[0][y2 + 27][x2 + 4] = id;dx[0][y2 + 27][x2 + 5] = id;
		dx[0][y2 + 27][x2 + 6] = id;dx[0][y2 + 27][x2 + 7] = id;dx[0][y2 + 27][x2 + 8] = id;dx[0][y2 + 27][x2 + 9] = id;dx[0][y2 + 27][x2 + 10] = id;dx[0][y2 + 27][x2 + 11] = id;dx[0][y2 + 27][x2 + 12] = id;dx[0][y2 + 27][x2 + 13] = id;dx[0][y2 + 27][x2 + 14] = id;
		dx[0][y2 + 27][x2 + 15] = id;dx[0][y2 + 27][x2 + 16] = id;dx[0][y2 + 27][x2 + 17] = id;dx[0][y2 + 27][x2 + 18] = id;dx[0][y2 + 27][x2 + 27] = id;dx[0][y2 + 27][x2 + 31] = id;dx[0][y2 + 27][x2 + 32] = id;dx[0][y2 + 27][x2 + 39] = id;dx[0][y2 + 27][x2 + 40] = id;
		dx[0][y2 + 27][x2 + 41] = id;dx[0][y2 + 27][x2 + 42] = id;dx[0][y2 + 27][x2 + 49] = id;dx[0][y2 + 27][x2 + 50] = id;dx[0][y2 + 28][x2 - 22] = id;dx[0][y2 + 28][x2 - 21] = id;dx[0][y2 + 28][x2 - 18] = id;dx[0][y2 + 28][x2 - 17] = id;dx[0][y2 + 28][x2 - 16] = id;
		dx[0][y2 + 28][x2 + 16] = id;dx[0][y2 + 28][x2 + 17] = id;dx[0][y2 + 28][x2 + 18] = id;dx[0][y2 + 28][x2 + 27] = id;dx[0][y2 + 28][x2 + 31] = id;dx[0][y2 + 28][x2 + 32] = id;dx[0][y2 + 28][x2 + 39] = id;dx[0][y2 + 28][x2 + 40] = id;dx[0][y2 + 28][x2 + 41] = id;
		dx[0][y2 + 28][x2 + 42] = id;dx[0][y2 + 28][x2 + 49] = id;dx[0][y2 + 28][x2 + 50] = id;dx[0][y2 + 29][x2 - 22] = id;dx[0][y2 + 29][x2 - 21] = id;dx[0][y2 + 29][x2 - 18] = id;dx[0][y2 + 29][x2 - 17] = id;dx[0][y2 + 29][x2 - 16] = id;dx[0][y2 + 29][x2 + 16] = id;
		dx[0][y2 + 29][x2 + 17] = id;dx[0][y2 + 29][x2 + 18] = id;dx[0][y2 + 29][x2 + 27] = id;dx[0][y2 + 29][x2 + 31] = id;dx[0][y2 + 29][x2 + 32] = id;dx[0][y2 + 29][x2 + 33] = id;dx[0][y2 + 29][x2 + 34] = id;dx[0][y2 + 29][x2 + 35] = id;dx[0][y2 + 29][x2 + 36] = id;
		dx[0][y2 + 29][x2 + 37] = id;dx[0][y2 + 29][x2 + 38] = id;dx[0][y2 + 29][x2 + 39] = id;dx[0][y2 + 29][x2 + 40] = id;dx[0][y2 + 29][x2 + 41] = id;dx[0][y2 + 29][x2 + 42] = id;dx[0][y2 + 29][x2 + 43] = id;dx[0][y2 + 29][x2 + 44] = id;dx[0][y2 + 29][x2 + 45] = id;
		dx[0][y2 + 29][x2 + 46] = id;dx[0][y2 + 29][x2 + 47] = id;dx[0][y2 + 29][x2 + 48] = id;dx[0][y2 + 29][x2 + 49] = id;dx[0][y2 + 29][x2 + 50] = id;dx[0][y2 + 30][x2 - 22] = id;dx[0][y2 + 30][x2 - 21] = id;dx[0][y2 + 30][x2 - 18] = id;dx[0][y2 + 30][x2 - 17] = id;
		dx[0][y2 + 30][x2 - 16] = id;dx[0][y2 + 30][x2 + 16] = id;dx[0][y2 + 30][x2 + 17] = id;dx[0][y2 + 30][x2 + 18] = id;dx[0][y2 + 30][x2 + 27] = id;dx[0][y2 + 30][x2 + 31] = id;dx[0][y2 + 30][x2 + 32] = id;dx[0][y2 + 30][x2 + 33] = id;dx[0][y2 + 30][x2 + 34] = id;
		dx[0][y2 + 30][x2 + 35] = id;dx[0][y2 + 30][x2 + 36] = id;dx[0][y2 + 30][x2 + 37] = id;dx[0][y2 + 30][x2 + 38] = id;dx[0][y2 + 30][x2 + 39] = id;dx[0][y2 + 30][x2 + 40] = id;dx[0][y2 + 30][x2 + 41] = id;dx[0][y2 + 30][x2 + 42] = id;dx[0][y2 + 30][x2 + 43] = id;
		dx[0][y2 + 30][x2 + 44] = id;dx[0][y2 + 30][x2 + 45] = id;dx[0][y2 + 30][x2 + 46] = id;dx[0][y2 + 30][x2 + 47] = id;dx[0][y2 + 30][x2 + 48] = id;dx[0][y2 + 30][x2 + 49] = id;dx[0][y2 + 30][x2 + 50] = id;dx[0][y2 + 31][x2 - 22] = id;dx[0][y2 + 31][x2 - 21] = id;
		dx[0][y2 + 31][x2 - 18] = id;dx[0][y2 + 31][x2 - 17] = id;dx[0][y2 + 31][x2 - 16] = id;dx[0][y2 + 31][x2 + 16] = id;dx[0][y2 + 31][x2 + 17] = id;dx[0][y2 + 31][x2 + 18] = id;dx[0][y2 + 31][x2 + 27] = id;dx[0][y2 + 31][x2 + 31] = id;dx[0][y2 + 31][x2 + 32] = id;
		dx[0][y2 + 31][x2 + 33] = id;dx[0][y2 + 31][x2 + 34] = id;dx[0][y2 + 31][x2 + 35] = id;dx[0][y2 + 31][x2 + 36] = id;dx[0][y2 + 31][x2 + 37] = id;dx[0][y2 + 31][x2 + 38] = id;dx[0][y2 + 31][x2 + 39] = id;dx[0][y2 + 31][x2 + 40] = id;dx[0][y2 + 31][x2 + 41] = id;
		dx[0][y2 + 31][x2 + 42] = id;dx[0][y2 + 31][x2 + 43] = id;dx[0][y2 + 31][x2 + 44] = id;dx[0][y2 + 31][x2 + 45] = id;dx[0][y2 + 31][x2 + 46] = id;dx[0][y2 + 31][x2 + 47] = id;dx[0][y2 + 31][x2 + 48] = id;dx[0][y2 + 31][x2 + 49] = id;dx[0][y2 + 31][x2 + 50] = id;
		dx[0][y2 + 32][x2 - 22] = id;dx[0][y2 + 32][x2 - 21] = id;dx[0][y2 + 32][x2 - 18] = id;dx[0][y2 + 32][x2 - 17] = id;dx[0][y2 + 32][x2 - 16] = id;dx[0][y2 + 32][x2 + 16] = id;dx[0][y2 + 32][x2 + 17] = id;dx[0][y2 + 32][x2 + 18] = id;dx[0][y2 + 32][x2 + 27] = id;
		dx[0][y2 + 32][x2 + 31] = id;dx[0][y2 + 32][x2 + 32] = id;dx[0][y2 + 32][x2 + 33] = id;dx[0][y2 + 32][x2 + 34] = id;dx[0][y2 + 32][x2 + 35] = id;dx[0][y2 + 32][x2 + 36] = id;dx[0][y2 + 32][x2 + 37] = id;dx[0][y2 + 32][x2 + 38] = id;dx[0][y2 + 32][x2 + 39] = id;
		dx[0][y2 + 32][x2 + 40] = id;dx[0][y2 + 32][x2 + 41] = id;dx[0][y2 + 32][x2 + 42] = id;dx[0][y2 + 32][x2 + 43] = id;dx[0][y2 + 32][x2 + 44] = id;dx[0][y2 + 32][x2 + 45] = id;dx[0][y2 + 32][x2 + 46] = id;dx[0][y2 + 32][x2 + 47] = id;dx[0][y2 + 32][x2 + 48] = id;
		dx[0][y2 + 32][x2 + 49] = id;dx[0][y2 + 32][x2 + 50] = id;dx[0][y2 + 33][x2 - 22] = id;dx[0][y2 + 33][x2 - 21] = id;dx[0][y2 + 33][x2 - 19] = id;dx[0][y2 + 33][x2 - 18] = id;dx[0][y2 + 33][x2 - 17] = id;dx[0][y2 + 33][x2 - 16] = id;dx[0][y2 + 33][x2 + 16] = id;
		dx[0][y2 + 33][x2 + 17] = id;dx[0][y2 + 33][x2 + 18] = id;dx[0][y2 + 33][x2 + 19] = id;dx[0][y2 + 33][x2 + 20] = id;dx[0][y2 + 33][x2 + 21] = id;dx[0][y2 + 33][x2 + 22] = id;dx[0][y2 + 33][x2 + 23] = id;dx[0][y2 + 33][x2 + 24] = id;dx[0][y2 + 33][x2 + 25] = id;
		dx[0][y2 + 33][x2 + 26] = id;dx[0][y2 + 33][x2 + 27] = id;dx[0][y2 + 33][x2 + 28] = id;dx[0][y2 + 33][x2 + 29] = id;dx[0][y2 + 33][x2 + 30] = id;dx[0][y2 + 33][x2 + 31] = id;dx[0][y2 + 33][x2 + 32] = id;dx[0][y2 + 33][x2 + 33] = id;dx[0][y2 + 33][x2 + 34] = id;
		dx[0][y2 + 33][x2 + 35] = id;dx[0][y2 + 33][x2 + 36] = id;dx[0][y2 + 33][x2 + 37] = id;dx[0][y2 + 33][x2 + 38] = id;dx[0][y2 + 33][x2 + 39] = id;dx[0][y2 + 33][x2 + 40] = id;dx[0][y2 + 33][x2 + 41] = id;dx[0][y2 + 33][x2 + 42] = id;dx[0][y2 + 33][x2 + 43] = id;
		dx[0][y2 + 33][x2 + 44] = id;dx[0][y2 + 33][x2 + 45] = id;dx[0][y2 + 33][x2 + 46] = id;dx[0][y2 + 33][x2 + 47] = id;dx[0][y2 + 33][x2 + 48] = id;dx[0][y2 + 33][x2 + 49] = id;dx[0][y2 + 33][x2 + 50] = id;dx[0][y2 + 34][x2 - 22] = id;dx[0][y2 + 34][x2 - 21] = id;
		dx[0][y2 + 34][x2 - 20] = id;dx[0][y2 + 34][x2 - 19] = id;dx[0][y2 + 34][x2 - 18] = id;dx[0][y2 + 34][x2 - 17] = id;dx[0][y2 + 34][x2 - 16] = id;dx[0][y2 + 34][x2 + 16] = id;dx[0][y2 + 34][x2 + 17] = id;dx[0][y2 + 34][x2 + 18] = id;dx[0][y2 + 34][x2 + 19] = id;
		dx[0][y2 + 34][x2 + 20] = id;dx[0][y2 + 34][x2 + 21] = id;dx[0][y2 + 34][x2 + 22] = id;dx[0][y2 + 34][x2 + 23] = id;dx[0][y2 + 34][x2 + 24] = id;dx[0][y2 + 34][x2 + 25] = id;dx[0][y2 + 34][x2 + 26] = id;dx[0][y2 + 34][x2 + 27] = id;dx[0][y2 + 34][x2 + 28] = id;
		dx[0][y2 + 34][x2 + 29] = id;dx[0][y2 + 34][x2 + 30] = id;dx[0][y2 + 34][x2 + 31] = id;dx[0][y2 + 34][x2 + 32] = id;dx[0][y2 + 34][x2 + 33] = id;dx[0][y2 + 34][x2 + 34] = id;dx[0][y2 + 34][x2 + 35] = id;dx[0][y2 + 34][x2 + 36] = id;dx[0][y2 + 34][x2 + 37] = id;
		dx[0][y2 + 34][x2 + 38] = id;dx[0][y2 + 34][x2 + 39] = id;dx[0][y2 + 34][x2 + 40] = id;dx[0][y2 + 34][x2 + 41] = id;dx[0][y2 + 34][x2 + 42] = id;dx[0][y2 + 34][x2 + 43] = id;dx[0][y2 + 34][x2 + 44] = id;dx[0][y2 + 34][x2 + 45] = id;dx[0][y2 + 34][x2 + 46] = id;
		dx[0][y2 + 34][x2 + 47] = id;dx[0][y2 + 34][x2 + 48] = id;dx[0][y2 + 34][x2 + 49] = id;dx[0][y2 + 34][x2 + 50] = id;dx[0][y2 + 35][x2 - 22] = id;dx[0][y2 + 35][x2 - 21] = id;dx[0][y2 + 35][x2 - 20] = id;dx[0][y2 + 35][x2 - 19] = id;dx[0][y2 + 35][x2 - 18] = id;
		dx[0][y2 + 35][x2 - 17] = id;dx[0][y2 + 35][x2 - 16] = id;dx[0][y2 + 35][x2 - 15] = id;dx[0][y2 + 35][x2 - 14] = id;dx[0][y2 + 35][x2 - 13] = id;dx[0][y2 + 35][x2 - 12] = id;dx[0][y2 + 35][x2 - 11] = id;dx[0][y2 + 35][x2 - 10] = id;dx[0][y2 + 35][x2 - 9] = id;
		dx[0][y2 + 35][x2 - 8] = id;dx[0][y2 + 35][x2 - 7] = id;dx[0][y2 + 35][x2 - 6] = id;dx[0][y2 + 35][x2 - 5] = id;dx[0][y2 + 35][x2 - 4] = id;dx[0][y2 + 35][x2 - 3] = id;dx[0][y2 + 35][x2 - 2] = id;dx[0][y2 + 35][x2 - 1] = id;dx[0][y2 + 35][x2 + 0] = id;
		dx[0][y2 + 35][x2 + 1] = id;dx[0][y2 + 35][x2 + 2] = id;dx[0][y2 + 35][x2 + 3] = id;dx[0][y2 + 35][x2 + 4] = id;dx[0][y2 + 35][x2 + 5] = id;dx[0][y2 + 35][x2 + 6] = id;dx[0][y2 + 35][x2 + 7] = id;dx[0][y2 + 35][x2 + 8] = id;dx[0][y2 + 35][x2 + 9] = id;
		dx[0][y2 + 35][x2 + 10] = id;dx[0][y2 + 35][x2 + 11] = id;dx[0][y2 + 35][x2 + 12] = id;dx[0][y2 + 35][x2 + 13] = id;dx[0][y2 + 35][x2 + 14] = id;dx[0][y2 + 35][x2 + 15] = id;dx[0][y2 + 35][x2 + 16] = id;dx[0][y2 + 35][x2 + 17] = id;dx[0][y2 + 35][x2 + 18] = id;
		dx[0][y2 + 35][x2 + 19] = id;dx[0][y2 + 35][x2 + 20] = id;dx[0][y2 + 35][x2 + 21] = id;dx[0][y2 + 35][x2 + 22] = id;dx[0][y2 + 35][x2 + 23] = id;dx[0][y2 + 35][x2 + 24] = id;dx[0][y2 + 35][x2 + 25] = id;dx[0][y2 + 35][x2 + 26] = id;dx[0][y2 + 35][x2 + 27] = id;
		dx[0][y2 + 35][x2 + 28] = id;dx[0][y2 + 35][x2 + 29] = id;dx[0][y2 + 35][x2 + 30] = id;dx[0][y2 + 35][x2 + 31] = id;dx[0][y2 + 35][x2 + 32] = id;dx[0][y2 + 35][x2 + 33] = id;dx[0][y2 + 35][x2 + 34] = id;dx[0][y2 + 35][x2 + 35] = id;dx[0][y2 + 35][x2 + 36] = id;
		dx[0][y2 + 35][x2 + 37] = id;dx[0][y2 + 35][x2 + 38] = id;dx[0][y2 + 35][x2 + 39] = id;dx[0][y2 + 35][x2 + 40] = id;dx[0][y2 + 35][x2 + 41] = id;dx[0][y2 + 35][x2 + 42] = id;dx[0][y2 + 35][x2 + 43] = id;dx[0][y2 + 35][x2 + 44] = id;dx[0][y2 + 35][x2 + 45] = id;
		dx[0][y2 + 35][x2 + 46] = id;dx[0][y2 + 35][x2 + 47] = id;dx[0][y2 + 35][x2 + 48] = id;dx[0][y2 + 35][x2 + 49] = id;dx[0][y2 + 35][x2 + 50] = id;
		visualt(1, x1, y1, "flag");

	}
	else {}
}

int swing(int a1, int a2,int *diff) 
{//a2为时序点，a1为目前所在点
	int a=0,step;
	if (a2 > a1) { step = 9 - a2 + a1; }
	else step = a1 - a2;
	switch (step)
	{
	case 0:a = 0;break;
	case 1:
		if (rand() > 49){a = 2;*diff = 1;}
		else { a = 3; }

		break;
	case 2:if (*diff > 1) { *diff = 0;a = 2; }
		   else a = 2;
		break;
	case 3:a = 0;break;
	case 4:a = -2;break;
	case 5:if (rand() > 49) { a = -2;*diff = 1; }
		   else { a = -3; }break;
	case 6:if (*diff > 1) { *diff = 0;a = -4; }
		   else a = -3;break;
	case 7:a = -2;break;
	case 8:break;
	
	default:return 0;
	}
	return a;
}

void Flag(int x1, int y1,int amount ,int ric)
{
	
	int diff=0;
	int x2 = x1;
	int y2 = y1;
	x2 = x2 + 30 + 30;

	y2 = 600 - y2;
	int id = 15;

	int a,step;
	int fst;
	if(fstep[amount]<64)fst = fstep[amount] / 6;

	switch (ric)
	{
	case 3:
		y2 += 2;


		step = swing(0, fst, &diff);
		dx[2][y2 + 10][x2 - 35 + step] = id;
		dx[2][y2 + 10][x2 - 28 + step] = id;
		step = swing(1, fst, &diff);
		for (a = 0;a < 12;a++)
		{
			dx[2][y2 + 11][x2 - 37 + a + step] = id;
		}
		step = swing(2, fst, &diff);
		for (a = 0;a < 10;a++)
		{
			dx[2][y2 + 12][x2 - 36 + a + step] = id;
		}
		step = swing(3, fst, &diff);
		for (a = 0;a < 10;a++)
		{
			dx[2][y2 + 13][x2 - 36 + a + step] = id;
		}
		step = swing(4, fst, &diff);
		for (a = 0;a < 8;a++)
		{
			dx[2][y2 + 14][x2 - 35 + a + step] = id;
		}
		step = swing(5, fst, &diff);
		for (a = 0;a < 6;a++)
		{
			dx[2][y2 + 15][x2 - 34 + a + step] = id;

		}
		step = swing(6, fst, &diff);
		for (a = 0;a < 4;a++)
		{
			dx[2][y2 + 16][x2 - 33 + a + step] = id;
		}
		step = swing(7, fst, &diff);
		for (a = 0;a < 2;a++)
		{
			dx[2][y2 + 17][x2 - 32 + a + step] = id;
		}
		step = swing(8, fst, &diff);
		for (a = 0;a < 2;a++)
		{
			dx[2][y2 + 18][x2 - 32 + a + step] = id;
		}

		if (++fstep[amount] > 48)fstep[amount] = 0;//当前步数时序运行(为8的8倍数)32以后为空静止
		break;
	case 2:
		for (a = 0;a < 12;a++) 
		{  if(a>2)
			step = swing(a,fst,&diff);
		int pz = 0;//偏正
		if (step > 1)pz = -1;
		//if (step < -2) { pz = 1; }
		else step = 0;
			for (int b = 0 + pz;b < 5;b++) 
			{
				dx[2][y2 + b - step][x2 + a] = id;
			}
		}
		
		if (++fstep[amount] > 72)fstep[amount] = 0;//当前步数时序运行(为8的8倍数)32以后为空静止
		break;
	}
}

void thedoor(int x1, int y1) 
{
	x1 = x1 + 30 + 30;

	y1 = 600 - y1;
	int px = cgx - x1;
	int id = 15;
	int x2, y2;
	if (1)
	{
		y2 = y1;
		x2 = x1;
		dx[2][y2 - 9][x2 - 30] = id;dx[2][y2 - 9][x2 - 29] = id;dx[2][y2 - 9][x2 - 28] = id;dx[2][y2 - 9][x2 - 27] = id;dx[2][y2 - 9][x2 - 26] = id;dx[2][y2 - 9][x2 - 25] = id;dx[2][y2 - 9][x2 - 24] = id;dx[2][y2 - 9][x2 - 23] = id;dx[2][y2 - 9][x2 - 22] = id;
		dx[2][y2 - 9][x2 - 21] = id;dx[2][y2 - 9][x2 - 20] = id;dx[2][y2 - 9][x2 - 19] = id;dx[2][y2 - 9][x2 - 18] = id;dx[2][y2 - 9][x2 - 17] = id;dx[2][y2 - 9][x2 - 16] = id;dx[2][y2 - 9][x2 - 15] = id;dx[2][y2 - 9][x2 - 14] = id;dx[2][y2 - 9][x2 - 13] = id;
		dx[2][y2 - 9][x2 - 12] = id;dx[2][y2 - 9][x2 - 11] = id;dx[2][y2 - 9][x2 - 10] = id;dx[2][y2 - 9][x2 - 9] = id;dx[2][y2 - 9][x2 - 8] = id;dx[2][y2 - 9][x2 - 7] = id;dx[2][y2 - 9][x2 - 6] = id;dx[2][y2 - 9][x2 - 5] = id;dx[2][y2 - 9][x2 - 4] = id;
		dx[2][y2 - 9][x2 - 3] = id;dx[2][y2 - 9][x2 - 2] = id;dx[2][y2 - 9][x2 - 1] = id;dx[2][y2 - 9][x2 + 0] = id;dx[2][y2 - 9][x2 + 1] = id;dx[2][y2 - 9][x2 + 2] = id;dx[2][y2 - 9][x2 + 3] = id;dx[2][y2 - 9][x2 + 4] = id;dx[2][y2 - 9][x2 + 5] = id;
		dx[2][y2 - 9][x2 + 6] = id;dx[2][y2 - 9][x2 + 7] = id;dx[2][y2 - 9][x2 + 8] = id;dx[2][y2 - 9][x2 + 9] = id;dx[2][y2 - 9][x2 + 10] = id;dx[2][y2 - 9][x2 + 11] = id;dx[2][y2 - 9][x2 + 12] = id;dx[2][y2 - 9][x2 + 13] = id;dx[2][y2 - 9][x2 + 14] = id;
		dx[2][y2 - 9][x2 + 15] = id;dx[2][y2 - 9][x2 + 16] = id;dx[2][y2 - 9][x2 + 17] = id;dx[2][y2 - 9][x2 + 18] = id;dx[2][y2 - 9][x2 + 19] = id;dx[2][y2 - 9][x2 + 20] = id;dx[2][y2 - 9][x2 + 21] = id;dx[2][y2 - 9][x2 + 22] = id;dx[2][y2 - 9][x2 + 23] = id;
		dx[2][y2 - 9][x2 + 24] = id;dx[2][y2 - 9][x2 + 25] = id;dx[2][y2 - 9][x2 + 26] = id;dx[2][y2 - 9][x2 + 27] = id;dx[2][y2 - 9][x2 + 28] = id;dx[2][y2 - 9][x2 + 29] = id;dx[2][y2 - 9][x2 + 30] = id;dx[2][y2 - 9][x2 + 31] = id;dx[2][y2 - 8][x2 - 30] = id;
		dx[2][y2 - 8][x2 + 0] = id;dx[2][y2 - 8][x2 + 31] = id;dx[2][y2 - 7][x2 - 30] = id;dx[2][y2 - 7][x2 + 0] = id;dx[2][y2 - 7][x2 + 31] = id;dx[2][y2 - 6][x2 - 30] = id;dx[2][y2 - 6][x2 + 0] = id;dx[2][y2 - 6][x2 + 31] = id;dx[2][y2 - 5][x2 - 30] = id;
		dx[2][y2 - 5][x2 + 0] = id;dx[2][y2 - 5][x2 + 31] = id;dx[2][y2 - 4][x2 - 30] = id;dx[2][y2 - 4][x2 + 0] = id;dx[2][y2 - 4][x2 + 31] = id;dx[2][y2 - 3][x2 - 30] = id;dx[2][y2 - 3][x2 + 0] = id;dx[2][y2 - 3][x2 + 31] = id;dx[2][y2 - 2][x2 - 30] = id;
		dx[2][y2 - 2][x2 + 0] = id;dx[2][y2 - 2][x2 + 31] = id;dx[2][y2 - 1][x2 - 30] = id;dx[2][y2 - 1][x2 + 0] = id;dx[2][y2 - 1][x2 + 31] = id;dx[2][y2 + 0][x2 - 30] = id;dx[2][y2 + 0][x2 + 0] = id;dx[2][y2 + 0][x2 + 31] = id;dx[2][y2 + 1][x2 - 30] = id;
		dx[2][y2 + 1][x2 + 31] = id;dx[2][y2 + 2][x2 - 30] = id;dx[2][y2 + 2][x2 + 31] = id;dx[2][y2 + 3][x2 - 30] = id;dx[2][y2 + 3][x2 + 31] = id;dx[2][y2 + 4][x2 - 30] = id;dx[2][y2 + 4][x2 + 31] = id;dx[2][y2 + 5][x2 - 30] = id;dx[2][y2 + 5][x2 + 31] = id;
		dx[2][y2 + 6][x2 - 30] = id;dx[2][y2 + 6][x2 + 31] = id;dx[2][y2 + 7][x2 - 30] = id;dx[2][y2 + 7][x2 + 31] = id;dx[2][y2 + 8][x2 - 30] = id;dx[2][y2 + 8][x2 + 31] = id;dx[2][y2 + 9][x2 - 30] = id;dx[2][y2 + 9][x2 + 31] = id;dx[2][y2 + 10][x2 - 30] = id;
		dx[2][y2 + 10][x2 + 31] = id;dx[2][y2 + 11][x2 - 30] = id;dx[2][y2 + 11][x2 + 31] = id;

	}

	if (px<180&&px>-180) 
	{
		y2 = y1;
		x2 = x1+(int)px/9;
		dx[2][y2 - 6][x2 + 0] = id;dx[2][y2 - 5][x2 - 20] = id;dx[2][y2 - 5][x2 - 19] = id;dx[2][y2 - 5][x2 - 18] = id;dx[2][y2 - 5][x2 - 17] = id;dx[2][y2 - 5][x2 - 16] = id;dx[2][y2 - 5][x2 - 15] = id;dx[2][y2 - 5][x2 - 14] = id;dx[2][y2 - 5][x2 - 13] = id;
		dx[2][y2 - 5][x2 - 12] = id;dx[2][y2 - 5][x2 - 11] = id;dx[2][y2 - 5][x2 - 10] = id;dx[2][y2 - 5][x2 - 9] = id;dx[2][y2 - 5][x2 - 8] = id;dx[2][y2 - 5][x2 - 7] = id;dx[2][y2 - 5][x2 - 6] = id;dx[2][y2 - 5][x2 - 5] = id;dx[2][y2 - 5][x2 - 4] = id;
		dx[2][y2 - 5][x2 - 3] = id;dx[2][y2 - 5][x2 - 2] = id;dx[2][y2 - 5][x2 - 1] = id;dx[2][y2 - 5][x2 + 0] = id;dx[2][y2 - 5][x2 + 1] = id;dx[2][y2 - 5][x2 + 2] = id;dx[2][y2 - 5][x2 + 3] = id;dx[2][y2 - 5][x2 + 4] = id;dx[2][y2 - 5][x2 + 5] = id;
		dx[2][y2 - 5][x2 + 6] = id;dx[2][y2 - 5][x2 + 7] = id;dx[2][y2 - 5][x2 + 8] = id;dx[2][y2 - 5][x2 + 9] = id;dx[2][y2 - 5][x2 + 10] = id;dx[2][y2 - 5][x2 + 11] = id;dx[2][y2 - 5][x2 + 12] = id;dx[2][y2 - 5][x2 + 13] = id;dx[2][y2 - 5][x2 + 14] = id;
		dx[2][y2 - 5][x2 + 15] = id;dx[2][y2 - 5][x2 + 16] = id;dx[2][y2 - 5][x2 + 17] = id;dx[2][y2 - 5][x2 + 18] = id;dx[2][y2 - 5][x2 + 19] = id;dx[2][y2 - 5][x2 + 20] = id;dx[2][y2 - 4][x2 - 20] = id;dx[2][y2 - 4][x2 + 0] = id;dx[2][y2 - 4][x2 + 20] = id;
		dx[2][y2 - 3][x2 - 20] = id;dx[2][y2 - 3][x2 + 0] = id;dx[2][y2 - 3][x2 + 20] = id;dx[2][y2 - 2][x2 - 20] = id;dx[2][y2 - 2][x2 + 0] = id;dx[2][y2 - 2][x2 + 20] = id;dx[2][y2 - 1][x2 - 20] = id;dx[2][y2 - 1][x2 + 20] = id;dx[2][y2 + 0][x2 - 20] = id;
		dx[2][y2 + 0][x2 + 20] = id;dx[2][y2 + 1][x2 - 20] = id;dx[2][y2 + 1][x2 + 20] = id;dx[2][y2 + 2][x2 - 20] = id;dx[2][y2 + 2][x2 + 20] = id;dx[2][y2 + 3][x2 - 20] = id;dx[2][y2 + 3][x2 + 20] = id;dx[2][y2 + 4][x2 - 20] = id;dx[2][y2 + 4][x2 + 20] = id;
		dx[2][y2 + 5][x2 - 20] = id;dx[2][y2 + 5][x2 + 20] = id;dx[2][y2 + 6][x2 - 20] = id;dx[2][y2 + 6][x2 + 20] = id;dx[2][y2 + 7][x2 - 20] = id;dx[2][y2 + 7][x2 + 20] = id;dx[2][y2 + 8][x2 - 20] = id;dx[2][y2 + 8][x2 + 20] = id;dx[2][y2 + 9][x2 - 20] = id;
		dx[2][y2 + 9][x2 + 20] = id;dx[2][y2 + 10][x2 - 20] = id;dx[2][y2 + 10][x2 + 20] = id;dx[2][y2 + 11][x2 - 20] = id;dx[2][y2 + 11][x2 + 20] = id;
	
		y2 = y1;
		x2 = x1+(int)px/7;
		dx[2][y2 - 1][x2 - 13] = id;dx[2][y2 - 1][x2 - 12] = id;dx[2][y2 - 1][x2 - 11] = id;dx[2][y2 - 1][x2 - 10] = id;dx[2][y2 - 1][x2 - 9] = id;dx[2][y2 - 1][x2 - 8] = id;dx[2][y2 - 1][x2 - 7] = id;dx[2][y2 - 1][x2 - 6] = id;dx[2][y2 - 1][x2 - 5] = id;
		dx[2][y2 - 1][x2 - 4] = id;dx[2][y2 - 1][x2 - 3] = id;dx[2][y2 - 1][x2 - 2] = id;dx[2][y2 - 1][x2 - 1] = id;dx[2][y2 - 1][x2 + 0] = id;dx[2][y2 - 1][x2 + 1] = id;dx[2][y2 - 1][x2 + 2] = id;dx[2][y2 - 1][x2 + 3] = id;dx[2][y2 - 1][x2 + 4] = id;
		dx[2][y2 - 1][x2 + 5] = id;dx[2][y2 - 1][x2 + 6] = id;dx[2][y2 - 1][x2 + 7] = id;dx[2][y2 - 1][x2 + 8] = id;dx[2][y2 - 1][x2 + 9] = id;dx[2][y2 - 1][x2 + 10] = id;dx[2][y2 - 1][x2 + 11] = id;dx[2][y2 - 1][x2 + 12] = id;dx[2][y2 - 1][x2 + 13] = id;
		dx[2][y2 + 0][x2 - 13] = id;dx[2][y2 + 0][x2 + 13] = id;dx[2][y2 + 1][x2 - 13] = id;dx[2][y2 + 1][x2 + 13] = id;dx[2][y2 + 2][x2 - 13] = id;dx[2][y2 + 2][x2 + 13] = id;dx[2][y2 + 3][x2 - 13] = id;dx[2][y2 + 3][x2 + 13] = id;dx[2][y2 + 4][x2 - 13] = id;
		dx[2][y2 + 4][x2 + 13] = id;dx[2][y2 + 5][x2 - 13] = id;dx[2][y2 + 5][x2 + 13] = id;dx[2][y2 + 6][x2 - 13] = id;dx[2][y2 + 6][x2 + 13] = id;dx[2][y2 + 7][x2 - 13] = id;dx[2][y2 + 7][x2 + 13] = id;dx[2][y2 + 8][x2 - 13] = id;dx[2][y2 + 8][x2 + 13] = id;
		dx[2][y2 + 9][x2 - 13] = id;dx[2][y2 + 9][x2 + 13] = id;dx[2][y2 + 10][x2 - 13] = id;dx[2][y2 + 10][x2 + 13] = id;dx[2][y2 + 11][x2 - 13] = id;dx[2][y2 + 11][x2 + 13] = id;
		

	}



}

void water(int x1,int l1,int y1,int l2) 
{
	int id = 水;//id 14
	
}

void fence/*栅栏*/(int x1, int y1, int amount) 
{
	int diff = 0;
	int x2 = x1;
	int y2 = y1;
	x2 = x2 + 30 + 30;

	y2 = 600 - y2;
	int id = 15;

	dx[0][y2 + 2][x2 - 7] = 16;dx[0][y2 + 2][x2 - 6] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 1] = id;
	dx[0][y2 + 2][x2 + 7] = id;dx[0][y2 + 3][x2 - 7] = 16;dx[0][y2 + 3][x2 - 6] = id;dx[0][y2 + 3][x2 + 0] = id;
	dx[0][y2 + 3][x2 + 1] = id;dx[0][y2 + 3][x2 + 7] = id;dx[0][y2 + 4][x2 - 7] = 16;dx[0][y2 + 4][x2 - 6] = id;
	dx[0][y2 + 4][x2 - 5] = id;dx[0][y2 + 4][x2 - 4] = id;dx[0][y2 + 4][x2 - 3] = id;dx[0][y2 + 4][x2 - 2] = id;
	dx[0][y2 + 4][x2 - 1] = id;dx[0][y2 + 4][x2 + 0] = id;dx[0][y2 + 4][x2 + 1] = id;dx[0][y2 + 4][x2 + 2] = id;
	dx[0][y2 + 4][x2 + 3] = id;dx[0][y2 + 4][x2 + 4] = id;dx[0][y2 + 4][x2 + 5] = id;dx[0][y2 + 4][x2 + 6] = id;
	dx[0][y2 + 4][x2 + 7] = id;dx[0][y2 + 5][x2 - 7] = 16;dx[0][y2 + 5][x2 - 1] = id;dx[0][y2 + 5][x2 + 0] = id;
	dx[0][y2 + 5][x2 + 6] = id;dx[0][y2 + 5][x2 + 7] = id;dx[0][y2 + 6][x2 - 7] = 16;
	dx[0][y2 + 6][x2 - 1] = id;dx[0][y2 + 6][x2 + 0] = id;dx[0][y2 + 6][x2 + 6] = id;dx[0][y2 + 6][x2 + 7] = id;

	int bout;

	for (bout=7;amount > 0;amount--,bout+=7)
	{
		dx[0][y2 + 2][x2 - 7] = id;dx[0][y2 + 2][x2 - 6] = id;dx[0][y2 + 2][x2 + bout + 0] = id;dx[0][y2 + 2][x2 + bout + 1] = id;
		dx[0][y2 + 2][x2 + bout + 7] = id;dx[0][y2 + 3][x2 - 7] = id;dx[0][y2 + 3][x2 - 6] = id;dx[0][y2 + 3][x2 + bout + 0] = id;
		dx[0][y2 + 3][x2 + bout + 1] = id;dx[0][y2 + 3][x2 + bout + 7] = id;dx[0][y2 + 4][x2 - 7] = id;dx[0][y2 + 4][x2 - 6] = id;
		dx[0][y2 + 4][x2 - 5] = id;dx[0][y2 + 4][x2 - 4] = id;dx[0][y2 + 4][x2 - 3] = id;dx[0][y2 + 4][x2 - 2] = id;
		dx[0][y2 + 4][x2 - 1] = id;dx[0][y2 + 4][x2 + bout + 0] = id;dx[0][y2 + 4][x2 + bout + 1] = id;dx[0][y2 + 4][x2 + bout + 2] = id;
		dx[0][y2 + 4][x2 + bout + 3] = id;dx[0][y2 + 4][x2 + bout + 4] = id;dx[0][y2 + 4][x2 + bout + 5] = id;dx[0][y2 + 4][x2 + bout + 6] = id;
		dx[0][y2 + 4][x2 + bout + 7] = id;dx[0][y2 + 5][x2 - 7] = id;dx[0][y2 + 5][x2 - 1] = id;dx[0][y2 + 5][x2 + bout + 0] = id;
		dx[0][y2 + 5][x2 + bout + 6] = id;dx[0][y2 + 5][x2 + bout + 7] = id;dx[0][y2 + 6][x2 - 7] = id;
		dx[0][y2 + 6][x2 - 1] = id;dx[0][y2 + 6][x2 + bout + 0] = id;dx[0][y2 + 6][x2 + bout + 6] = id;dx[0][y2 + 6][x2 + bout + 7] = id;
	}
	




	dx[0][y2 + 2][x2 - 7] = id;dx[0][y2 + 2][x2 - 6] = id;dx[0][y2 + 2][x2 + bout + 0] = id;dx[0][y2 + 2][x2 + bout + 1] = id;
	dx[0][y2 + 2][x2 + bout + 7] = 16;dx[0][y2 + 3][x2 - 7] = id;dx[0][y2 + 3][x2 - 6] = id;dx[0][y2 + 3][x2 + bout + 0] = id;
	dx[0][y2 + 3][x2 + bout + 1] = id;dx[0][y2 + 3][x2 + bout + 7] = 16;dx[0][y2 + 4][x2 - 7] = id;dx[0][y2 + 4][x2 - 6] = id;
	dx[0][y2 + 4][x2 - 5] = id;dx[0][y2 + 4][x2 - 4] = id;dx[0][y2 + 4][x2 - 3] = id;dx[0][y2 + 4][x2 - 2] = id;
	dx[0][y2 + 4][x2 - 1] = id;dx[0][y2 + 4][x2 + bout + 0] = id;dx[0][y2 + 4][x2 + bout + 1] = id;dx[0][y2 + 4][x2 + bout + 2] = id;
	dx[0][y2 + 4][x2 + bout + 3] = id;dx[0][y2 + 4][x2 + bout + 4] = id;dx[0][y2 + 4][x2 + bout + 5] = id;dx[0][y2 + 4][x2 + bout + 6] = id;
	dx[0][y2 + 4][x2 + bout + 7] = 16;dx[0][y2 + 5][x2 - 7] = id;dx[0][y2 + 5][x2 - 1] = id;dx[0][y2 + 5][x2 + bout + 0] = id;
	dx[0][y2 + 5][x2 + bout + 6] = id;dx[0][y2 + 5][x2 + bout + 7] = 16;dx[0][y2 + 6][x2 - 7] = id;
	dx[0][y2 + 6][x2 - 1] = id;dx[0][y2 + 6][x2 + bout + 0] = id;dx[0][y2 + 6][x2 + bout + 6] = id;dx[0][y2 + 6][x2 + bout + 7] = 16;
}

void kamihouse(int x1, int y1 )
{
	int id = 15;
	int x2 = x1 + 30 + 30;

	int y2 = 600 - y1;
	dx[0][y2 - 21][x2 - 2] = id;dx[0][y2 - 21][x2 - 1] = id;dx[0][y2 - 21][x2 + 0] = id;dx[0][y2 - 21][x2 + 1] = id;dx[0][y2 - 21][x2 + 2] = id;dx[0][y2 - 20][x2 - 4] = id;dx[0][y2 - 20][x2 - 3] = id;dx[0][y2 - 20][x2 + 0] = id;dx[0][y2 - 20][x2 + 3] = id;
	dx[0][y2 - 20][x2 + 4] = id;dx[0][y2 - 19][x2 - 7] = id;dx[0][y2 - 19][x2 - 6] = id;dx[0][y2 - 19][x2 - 5] = id;dx[0][y2 - 19][x2 + 0] = id;dx[0][y2 - 19][x2 + 5] = id;dx[0][y2 - 19][x2 + 6] = id;dx[0][y2 - 18][x2 - 9] = id;dx[0][y2 - 18][x2 - 8] = id;
	dx[0][y2 - 18][x2 + 0] = id;dx[0][y2 - 18][x2 + 7] = id;dx[0][y2 - 18][x2 + 8] = id;dx[0][y2 - 17][x2 - 11] = id;dx[0][y2 - 17][x2 - 10] = id;dx[0][y2 - 17][x2 + 0] = id;dx[0][y2 - 17][x2 + 9] = id;dx[0][y2 - 17][x2 + 10] = id;dx[0][y2 - 16][x2 - 20] = id;
	dx[0][y2 - 16][x2 - 19] = id;dx[0][y2 - 16][x2 - 18] = id;dx[0][y2 - 16][x2 - 17] = id;dx[0][y2 - 16][x2 - 16] = id;dx[0][y2 - 16][x2 - 15] = id;dx[0][y2 - 16][x2 - 14] = id;dx[0][y2 - 16][x2 - 13] = id;dx[0][y2 - 16][x2 - 12] = id;dx[0][y2 - 16][x2 + 0] = id;
	dx[0][y2 - 16][x2 + 11] = id;dx[0][y2 - 16][x2 + 12] = id;dx[0][y2 - 16][x2 + 13] = id;dx[0][y2 - 16][x2 + 14] = id;dx[0][y2 - 16][x2 + 15] = id;dx[0][y2 - 16][x2 + 16] = id;dx[0][y2 - 16][x2 + 17] = id;dx[0][y2 - 16][x2 + 18] = id;dx[0][y2 - 16][x2 + 19] = id;
	dx[0][y2 - 15][x2 - 28] = id;dx[0][y2 - 15][x2 - 27] = id;dx[0][y2 - 15][x2 - 26] = id;dx[0][y2 - 15][x2 - 25] = id;dx[0][y2 - 15][x2 - 24] = id;dx[0][y2 - 15][x2 - 23] = id;dx[0][y2 - 15][x2 - 22] = id;dx[0][y2 - 15][x2 - 21] = id;dx[0][y2 - 15][x2 - 12] = id;
	dx[0][y2 - 15][x2 + 0] = id;dx[0][y2 - 15][x2 + 11] = id;dx[0][y2 - 15][x2 + 20] = id;dx[0][y2 - 15][x2 + 21] = id;dx[0][y2 - 15][x2 + 22] = id;dx[0][y2 - 15][x2 + 23] = id;dx[0][y2 - 15][x2 + 24] = id;dx[0][y2 - 15][x2 + 25] = id;dx[0][y2 - 15][x2 + 26] = id;
	dx[0][y2 - 15][x2 + 27] = id;dx[0][y2 - 15][x2 + 28] = id;dx[0][y2 - 14][x2 - 29] = id;dx[0][y2 - 14][x2 - 28] = id;dx[0][y2 - 14][x2 - 27] = id;dx[0][y2 - 14][x2 - 26] = id;dx[0][y2 - 14][x2 - 25] = id;dx[0][y2 - 14][x2 - 24] = id;dx[0][y2 - 14][x2 - 23] = id;
	dx[0][y2 - 14][x2 - 22] = id;dx[0][y2 - 14][x2 - 21] = id;dx[0][y2 - 14][x2 - 20] = id;dx[0][y2 - 14][x2 - 19] = id;dx[0][y2 - 14][x2 - 18] = id;dx[0][y2 - 14][x2 - 17] = id;dx[0][y2 - 14][x2 - 16] = id;dx[0][y2 - 14][x2 - 15] = id;dx[0][y2 - 14][x2 - 14] = id;
	dx[0][y2 - 14][x2 - 13] = id;dx[0][y2 - 14][x2 - 12] = id;dx[0][y2 - 14][x2 - 11] = id;dx[0][y2 - 14][x2 - 10] = id;dx[0][y2 - 14][x2 - 9] = id;dx[0][y2 - 14][x2 - 8] = id;dx[0][y2 - 14][x2 - 7] = id;dx[0][y2 - 14][x2 - 6] = id;dx[0][y2 - 14][x2 - 5] = id;
	dx[0][y2 - 14][x2 - 4] = id;dx[0][y2 - 14][x2 - 3] = id;dx[0][y2 - 14][x2 - 2] = id;dx[0][y2 - 14][x2 - 1] = id;dx[0][y2 - 14][x2 + 0] = id;dx[0][y2 - 14][x2 + 1] = id;dx[0][y2 - 14][x2 + 2] = id;dx[0][y2 - 14][x2 + 3] = id;dx[0][y2 - 14][x2 + 4] = id;
	dx[0][y2 - 14][x2 + 5] = id;dx[0][y2 - 14][x2 + 6] = id;dx[0][y2 - 14][x2 + 7] = id;dx[0][y2 - 14][x2 + 8] = id;dx[0][y2 - 14][x2 + 9] = id;dx[0][y2 - 14][x2 + 10] = id;dx[0][y2 - 14][x2 + 11] = id;dx[0][y2 - 14][x2 + 12] = id;dx[0][y2 - 14][x2 + 13] = id;
	dx[0][y2 - 14][x2 + 14] = id;dx[0][y2 - 14][x2 + 15] = id;dx[0][y2 - 14][x2 + 16] = id;dx[0][y2 - 14][x2 + 17] = id;dx[0][y2 - 14][x2 + 18] = id;dx[0][y2 - 14][x2 + 19] = id;dx[0][y2 - 14][x2 + 20] = id;dx[0][y2 - 14][x2 + 21] = id;dx[0][y2 - 14][x2 + 22] = id;
	dx[0][y2 - 14][x2 + 23] = id;dx[0][y2 - 14][x2 + 24] = id;dx[0][y2 - 14][x2 + 25] = id;dx[0][y2 - 14][x2 + 26] = id;dx[0][y2 - 14][x2 + 27] = id;dx[0][y2 - 14][x2 + 28] = id;dx[0][y2 - 14][x2 + 29] = id;dx[0][y2 - 13][x2 - 26] = id;dx[0][y2 - 13][x2 - 25] = id;
	dx[0][y2 - 13][x2 - 24] = id;dx[0][y2 - 13][x2 + 24] = id;dx[0][y2 - 13][x2 + 25] = id;dx[0][y2 - 13][x2 + 26] = id;dx[0][y2 - 12][x2 - 23] = id;dx[0][y2 - 12][x2 - 22] = id;dx[0][y2 - 12][x2 - 21] = id;dx[0][y2 - 12][x2 - 20] = id;dx[0][y2 - 12][x2 - 19] = id;
	dx[0][y2 - 12][x2 - 18] = id;dx[0][y2 - 12][x2 - 17] = id;dx[0][y2 - 12][x2 - 16] = id;dx[0][y2 - 12][x2 - 15] = id;dx[0][y2 - 12][x2 - 14] = id;dx[0][y2 - 12][x2 - 13] = id;dx[0][y2 - 12][x2 - 12] = id;dx[0][y2 - 12][x2 - 11] = id;dx[0][y2 - 12][x2 - 10] = id;
	dx[0][y2 - 12][x2 - 9] = id;dx[0][y2 - 12][x2 - 8] = id;dx[0][y2 - 12][x2 - 7] = id;dx[0][y2 - 12][x2 - 6] = id;dx[0][y2 - 12][x2 - 5] = id;dx[0][y2 - 12][x2 - 4] = id;dx[0][y2 - 12][x2 - 3] = id;dx[0][y2 - 12][x2 - 2] = id;dx[0][y2 - 12][x2 - 1] = id;
	dx[0][y2 - 12][x2 + 0] = id;dx[0][y2 - 12][x2 + 1] = id;dx[0][y2 - 12][x2 + 2] = id;dx[0][y2 - 12][x2 + 3] = id;dx[0][y2 - 12][x2 + 4] = id;dx[0][y2 - 12][x2 + 5] = id;dx[0][y2 - 12][x2 + 6] = id;dx[0][y2 - 12][x2 + 7] = id;dx[0][y2 - 12][x2 + 8] = id;
	dx[0][y2 - 12][x2 + 9] = id;dx[0][y2 - 12][x2 + 10] = id;dx[0][y2 - 12][x2 + 11] = id;dx[0][y2 - 12][x2 + 12] = id;dx[0][y2 - 12][x2 + 13] = id;dx[0][y2 - 12][x2 + 14] = id;dx[0][y2 - 12][x2 + 15] = id;dx[0][y2 - 12][x2 + 16] = id;dx[0][y2 - 12][x2 + 17] = id;
	dx[0][y2 - 12][x2 + 18] = id;dx[0][y2 - 12][x2 + 19] = id;dx[0][y2 - 12][x2 + 20] = id;dx[0][y2 - 12][x2 + 21] = id;dx[0][y2 - 12][x2 + 22] = id;dx[0][y2 - 12][x2 + 23] = id;dx[0][y2 - 11][x2 - 23] = id;dx[0][y2 - 11][x2 - 12] = id;dx[0][y2 - 11][x2 + 0] = id;
	dx[0][y2 - 11][x2 + 11] = id;dx[0][y2 - 11][x2 + 23] = id;dx[0][y2 - 10][x2 - 23] = id;dx[0][y2 - 10][x2 - 21] = id;dx[0][y2 - 10][x2 - 20] = id;dx[0][y2 - 10][x2 - 19] = id;dx[0][y2 - 10][x2 - 18] = id;dx[0][y2 - 10][x2 - 17] = id;dx[0][y2 - 10][x2 - 16] = id;
	dx[0][y2 - 10][x2 - 15] = id;dx[0][y2 - 10][x2 - 14] = id;dx[0][y2 - 10][x2 - 12] = id;dx[0][y2 - 10][x2 - 6] = id;dx[0][y2 - 10][x2 - 5] = id;dx[0][y2 - 10][x2 - 4] = id;dx[0][y2 - 10][x2 - 3] = id;dx[0][y2 - 10][x2 - 2] = id;dx[0][y2 - 10][x2 - 1] = id;
	dx[0][y2 - 10][x2 + 0] = id;dx[0][y2 - 10][x2 + 1] = id;dx[0][y2 - 10][x2 + 2] = id;dx[0][y2 - 10][x2 + 3] = id;dx[0][y2 - 10][x2 + 4] = id;dx[0][y2 - 10][x2 + 5] = id;dx[0][y2 - 10][x2 + 6] = id;dx[0][y2 - 10][x2 + 11] = id;dx[0][y2 - 10][x2 + 13] = id;
	dx[0][y2 - 10][x2 + 14] = id;dx[0][y2 - 10][x2 + 15] = id;dx[0][y2 - 10][x2 + 16] = id;dx[0][y2 - 10][x2 + 17] = id;dx[0][y2 - 10][x2 + 18] = id;dx[0][y2 - 10][x2 + 19] = id;dx[0][y2 - 10][x2 + 20] = id;dx[0][y2 - 10][x2 + 21] = id;dx[0][y2 - 10][x2 + 23] = id;
	dx[0][y2 - 9][x2 - 23] = id;dx[0][y2 - 9][x2 - 21] = id;dx[0][y2 - 9][x2 - 20] = id;dx[0][y2 - 9][x2 - 19] = id;dx[0][y2 - 9][x2 - 18] = id;dx[0][y2 - 9][x2 - 17] = id;dx[0][y2 - 9][x2 - 16] = id;dx[0][y2 - 9][x2 - 15] = id;dx[0][y2 - 9][x2 - 14] = id;
	dx[0][y2 - 9][x2 - 12] = id;dx[0][y2 - 9][x2 - 6] = id;dx[0][y2 - 9][x2 + 0] = id;dx[0][y2 - 9][x2 + 6] = id;dx[0][y2 - 9][x2 + 11] = id;dx[0][y2 - 9][x2 + 13] = id;dx[0][y2 - 9][x2 + 14] = id;dx[0][y2 - 9][x2 + 15] = id;dx[0][y2 - 9][x2 + 16] = id;
	dx[0][y2 - 9][x2 + 17] = id;dx[0][y2 - 9][x2 + 18] = id;dx[0][y2 - 9][x2 + 19] = id;dx[0][y2 - 9][x2 + 20] = id;dx[0][y2 - 9][x2 + 21] = id;dx[0][y2 - 9][x2 + 23] = id;dx[0][y2 - 8][x2 - 23] = id;dx[0][y2 - 8][x2 - 21] = id;dx[0][y2 - 8][x2 - 20] = id;
	dx[0][y2 - 8][x2 - 19] = id;dx[0][y2 - 8][x2 - 18] = id;dx[0][y2 - 8][x2 - 17] = id;dx[0][y2 - 8][x2 - 16] = id;dx[0][y2 - 8][x2 - 15] = id;dx[0][y2 - 8][x2 - 14] = id;dx[0][y2 - 8][x2 - 12] = id;dx[0][y2 - 8][x2 - 6] = id;dx[0][y2 - 8][x2 + 0] = id;
	dx[0][y2 - 8][x2 + 6] = id;dx[0][y2 - 8][x2 + 11] = id;dx[0][y2 - 8][x2 + 13] = id;dx[0][y2 - 8][x2 + 14] = id;dx[0][y2 - 8][x2 + 15] = id;dx[0][y2 - 8][x2 + 16] = id;dx[0][y2 - 8][x2 + 17] = id;dx[0][y2 - 8][x2 + 18] = id;dx[0][y2 - 8][x2 + 19] = id;
	dx[0][y2 - 8][x2 + 20] = id;dx[0][y2 - 8][x2 + 21] = id;dx[0][y2 - 8][x2 + 23] = id;dx[0][y2 - 7][x2 - 23] = id;dx[0][y2 - 7][x2 - 21] = id;dx[0][y2 - 7][x2 - 20] = id;dx[0][y2 - 7][x2 - 19] = id;dx[0][y2 - 7][x2 - 18] = id;dx[0][y2 - 7][x2 - 17] = id;
	dx[0][y2 - 7][x2 - 16] = id;dx[0][y2 - 7][x2 - 15] = id;dx[0][y2 - 7][x2 - 14] = id;dx[0][y2 - 7][x2 - 12] = id;dx[0][y2 - 7][x2 - 6] = id;dx[0][y2 - 7][x2 - 2] = id;dx[0][y2 - 7][x2 + 0] = id;dx[0][y2 - 7][x2 + 2] = id;dx[0][y2 - 7][x2 + 6] = id;
	dx[0][y2 - 7][x2 + 11] = id;dx[0][y2 - 7][x2 + 13] = id;dx[0][y2 - 7][x2 + 14] = id;dx[0][y2 - 7][x2 + 15] = id;dx[0][y2 - 7][x2 + 16] = id;dx[0][y2 - 7][x2 + 17] = id;dx[0][y2 - 7][x2 + 18] = id;dx[0][y2 - 7][x2 + 19] = id;dx[0][y2 - 7][x2 + 20] = id;
	dx[0][y2 - 7][x2 + 21] = id;dx[0][y2 - 7][x2 + 23] = id;dx[0][y2 - 6][x2 - 37] = id;dx[0][y2 - 6][x2 - 23] = id;dx[0][y2 - 6][x2 - 12] = id;dx[0][y2 - 6][x2 - 6] = id;dx[0][y2 - 6][x2 + 0] = id;dx[0][y2 - 6][x2 + 6] = id;dx[0][y2 - 6][x2 + 11] = id;
	dx[0][y2 - 6][x2 + 23] = id;dx[0][y2 - 6][x2 + 37] = id;dx[0][y2 - 5][x2 - 37] = id;dx[0][y2 - 5][x2 - 36] = id;dx[0][y2 - 5][x2 - 35] = id;dx[0][y2 - 5][x2 - 34] = id;dx[0][y2 - 5][x2 - 33] = id;dx[0][y2 - 5][x2 - 32] = id;dx[0][y2 - 5][x2 - 31] = id;
	dx[0][y2 - 5][x2 - 30] = id;dx[0][y2 - 5][x2 - 29] = id;dx[0][y2 - 5][x2 - 28] = id;dx[0][y2 - 5][x2 - 27] = id;dx[0][y2 - 5][x2 - 26] = id;dx[0][y2 - 5][x2 - 25] = id;dx[0][y2 - 5][x2 - 24] = id;dx[0][y2 - 5][x2 - 23] = id;dx[0][y2 - 5][x2 - 22] = id;
	dx[0][y2 - 5][x2 - 21] = id;dx[0][y2 - 5][x2 - 20] = id;dx[0][y2 - 5][x2 - 19] = id;dx[0][y2 - 5][x2 - 18] = id;dx[0][y2 - 5][x2 - 17] = id;dx[0][y2 - 5][x2 - 16] = id;dx[0][y2 - 5][x2 - 15] = id;dx[0][y2 - 5][x2 - 14] = id;dx[0][y2 - 5][x2 - 13] = id;
	dx[0][y2 - 5][x2 - 12] = id;dx[0][y2 - 5][x2 - 11] = id;dx[0][y2 - 5][x2 - 10] = id;dx[0][y2 - 5][x2 - 9] = id;dx[0][y2 - 5][x2 - 8] = id;dx[0][y2 - 5][x2 - 7] = id;dx[0][y2 - 5][x2 - 6] = id;dx[0][y2 - 5][x2 - 5] = id;dx[0][y2 - 5][x2 - 4] = id;
	dx[0][y2 - 5][x2 - 3] = id;dx[0][y2 - 5][x2 - 2] = id;dx[0][y2 - 5][x2 - 1] = id;dx[0][y2 - 5][x2 + 0] = id;dx[0][y2 - 5][x2 + 1] = id;dx[0][y2 - 5][x2 + 2] = id;dx[0][y2 - 5][x2 + 3] = id;dx[0][y2 - 5][x2 + 4] = id;dx[0][y2 - 5][x2 + 5] = id;
	dx[0][y2 - 5][x2 + 6] = id;dx[0][y2 - 5][x2 + 7] = id;dx[0][y2 - 5][x2 + 8] = id;dx[0][y2 - 5][x2 + 9] = id;dx[0][y2 - 5][x2 + 10] = id;dx[0][y2 - 5][x2 + 11] = id;dx[0][y2 - 5][x2 + 12] = id;dx[0][y2 - 5][x2 + 13] = id;dx[0][y2 - 5][x2 + 14] = id;
	dx[0][y2 - 5][x2 + 15] = id;dx[0][y2 - 5][x2 + 16] = id;dx[0][y2 - 5][x2 + 17] = id;dx[0][y2 - 5][x2 + 18] = id;dx[0][y2 - 5][x2 + 19] = id;dx[0][y2 - 5][x2 + 20] = id;dx[0][y2 - 5][x2 + 21] = id;dx[0][y2 - 5][x2 + 22] = id;dx[0][y2 - 5][x2 + 23] = id;
	dx[0][y2 - 5][x2 + 24] = id;dx[0][y2 - 5][x2 + 25] = id;dx[0][y2 - 5][x2 + 26] = id;dx[0][y2 - 5][x2 + 27] = id;dx[0][y2 - 5][x2 + 28] = id;dx[0][y2 - 5][x2 + 29] = id;dx[0][y2 - 5][x2 + 30] = id;dx[0][y2 - 5][x2 + 31] = id;dx[0][y2 - 5][x2 + 32] = id;
	dx[0][y2 - 5][x2 + 33] = id;dx[0][y2 - 5][x2 + 34] = id;dx[0][y2 - 5][x2 + 35] = id;dx[0][y2 - 5][x2 + 36] = id;dx[0][y2 - 5][x2 + 37] = id;dx[0][y2 - 4][x2 - 37] = id;dx[0][y2 - 4][x2 - 23] = id;dx[0][y2 - 4][x2 - 13] = id;dx[0][y2 - 4][x2 - 12] = id;
	dx[0][y2 - 4][x2 - 6] = id;dx[0][y2 - 4][x2 + 0] = id;dx[0][y2 - 4][x2 + 6] = id;dx[0][y2 - 4][x2 + 11] = id;dx[0][y2 - 4][x2 + 12] = id;dx[0][y2 - 4][x2 + 23] = id;dx[0][y2 - 4][x2 + 37] = id;dx[0][y2 - 3][x2 - 37] = id;dx[0][y2 - 3][x2 - 36] = id;
	dx[0][y2 - 3][x2 - 35] = id;dx[0][y2 - 3][x2 - 34] = id;dx[0][y2 - 3][x2 - 33] = id;dx[0][y2 - 3][x2 - 32] = id;dx[0][y2 - 3][x2 - 31] = id;dx[0][y2 - 3][x2 - 30] = id;dx[0][y2 - 3][x2 - 29] = id;dx[0][y2 - 3][x2 - 28] = id;dx[0][y2 - 3][x2 - 27] = id;
	dx[0][y2 - 3][x2 - 26] = id;dx[0][y2 - 3][x2 - 25] = id;dx[0][y2 - 3][x2 - 24] = id;dx[0][y2 - 3][x2 - 23] = id;dx[0][y2 - 3][x2 - 22] = id;dx[0][y2 - 3][x2 - 21] = id;dx[0][y2 - 3][x2 - 20] = id;dx[0][y2 - 3][x2 - 19] = id;dx[0][y2 - 3][x2 - 18] = id;
	dx[0][y2 - 3][x2 - 17] = id;dx[0][y2 - 3][x2 - 16] = id;dx[0][y2 - 3][x2 - 15] = id;dx[0][y2 - 3][x2 - 14] = id;dx[0][y2 - 3][x2 - 13] = id;dx[0][y2 - 3][x2 - 12] = id;dx[0][y2 - 3][x2 - 11] = id;dx[0][y2 - 3][x2 - 10] = id;dx[0][y2 - 3][x2 - 9] = id;
	dx[0][y2 - 3][x2 - 8] = id;dx[0][y2 - 3][x2 - 7] = id;dx[0][y2 - 3][x2 - 6] = id;dx[0][y2 - 3][x2 - 5] = id;dx[0][y2 - 3][x2 - 4] = id;dx[0][y2 - 3][x2 - 3] = id;dx[0][y2 - 3][x2 - 2] = id;dx[0][y2 - 3][x2 - 1] = id;dx[0][y2 - 3][x2 + 0] = id;
	dx[0][y2 - 3][x2 + 1] = id;dx[0][y2 - 3][x2 + 2] = id;dx[0][y2 - 3][x2 + 3] = id;dx[0][y2 - 3][x2 + 4] = id;dx[0][y2 - 3][x2 + 5] = id;dx[0][y2 - 3][x2 + 6] = id;dx[0][y2 - 3][x2 + 7] = id;dx[0][y2 - 3][x2 + 8] = id;dx[0][y2 - 3][x2 + 9] = id;
	dx[0][y2 - 3][x2 + 10] = id;dx[0][y2 - 3][x2 + 11] = id;dx[0][y2 - 3][x2 + 12] = id;dx[0][y2 - 3][x2 + 13] = id;dx[0][y2 - 3][x2 + 14] = id;dx[0][y2 - 3][x2 + 15] = id;dx[0][y2 - 3][x2 + 16] = id;dx[0][y2 - 3][x2 + 17] = id;dx[0][y2 - 3][x2 + 18] = id;
	dx[0][y2 - 3][x2 + 19] = id;dx[0][y2 - 3][x2 + 20] = id;dx[0][y2 - 3][x2 + 21] = id;dx[0][y2 - 3][x2 + 22] = id;dx[0][y2 - 3][x2 + 23] = id;dx[0][y2 - 3][x2 + 24] = id;dx[0][y2 - 3][x2 + 25] = id;dx[0][y2 - 3][x2 + 26] = id;dx[0][y2 - 3][x2 + 27] = id;
	dx[0][y2 - 3][x2 + 28] = id;dx[0][y2 - 3][x2 + 29] = id;dx[0][y2 - 3][x2 + 30] = id;dx[0][y2 - 3][x2 + 31] = id;dx[0][y2 - 3][x2 + 32] = id;dx[0][y2 - 3][x2 + 33] = id;dx[0][y2 - 3][x2 + 34] = id;dx[0][y2 - 3][x2 + 35] = id;dx[0][y2 - 3][x2 + 36] = id;
	dx[0][y2 - 3][x2 + 37] = id;dx[0][y2 - 2][x2 - 36] = id;dx[0][y2 - 2][x2 - 35] = id;dx[0][y2 - 2][x2 - 34] = id;dx[0][y2 - 2][x2 - 33] = id;dx[0][y2 - 2][x2 - 32] = id;dx[0][y2 - 2][x2 - 31] = id;dx[0][y2 - 2][x2 - 30] = id;dx[0][y2 - 2][x2 - 29] = id;
	dx[0][y2 - 2][x2 - 28] = id;dx[0][y2 - 2][x2 - 27] = id;dx[0][y2 - 2][x2 - 26] = id;dx[0][y2 - 2][x2 - 25] = id;dx[0][y2 - 2][x2 - 24] = id;dx[0][y2 - 2][x2 - 23] = id;dx[0][y2 - 2][x2 - 22] = id;dx[0][y2 - 2][x2 - 21] = id;dx[0][y2 - 2][x2 - 20] = id;
	dx[0][y2 - 2][x2 - 19] = id;dx[0][y2 - 2][x2 - 18] = id;dx[0][y2 - 2][x2 - 17] = id;dx[0][y2 - 2][x2 - 16] = id;dx[0][y2 - 2][x2 - 15] = id;dx[0][y2 - 2][x2 - 14] = id;dx[0][y2 - 2][x2 - 13] = id;dx[0][y2 - 2][x2 - 12] = id;dx[0][y2 - 2][x2 - 11] = id;
	dx[0][y2 - 2][x2 - 10] = id;dx[0][y2 - 2][x2 - 9] = id;dx[0][y2 - 2][x2 - 8] = id;dx[0][y2 - 2][x2 - 7] = id;dx[0][y2 - 2][x2 - 6] = id;dx[0][y2 - 2][x2 - 5] = id;dx[0][y2 - 2][x2 - 4] = id;dx[0][y2 - 2][x2 - 3] = id;dx[0][y2 - 2][x2 - 2] = id;
	dx[0][y2 - 2][x2 - 1] = id;dx[0][y2 - 2][x2 + 0] = id;dx[0][y2 - 2][x2 + 1] = id;dx[0][y2 - 2][x2 + 2] = id;dx[0][y2 - 2][x2 + 3] = id;dx[0][y2 - 2][x2 + 4] = id;dx[0][y2 - 2][x2 + 5] = id;dx[0][y2 - 2][x2 + 6] = id;dx[0][y2 - 2][x2 + 7] = id;
	dx[0][y2 - 2][x2 + 8] = id;dx[0][y2 - 2][x2 + 9] = id;dx[0][y2 - 2][x2 + 10] = id;dx[0][y2 - 2][x2 + 11] = id;dx[0][y2 - 2][x2 + 12] = id;dx[0][y2 - 2][x2 + 13] = id;dx[0][y2 - 2][x2 + 14] = id;dx[0][y2 - 2][x2 + 15] = id;dx[0][y2 - 2][x2 + 16] = id;
	dx[0][y2 - 2][x2 + 17] = id;dx[0][y2 - 2][x2 + 18] = id;dx[0][y2 - 2][x2 + 19] = id;dx[0][y2 - 2][x2 + 20] = id;dx[0][y2 - 2][x2 + 21] = id;dx[0][y2 - 2][x2 + 22] = id;dx[0][y2 - 2][x2 + 23] = id;dx[0][y2 - 2][x2 + 24] = id;dx[0][y2 - 2][x2 + 25] = id;
	dx[0][y2 - 2][x2 + 26] = id;dx[0][y2 - 2][x2 + 27] = id;dx[0][y2 - 2][x2 + 28] = id;dx[0][y2 - 2][x2 + 29] = id;dx[0][y2 - 2][x2 + 30] = id;dx[0][y2 - 2][x2 + 31] = id;dx[0][y2 - 2][x2 + 32] = id;dx[0][y2 - 2][x2 + 33] = id;dx[0][y2 - 2][x2 + 34] = id;
	dx[0][y2 - 2][x2 + 35] = id;dx[0][y2 - 2][x2 + 36] = id;dx[0][y2 - 1][x2 - 34] = id;dx[0][y2 - 1][x2 - 27] = id;dx[0][y2 - 1][x2 - 17] = id;dx[0][y2 - 1][x2 - 14] = id;dx[0][y2 - 1][x2 - 12] = id;dx[0][y2 - 1][x2 - 9] = id;dx[0][y2 - 1][x2 + 0] = id;
	dx[0][y2 - 1][x2 + 8] = id;dx[0][y2 - 1][x2 + 11] = id;dx[0][y2 - 1][x2 + 13] = id;dx[0][y2 - 1][x2 + 16] = id;dx[0][y2 - 1][x2 + 27] = id;dx[0][y2 - 1][x2 + 34] = id;dx[0][y2 + 0][x2 - 32] = id;dx[0][y2 + 0][x2 - 31] = id;dx[0][y2 + 0][x2 - 30] = id;
	dx[0][y2 + 0][x2 - 29] = id;dx[0][y2 + 0][x2 - 28] = id;dx[0][y2 + 0][x2 - 27] = id;dx[0][y2 + 0][x2 - 26] = id;dx[0][y2 + 0][x2 - 25] = id;dx[0][y2 + 0][x2 - 24] = id;dx[0][y2 + 0][x2 - 23] = id;dx[0][y2 + 0][x2 - 22] = id;dx[0][y2 + 0][x2 - 21] = id;
	dx[0][y2 + 0][x2 - 20] = id;dx[0][y2 + 0][x2 - 19] = id;dx[0][y2 + 0][x2 - 18] = id;dx[0][y2 + 0][x2 - 17] = id;dx[0][y2 + 0][x2 - 16] = id;dx[0][y2 + 0][x2 - 15] = id;dx[0][y2 + 0][x2 - 14] = id;dx[0][y2 + 0][x2 - 13] = id;dx[0][y2 + 0][x2 - 12] = id;
	dx[0][y2 + 0][x2 - 11] = id;dx[0][y2 + 0][x2 - 10] = id;dx[0][y2 + 0][x2 - 9] = id;dx[0][y2 + 0][x2 - 8] = id;dx[0][y2 + 0][x2 - 7] = id;dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;
	dx[0][y2 + 0][x2 - 2] = id;dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;
	dx[0][y2 + 0][x2 + 7] = id;dx[0][y2 + 0][x2 + 8] = id;dx[0][y2 + 0][x2 + 9] = id;dx[0][y2 + 0][x2 + 10] = id;dx[0][y2 + 0][x2 + 11] = id;dx[0][y2 + 0][x2 + 12] = id;dx[0][y2 + 0][x2 + 13] = id;dx[0][y2 + 0][x2 + 14] = id;dx[0][y2 + 0][x2 + 15] = id;
	dx[0][y2 + 0][x2 + 16] = id;dx[0][y2 + 0][x2 + 17] = id;dx[0][y2 + 0][x2 + 18] = id;dx[0][y2 + 0][x2 + 19] = id;dx[0][y2 + 0][x2 + 20] = id;dx[0][y2 + 0][x2 + 21] = id;dx[0][y2 + 0][x2 + 22] = id;dx[0][y2 + 0][x2 + 23] = id;dx[0][y2 + 0][x2 + 24] = id;
	dx[0][y2 + 0][x2 + 25] = id;dx[0][y2 + 0][x2 + 26] = id;dx[0][y2 + 0][x2 + 27] = id;dx[0][y2 + 0][x2 + 28] = id;dx[0][y2 + 0][x2 + 29] = id;dx[0][y2 + 0][x2 + 30] = id;dx[0][y2 + 0][x2 + 31] = id;dx[0][y2 + 0][x2 + 32] = id;dx[0][y2 + 1][x2 - 32] = id;
	dx[0][y2 + 1][x2 - 30] = id;dx[0][y2 + 1][x2 - 29] = id;dx[0][y2 + 1][x2 - 15] = id;dx[0][y2 + 1][x2 - 14] = id;dx[0][y2 + 1][x2 - 12] = id;dx[0][y2 + 1][x2 - 11] = id;dx[0][y2 + 1][x2 + 10] = id;dx[0][y2 + 1][x2 + 11] = id;dx[0][y2 + 1][x2 + 13] = id;
	dx[0][y2 + 1][x2 + 14] = id;dx[0][y2 + 1][x2 + 29] = id;dx[0][y2 + 1][x2 + 30] = id;dx[0][y2 + 1][x2 + 32] = id;dx[0][y2 + 2][x2 - 32] = id;dx[0][y2 + 2][x2 - 30] = id;dx[0][y2 + 2][x2 - 14] = id;dx[0][y2 + 2][x2 - 12] = id;dx[0][y2 + 2][x2 + 11] = id;
	dx[0][y2 + 2][x2 + 13] = id;dx[0][y2 + 2][x2 + 30] = id;dx[0][y2 + 2][x2 + 32] = id;dx[0][y2 + 3][x2 - 32] = id;dx[0][y2 + 3][x2 - 30] = id;dx[0][y2 + 3][x2 - 29] = id;dx[0][y2 + 3][x2 - 28] = id;dx[0][y2 + 3][x2 - 27] = id;dx[0][y2 + 3][x2 - 26] = id;
	dx[0][y2 + 3][x2 - 25] = id;dx[0][y2 + 3][x2 - 24] = id;dx[0][y2 + 3][x2 - 23] = id;dx[0][y2 + 3][x2 - 22] = id;dx[0][y2 + 3][x2 - 21] = id;dx[0][y2 + 3][x2 - 20] = id;dx[0][y2 + 3][x2 - 19] = id;dx[0][y2 + 3][x2 - 18] = id;dx[0][y2 + 3][x2 - 17] = id;
	dx[0][y2 + 3][x2 - 16] = id;dx[0][y2 + 3][x2 - 15] = id;dx[0][y2 + 3][x2 - 14] = id;dx[0][y2 + 3][x2 - 12] = id;dx[0][y2 + 3][x2 + 11] = id;dx[0][y2 + 3][x2 + 13] = id;dx[0][y2 + 3][x2 + 14] = id;dx[0][y2 + 3][x2 + 15] = id;dx[0][y2 + 3][x2 + 16] = id;
	dx[0][y2 + 3][x2 + 17] = id;dx[0][y2 + 3][x2 + 18] = id;dx[0][y2 + 3][x2 + 19] = id;dx[0][y2 + 3][x2 + 20] = id;dx[0][y2 + 3][x2 + 21] = id;dx[0][y2 + 3][x2 + 22] = id;dx[0][y2 + 3][x2 + 23] = id;dx[0][y2 + 3][x2 + 24] = id;dx[0][y2 + 3][x2 + 25] = id;
	dx[0][y2 + 3][x2 + 26] = id;dx[0][y2 + 3][x2 + 27] = id;dx[0][y2 + 3][x2 + 28] = id;dx[0][y2 + 3][x2 + 29] = id;dx[0][y2 + 3][x2 + 30] = id;dx[0][y2 + 3][x2 + 32] = id;dx[0][y2 + 4][x2 - 32] = id;dx[0][y2 + 4][x2 - 30] = id;dx[0][y2 + 4][x2 - 14] = id;
	dx[0][y2 + 4][x2 - 12] = id;dx[0][y2 + 4][x2 + 11] = id;dx[0][y2 + 4][x2 + 13] = id;dx[0][y2 + 4][x2 + 30] = id;dx[0][y2 + 4][x2 + 32] = id;dx[0][y2 + 5][x2 - 32] = id;dx[0][y2 + 5][x2 - 30] = id;dx[0][y2 + 5][x2 - 29] = id;dx[0][y2 + 5][x2 - 28] = id;
	dx[0][y2 + 5][x2 - 27] = id;dx[0][y2 + 5][x2 - 26] = id;dx[0][y2 + 5][x2 - 25] = id;dx[0][y2 + 5][x2 - 24] = id;dx[0][y2 + 5][x2 - 23] = id;dx[0][y2 + 5][x2 - 22] = id;dx[0][y2 + 5][x2 - 21] = id;dx[0][y2 + 5][x2 - 20] = id;dx[0][y2 + 5][x2 - 19] = id;
	dx[0][y2 + 5][x2 - 18] = id;dx[0][y2 + 5][x2 - 17] = id;dx[0][y2 + 5][x2 - 16] = id;dx[0][y2 + 5][x2 - 15] = id;dx[0][y2 + 5][x2 - 14] = id;dx[0][y2 + 5][x2 - 12] = id;dx[0][y2 + 5][x2 + 11] = id;dx[0][y2 + 5][x2 + 13] = id;dx[0][y2 + 5][x2 + 14] = id;
	dx[0][y2 + 5][x2 + 15] = id;dx[0][y2 + 5][x2 + 16] = id;dx[0][y2 + 5][x2 + 17] = id;dx[0][y2 + 5][x2 + 18] = id;dx[0][y2 + 5][x2 + 19] = id;dx[0][y2 + 5][x2 + 20] = id;dx[0][y2 + 5][x2 + 21] = id;dx[0][y2 + 5][x2 + 22] = id;dx[0][y2 + 5][x2 + 23] = id;
	dx[0][y2 + 5][x2 + 24] = id;dx[0][y2 + 5][x2 + 25] = id;dx[0][y2 + 5][x2 + 26] = id;dx[0][y2 + 5][x2 + 27] = id;dx[0][y2 + 5][x2 + 28] = id;dx[0][y2 + 5][x2 + 29] = id;dx[0][y2 + 5][x2 + 30] = id;dx[0][y2 + 5][x2 + 32] = id;dx[0][y2 + 6][x2 - 32] = id;
	dx[0][y2 + 6][x2 - 30] = id;dx[0][y2 + 6][x2 - 14] = id;dx[0][y2 + 6][x2 - 12] = id;dx[0][y2 + 6][x2 + 11] = id;dx[0][y2 + 6][x2 + 13] = id;dx[0][y2 + 6][x2 + 30] = id;dx[0][y2 + 6][x2 + 32] = id;dx[0][y2 + 7][x2 - 32] = id;dx[0][y2 + 7][x2 - 30] = id;
	dx[0][y2 + 7][x2 - 29] = id;dx[0][y2 + 7][x2 - 28] = id;dx[0][y2 + 7][x2 - 27] = id;dx[0][y2 + 7][x2 - 26] = id;dx[0][y2 + 7][x2 - 25] = id;dx[0][y2 + 7][x2 - 24] = id;dx[0][y2 + 7][x2 - 23] = id;dx[0][y2 + 7][x2 - 22] = id;dx[0][y2 + 7][x2 - 21] = id;
	dx[0][y2 + 7][x2 - 20] = id;dx[0][y2 + 7][x2 - 19] = id;dx[0][y2 + 7][x2 - 18] = id;dx[0][y2 + 7][x2 - 17] = id;dx[0][y2 + 7][x2 - 16] = id;dx[0][y2 + 7][x2 - 15] = id;dx[0][y2 + 7][x2 - 14] = id;dx[0][y2 + 7][x2 - 12] = id;dx[0][y2 + 7][x2 + 11] = id;
	dx[0][y2 + 7][x2 + 13] = id;dx[0][y2 + 7][x2 + 14] = id;dx[0][y2 + 7][x2 + 15] = id;dx[0][y2 + 7][x2 + 16] = id;dx[0][y2 + 7][x2 + 17] = id;dx[0][y2 + 7][x2 + 18] = id;dx[0][y2 + 7][x2 + 19] = id;dx[0][y2 + 7][x2 + 20] = id;dx[0][y2 + 7][x2 + 21] = id;
	dx[0][y2 + 7][x2 + 22] = id;dx[0][y2 + 7][x2 + 23] = id;dx[0][y2 + 7][x2 + 24] = id;dx[0][y2 + 7][x2 + 25] = id;dx[0][y2 + 7][x2 + 26] = id;dx[0][y2 + 7][x2 + 27] = id;dx[0][y2 + 7][x2 + 28] = id;dx[0][y2 + 7][x2 + 29] = id;dx[0][y2 + 7][x2 + 30] = id;
	dx[0][y2 + 7][x2 + 32] = id;dx[0][y2 + 8][x2 - 32] = id;dx[0][y2 + 8][x2 - 30] = id;dx[0][y2 + 8][x2 - 14] = id;dx[0][y2 + 8][x2 - 12] = id;dx[0][y2 + 8][x2 + 11] = id;dx[0][y2 + 8][x2 + 13] = id;dx[0][y2 + 8][x2 + 30] = id;dx[0][y2 + 8][x2 + 32] = id;
	dx[0][y2 + 9][x2 - 32] = id;dx[0][y2 + 9][x2 - 30] = id;dx[0][y2 + 9][x2 - 14] = id;dx[0][y2 + 9][x2 - 12] = id;dx[0][y2 + 9][x2 + 11] = id;dx[0][y2 + 9][x2 + 13] = id;dx[0][y2 + 9][x2 + 30] = id;dx[0][y2 + 9][x2 + 32] = id;dx[0][y2 + 10][x2 - 32] = id;
	dx[0][y2 + 10][x2 - 30] = id;dx[0][y2 + 10][x2 - 27] = id;dx[0][y2 + 10][x2 - 25] = id;dx[0][y2 + 10][x2 - 23] = id;dx[0][y2 + 10][x2 - 21] = id;dx[0][y2 + 10][x2 - 19] = id;dx[0][y2 + 10][x2 - 17] = id;dx[0][y2 + 10][x2 - 14] = id;dx[0][y2 + 10][x2 - 12] = id;
	dx[0][y2 + 10][x2 + 11] = id;dx[0][y2 + 10][x2 + 13] = id;dx[0][y2 + 10][x2 + 16] = id;dx[0][y2 + 10][x2 + 18] = id;dx[0][y2 + 10][x2 + 20] = id;dx[0][y2 + 10][x2 + 22] = id;dx[0][y2 + 10][x2 + 24] = id;dx[0][y2 + 10][x2 + 26] = id;dx[0][y2 + 10][x2 + 30] = id;
	dx[0][y2 + 10][x2 + 32] = id;dx[0][y2 + 11][x2 - 32] = id;dx[0][y2 + 11][x2 - 30] = id;dx[0][y2 + 11][x2 - 27] = id;dx[0][y2 + 11][x2 - 25] = id;dx[0][y2 + 11][x2 - 23] = id;dx[0][y2 + 11][x2 - 21] = id;dx[0][y2 + 11][x2 - 19] = id;dx[0][y2 + 11][x2 - 17] = id;
	dx[0][y2 + 11][x2 - 14] = id;dx[0][y2 + 11][x2 - 12] = id;dx[0][y2 + 11][x2 + 11] = id;dx[0][y2 + 11][x2 + 13] = id;dx[0][y2 + 11][x2 + 16] = id;dx[0][y2 + 11][x2 + 18] = id;dx[0][y2 + 11][x2 + 20] = id;dx[0][y2 + 11][x2 + 22] = id;dx[0][y2 + 11][x2 + 24] = id;
	dx[0][y2 + 11][x2 + 26] = id;dx[0][y2 + 11][x2 + 30] = id;dx[0][y2 + 11][x2 + 32] = id;dx[0][y2 + 12][x2 - 32] = id;dx[0][y2 + 12][x2 - 30] = id;dx[0][y2 + 12][x2 - 27] = id;dx[0][y2 + 12][x2 - 25] = id;dx[0][y2 + 12][x2 - 23] = id;dx[0][y2 + 12][x2 - 21] = id;
	dx[0][y2 + 12][x2 - 19] = id;dx[0][y2 + 12][x2 - 17] = id;dx[0][y2 + 12][x2 - 14] = id;dx[0][y2 + 12][x2 - 12] = id;dx[0][y2 + 12][x2 + 11] = id;dx[0][y2 + 12][x2 + 13] = id;dx[0][y2 + 12][x2 + 16] = id;dx[0][y2 + 12][x2 + 18] = id;dx[0][y2 + 12][x2 + 20] = id;
	dx[0][y2 + 12][x2 + 22] = id;dx[0][y2 + 12][x2 + 24] = id;dx[0][y2 + 12][x2 + 26] = id;dx[0][y2 + 12][x2 + 30] = id;dx[0][y2 + 12][x2 + 32] = id;dx[0][y2 + 13][x2 - 32] = id;dx[0][y2 + 13][x2 - 31] = id;dx[0][y2 + 13][x2 - 30] = id;dx[0][y2 + 13][x2 - 29] = id;
	dx[0][y2 + 13][x2 - 28] = id;dx[0][y2 + 13][x2 - 27] = id;dx[0][y2 + 13][x2 - 26] = id;dx[0][y2 + 13][x2 - 25] = id;dx[0][y2 + 13][x2 - 24] = id;dx[0][y2 + 13][x2 - 23] = id;dx[0][y2 + 13][x2 - 22] = id;dx[0][y2 + 13][x2 - 21] = id;dx[0][y2 + 13][x2 - 20] = id;
	dx[0][y2 + 13][x2 - 19] = id;dx[0][y2 + 13][x2 - 18] = id;dx[0][y2 + 13][x2 - 17] = id;dx[0][y2 + 13][x2 - 16] = id;dx[0][y2 + 13][x2 - 15] = id;dx[0][y2 + 13][x2 - 14] = id;dx[0][y2 + 13][x2 - 13] = id;dx[0][y2 + 13][x2 - 12] = id;dx[0][y2 + 13][x2 - 11] = id;
	dx[0][y2 + 13][x2 - 10] = id;dx[0][y2 + 13][x2 - 9] = id;dx[0][y2 + 13][x2 - 8] = id;dx[0][y2 + 13][x2 - 7] = id;dx[0][y2 + 13][x2 - 6] = id;dx[0][y2 + 13][x2 - 5] = id;dx[0][y2 + 13][x2 - 4] = id;dx[0][y2 + 13][x2 - 3] = id;dx[0][y2 + 13][x2 - 2] = id;
	dx[0][y2 + 13][x2 - 1] = id;dx[0][y2 + 13][x2 + 0] = id;dx[0][y2 + 13][x2 + 1] = id;dx[0][y2 + 13][x2 + 2] = id;dx[0][y2 + 13][x2 + 3] = id;dx[0][y2 + 13][x2 + 4] = id;dx[0][y2 + 13][x2 + 5] = id;dx[0][y2 + 13][x2 + 6] = id;dx[0][y2 + 13][x2 + 7] = id;
	dx[0][y2 + 13][x2 + 8] = id;dx[0][y2 + 13][x2 + 9] = id;dx[0][y2 + 13][x2 + 10] = id;dx[0][y2 + 13][x2 + 11] = id;dx[0][y2 + 13][x2 + 12] = id;dx[0][y2 + 13][x2 + 13] = id;dx[0][y2 + 13][x2 + 14] = id;dx[0][y2 + 13][x2 + 15] = id;dx[0][y2 + 13][x2 + 16] = id;
	dx[0][y2 + 13][x2 + 17] = id;dx[0][y2 + 13][x2 + 18] = id;dx[0][y2 + 13][x2 + 19] = id;dx[0][y2 + 13][x2 + 20] = id;dx[0][y2 + 13][x2 + 21] = id;dx[0][y2 + 13][x2 + 22] = id;dx[0][y2 + 13][x2 + 23] = id;dx[0][y2 + 13][x2 + 24] = id;dx[0][y2 + 13][x2 + 25] = id;
	dx[0][y2 + 13][x2 + 26] = id;dx[0][y2 + 13][x2 + 27] = id;dx[0][y2 + 13][x2 + 28] = id;dx[0][y2 + 13][x2 + 29] = id;dx[0][y2 + 13][x2 + 30] = id;dx[0][y2 + 13][x2 + 31] = id;dx[0][y2 + 13][x2 + 32] = id;
}

void woodhouse(int x1,int y1) 
{
	int id = 15;
	int x2 = x1 + 30 + 30;
	int y2 = 600 - y1;



	dx[0][y2 - 32][x2 + 37] = id;dx[0][y2 - 32][x2 + 38] = id;dx[0][y2 - 32][x2 + 39] = id;dx[0][y2 - 32][x2 + 40] = id;dx[0][y2 - 32][x2 + 41] = id;dx[0][y2 - 31][x2 + 33] = id;dx[0][y2 - 31][x2 + 34] = id;dx[0][y2 - 31][x2 + 35] = id;dx[0][y2 - 31][x2 + 36] = id;
	dx[0][y2 - 31][x2 + 37] = id;dx[0][y2 - 31][x2 + 38] = id;dx[0][y2 - 31][x2 + 39] = id;dx[0][y2 - 31][x2 + 41] = id;dx[0][y2 - 31][x2 + 42] = id;dx[0][y2 - 31][x2 + 43] = id;dx[0][y2 - 31][x2 + 44] = id;dx[0][y2 - 31][x2 + 45] = id;dx[0][y2 - 30][x2 + 29] = id;
	dx[0][y2 - 30][x2 + 30] = id;dx[0][y2 - 30][x2 + 31] = id;dx[0][y2 - 30][x2 + 32] = id;dx[0][y2 - 30][x2 + 33] = id;dx[0][y2 - 30][x2 + 34] = id;dx[0][y2 - 30][x2 + 35] = id;dx[0][y2 - 30][x2 + 38] = id;dx[0][y2 - 30][x2 + 39] = id;dx[0][y2 - 30][x2 + 42] = id;
	dx[0][y2 - 30][x2 + 43] = id;dx[0][y2 - 30][x2 + 44] = id;dx[0][y2 - 30][x2 + 45] = id;dx[0][y2 - 30][x2 + 46] = id;dx[0][y2 - 30][x2 + 47] = id;dx[0][y2 - 30][x2 + 48] = id;dx[0][y2 - 30][x2 + 49] = id;dx[0][y2 - 29][x2 + 25] = id;dx[0][y2 - 29][x2 + 26] = id;
	dx[0][y2 - 29][x2 + 27] = id;dx[0][y2 - 29][x2 + 28] = id;dx[0][y2 - 29][x2 + 29] = id;dx[0][y2 - 29][x2 + 30] = id;dx[0][y2 - 29][x2 + 31] = id;dx[0][y2 - 29][x2 + 34] = id;dx[0][y2 - 29][x2 + 35] = id;dx[0][y2 - 29][x2 + 38] = id;dx[0][y2 - 29][x2 + 39] = id;
	dx[0][y2 - 29][x2 + 44] = id;dx[0][y2 - 29][x2 + 45] = id;dx[0][y2 - 29][x2 + 47] = id;dx[0][y2 - 29][x2 + 48] = id;dx[0][y2 - 29][x2 + 49] = id;dx[0][y2 - 29][x2 + 50] = id;dx[0][y2 - 29][x2 + 51] = id;dx[0][y2 - 29][x2 + 52] = id;dx[0][y2 - 29][x2 + 53] = id;
	dx[0][y2 - 28][x2 + 21] = id;dx[0][y2 - 28][x2 + 22] = id;dx[0][y2 - 28][x2 + 23] = id;dx[0][y2 - 28][x2 + 24] = id;dx[0][y2 - 28][x2 + 25] = id;dx[0][y2 - 28][x2 + 26] = id;dx[0][y2 - 28][x2 + 27] = id;dx[0][y2 - 28][x2 + 30] = id;dx[0][y2 - 28][x2 + 31] = id;
	dx[0][y2 - 28][x2 + 34] = id;dx[0][y2 - 28][x2 + 35] = id;dx[0][y2 - 28][x2 + 38] = id;dx[0][y2 - 28][x2 + 39] = id;dx[0][y2 - 28][x2 + 44] = id;dx[0][y2 - 28][x2 + 45] = id;dx[0][y2 - 28][x2 + 46] = id;dx[0][y2 - 28][x2 + 49] = id;dx[0][y2 - 28][x2 + 51] = id;
	dx[0][y2 - 28][x2 + 52] = id;dx[0][y2 - 28][x2 + 53] = id;dx[0][y2 - 28][x2 + 54] = id;dx[0][y2 - 28][x2 + 55] = id;dx[0][y2 - 28][x2 + 56] = id;dx[0][y2 - 28][x2 + 57] = id;dx[0][y2 - 27][x2 + 17] = id;dx[0][y2 - 27][x2 + 18] = id;dx[0][y2 - 27][x2 + 19] = id;
	dx[0][y2 - 27][x2 + 20] = id;dx[0][y2 - 27][x2 + 21] = id;dx[0][y2 - 27][x2 + 22] = id;dx[0][y2 - 27][x2 + 24] = id;dx[0][y2 - 27][x2 + 26] = id;dx[0][y2 - 27][x2 + 27] = id;dx[0][y2 - 27][x2 + 30] = id;dx[0][y2 - 27][x2 + 31] = id;dx[0][y2 - 27][x2 + 34] = id;
	dx[0][y2 - 27][x2 + 35] = id;dx[0][y2 - 27][x2 + 38] = id;dx[0][y2 - 27][x2 + 39] = id;dx[0][y2 - 27][x2 + 44] = id;dx[0][y2 - 27][x2 + 45] = id;dx[0][y2 - 27][x2 + 46] = id;dx[0][y2 - 27][x2 + 49] = id;dx[0][y2 - 27][x2 + 52] = id;dx[0][y2 - 27][x2 + 53] = id;
	dx[0][y2 - 27][x2 + 55] = id;dx[0][y2 - 27][x2 + 56] = id;dx[0][y2 - 27][x2 + 57] = id;dx[0][y2 - 27][x2 + 58] = id;dx[0][y2 - 27][x2 + 59] = id;dx[0][y2 - 27][x2 + 60] = id;dx[0][y2 - 26][x2 + 13] = id;dx[0][y2 - 26][x2 + 14] = id;dx[0][y2 - 26][x2 + 15] = id;
	dx[0][y2 - 26][x2 + 16] = id;dx[0][y2 - 26][x2 + 17] = id;dx[0][y2 - 26][x2 + 19] = id;dx[0][y2 - 26][x2 + 20] = id;dx[0][y2 - 26][x2 + 23] = id;dx[0][y2 - 26][x2 + 24] = id;dx[0][y2 - 26][x2 + 26] = id;dx[0][y2 - 26][x2 + 27] = id;dx[0][y2 - 26][x2 + 30] = id;
	dx[0][y2 - 26][x2 + 31] = id;dx[0][y2 - 26][x2 + 34] = id;dx[0][y2 - 26][x2 + 35] = id;dx[0][y2 - 26][x2 + 38] = id;dx[0][y2 - 26][x2 + 39] = id;dx[0][y2 - 26][x2 + 44] = id;dx[0][y2 - 26][x2 + 45] = id;dx[0][y2 - 26][x2 + 46] = id;dx[0][y2 - 26][x2 + 49] = id;
	dx[0][y2 - 26][x2 + 52] = id;dx[0][y2 - 26][x2 + 53] = id;dx[0][y2 - 26][x2 + 57] = id;dx[0][y2 - 26][x2 + 58] = id;dx[0][y2 - 26][x2 + 59] = id;dx[0][y2 - 26][x2 + 60] = id;dx[0][y2 - 26][x2 + 61] = id;dx[0][y2 - 26][x2 + 62] = id;dx[0][y2 - 26][x2 + 63] = id;
	dx[0][y2 - 26][x2 + 64] = id;dx[0][y2 - 25][x2 + 9] = id;dx[0][y2 - 25][x2 + 10] = id;dx[0][y2 - 25][x2 + 11] = id;dx[0][y2 - 25][x2 + 12] = id;dx[0][y2 - 25][x2 + 13] = id;dx[0][y2 - 25][x2 + 14] = id;dx[0][y2 - 25][x2 + 15] = id;dx[0][y2 - 25][x2 + 19] = id;
	dx[0][y2 - 25][x2 + 20] = id;dx[0][y2 - 25][x2 + 23] = id;dx[0][y2 - 25][x2 + 24] = id;dx[0][y2 - 25][x2 + 26] = id;dx[0][y2 - 25][x2 + 27] = id;dx[0][y2 - 25][x2 + 30] = id;dx[0][y2 - 25][x2 + 31] = id;dx[0][y2 - 25][x2 + 34] = id;dx[0][y2 - 25][x2 + 35] = id;
	dx[0][y2 - 25][x2 + 38] = id;dx[0][y2 - 25][x2 + 39] = id;dx[0][y2 - 25][x2 + 44] = id;dx[0][y2 - 25][x2 + 45] = id;dx[0][y2 - 25][x2 + 46] = id;dx[0][y2 - 25][x2 + 49] = id;dx[0][y2 - 25][x2 + 52] = id;dx[0][y2 - 25][x2 + 53] = id;dx[0][y2 - 25][x2 + 57] = id;
	dx[0][y2 - 25][x2 + 58] = id;dx[0][y2 - 25][x2 + 63] = id;dx[0][y2 - 25][x2 + 64] = id;dx[0][y2 - 25][x2 + 65] = id;dx[0][y2 - 25][x2 + 66] = id;dx[0][y2 - 25][x2 + 67] = id;dx[0][y2 - 25][x2 + 68] = id;dx[0][y2 - 24][x2 + 5] = id;dx[0][y2 - 24][x2 + 6] = id;
	dx[0][y2 - 24][x2 + 7] = id;dx[0][y2 - 24][x2 + 8] = id;dx[0][y2 - 24][x2 + 9] = id;dx[0][y2 - 24][x2 + 10] = id;dx[0][y2 - 24][x2 + 11] = id;dx[0][y2 - 24][x2 + 14] = id;dx[0][y2 - 24][x2 + 15] = id;dx[0][y2 - 24][x2 + 19] = id;dx[0][y2 - 24][x2 + 20] = id;
	dx[0][y2 - 24][x2 + 23] = id;dx[0][y2 - 24][x2 + 24] = id;dx[0][y2 - 24][x2 + 26] = id;dx[0][y2 - 24][x2 + 27] = id;dx[0][y2 - 24][x2 + 30] = id;dx[0][y2 - 24][x2 + 31] = id;dx[0][y2 - 24][x2 + 34] = id;dx[0][y2 - 24][x2 + 35] = id;dx[0][y2 - 24][x2 + 38] = id;
	dx[0][y2 - 24][x2 + 39] = id;dx[0][y2 - 24][x2 + 44] = id;dx[0][y2 - 24][x2 + 45] = id;dx[0][y2 - 24][x2 + 46] = id;dx[0][y2 - 24][x2 + 49] = id;dx[0][y2 - 24][x2 + 52] = id;dx[0][y2 - 24][x2 + 53] = id;dx[0][y2 - 24][x2 + 57] = id;dx[0][y2 - 24][x2 + 58] = id;
	dx[0][y2 - 24][x2 + 63] = id;dx[0][y2 - 24][x2 + 64] = id;dx[0][y2 - 24][x2 + 67] = id;dx[0][y2 - 24][x2 + 68] = id;dx[0][y2 - 24][x2 + 69] = id;dx[0][y2 - 24][x2 + 70] = id;dx[0][y2 - 24][x2 + 71] = id;dx[0][y2 - 24][x2 + 72] = id;dx[0][y2 - 23][x2 + 1] = id;
	dx[0][y2 - 23][x2 + 2] = id;dx[0][y2 - 23][x2 + 3] = id;dx[0][y2 - 23][x2 + 4] = id;dx[0][y2 - 23][x2 + 5] = id;dx[0][y2 - 23][x2 + 7] = id;dx[0][y2 - 23][x2 + 10] = id;dx[0][y2 - 23][x2 + 11] = id;dx[0][y2 - 23][x2 + 15] = id;dx[0][y2 - 23][x2 + 19] = id;
	dx[0][y2 - 23][x2 + 20] = id;dx[0][y2 - 23][x2 + 23] = id;dx[0][y2 - 23][x2 + 24] = id;dx[0][y2 - 23][x2 + 26] = id;dx[0][y2 - 23][x2 + 27] = id;dx[0][y2 - 23][x2 + 30] = id;dx[0][y2 - 23][x2 + 31] = id;dx[0][y2 - 23][x2 + 34] = id;dx[0][y2 - 23][x2 + 35] = id;
	dx[0][y2 - 23][x2 + 38] = id;dx[0][y2 - 23][x2 + 39] = id;dx[0][y2 - 23][x2 + 44] = id;dx[0][y2 - 23][x2 + 45] = id;dx[0][y2 - 23][x2 + 46] = id;dx[0][y2 - 23][x2 + 49] = id;dx[0][y2 - 23][x2 + 52] = id;dx[0][y2 - 23][x2 + 53] = id;dx[0][y2 - 23][x2 + 57] = id;
	dx[0][y2 - 23][x2 + 58] = id;dx[0][y2 - 23][x2 + 63] = id;dx[0][y2 - 23][x2 + 64] = id;dx[0][y2 - 23][x2 + 67] = id;dx[0][y2 - 23][x2 + 70] = id;dx[0][y2 - 23][x2 + 71] = id;dx[0][y2 - 23][x2 + 72] = id;dx[0][y2 - 23][x2 + 73] = id;dx[0][y2 - 23][x2 + 74] = id;
	dx[0][y2 - 23][x2 + 75] = id;dx[0][y2 - 23][x2 + 76] = id;dx[0][y2 - 22][x2 + 0] = id;dx[0][y2 - 22][x2 + 1] = id;dx[0][y2 - 22][x2 + 2] = id;dx[0][y2 - 22][x2 + 3] = id;dx[0][y2 - 22][x2 + 4] = id;dx[0][y2 - 22][x2 + 5] = id;dx[0][y2 - 22][x2 + 6] = id;
	dx[0][y2 - 22][x2 + 7] = id;dx[0][y2 - 22][x2 + 8] = id;dx[0][y2 - 22][x2 + 9] = id;dx[0][y2 - 22][x2 + 10] = id;dx[0][y2 - 22][x2 + 11] = id;dx[0][y2 - 22][x2 + 12] = id;dx[0][y2 - 22][x2 + 13] = id;dx[0][y2 - 22][x2 + 14] = id;dx[0][y2 - 22][x2 + 15] = id;
	dx[0][y2 - 22][x2 + 16] = id;dx[0][y2 - 22][x2 + 17] = id;dx[0][y2 - 22][x2 + 18] = id;dx[0][y2 - 22][x2 + 19] = id;dx[0][y2 - 22][x2 + 20] = id;dx[0][y2 - 22][x2 + 21] = id;dx[0][y2 - 22][x2 + 22] = id;dx[0][y2 - 22][x2 + 23] = id;dx[0][y2 - 22][x2 + 24] = id;
	dx[0][y2 - 22][x2 + 25] = id;dx[0][y2 - 22][x2 + 26] = id;dx[0][y2 - 22][x2 + 27] = id;dx[0][y2 - 22][x2 + 28] = id;dx[0][y2 - 22][x2 + 29] = id;dx[0][y2 - 22][x2 + 30] = id;dx[0][y2 - 22][x2 + 31] = id;dx[0][y2 - 22][x2 + 32] = id;dx[0][y2 - 22][x2 + 33] = id;
	dx[0][y2 - 22][x2 + 34] = id;dx[0][y2 - 22][x2 + 35] = id;dx[0][y2 - 22][x2 + 36] = id;dx[0][y2 - 22][x2 + 37] = id;dx[0][y2 - 22][x2 + 38] = id;dx[0][y2 - 22][x2 + 39] = id;dx[0][y2 - 22][x2 + 40] = id;dx[0][y2 - 22][x2 + 41] = id;dx[0][y2 - 22][x2 + 42] = id;
	dx[0][y2 - 22][x2 + 43] = id;dx[0][y2 - 22][x2 + 44] = id;dx[0][y2 - 22][x2 + 45] = id;dx[0][y2 - 22][x2 + 46] = id;dx[0][y2 - 22][x2 + 47] = id;dx[0][y2 - 22][x2 + 48] = id;dx[0][y2 - 22][x2 + 49] = id;dx[0][y2 - 22][x2 + 50] = id;dx[0][y2 - 22][x2 + 51] = id;
	dx[0][y2 - 22][x2 + 52] = id;dx[0][y2 - 22][x2 + 53] = id;dx[0][y2 - 22][x2 + 54] = id;dx[0][y2 - 22][x2 + 55] = id;dx[0][y2 - 22][x2 + 56] = id;dx[0][y2 - 22][x2 + 57] = id;dx[0][y2 - 22][x2 + 58] = id;dx[0][y2 - 22][x2 + 59] = id;dx[0][y2 - 22][x2 + 60] = id;
	dx[0][y2 - 22][x2 + 61] = id;dx[0][y2 - 22][x2 + 62] = id;dx[0][y2 - 22][x2 + 63] = id;dx[0][y2 - 22][x2 + 64] = id;dx[0][y2 - 22][x2 + 65] = id;dx[0][y2 - 22][x2 + 66] = id;dx[0][y2 - 22][x2 + 67] = id;dx[0][y2 - 22][x2 + 68] = id;dx[0][y2 - 22][x2 + 69] = id;
	dx[0][y2 - 22][x2 + 70] = id;dx[0][y2 - 22][x2 + 71] = id;dx[0][y2 - 22][x2 + 72] = id;dx[0][y2 - 22][x2 + 73] = id;dx[0][y2 - 22][x2 + 74] = id;dx[0][y2 - 22][x2 + 75] = id;dx[0][y2 - 22][x2 + 76] = id;dx[0][y2 - 22][x2 + 77] = id;dx[0][y2 - 22][x2 + 78] = id;
	dx[0][y2 - 22][x2 + 79] = id;dx[0][y2 - 22][x2 + 80] = id;dx[0][y2 - 21][x2 + 0] = id;dx[0][y2 - 21][x2 + 2] = id;dx[0][y2 - 21][x2 + 78] = id;dx[0][y2 - 21][x2 + 79] = id;dx[0][y2 - 21][x2 + 80] = id;dx[0][y2 - 20][x2 + 0] = id;dx[0][y2 - 20][x2 + 2] = id;
	dx[0][y2 - 20][x2 + 3] = id;dx[0][y2 - 20][x2 + 4] = id;dx[0][y2 - 20][x2 + 5] = id;dx[0][y2 - 20][x2 + 6] = id;dx[0][y2 - 20][x2 + 7] = id;dx[0][y2 - 20][x2 + 8] = id;dx[0][y2 - 20][x2 + 9] = id;dx[0][y2 - 20][x2 + 10] = id;dx[0][y2 - 20][x2 + 11] = id;
	dx[0][y2 - 20][x2 + 12] = id;dx[0][y2 - 20][x2 + 13] = id;dx[0][y2 - 20][x2 + 14] = id;dx[0][y2 - 20][x2 + 15] = id;dx[0][y2 - 20][x2 + 16] = id;dx[0][y2 - 20][x2 + 17] = id;dx[0][y2 - 20][x2 + 18] = id;dx[0][y2 - 20][x2 + 19] = id;dx[0][y2 - 20][x2 + 20] = id;
	dx[0][y2 - 20][x2 + 21] = id;dx[0][y2 - 20][x2 + 22] = id;dx[0][y2 - 20][x2 + 23] = id;dx[0][y2 - 20][x2 + 24] = id;dx[0][y2 - 20][x2 + 25] = id;dx[0][y2 - 20][x2 + 26] = id;dx[0][y2 - 20][x2 + 27] = id;dx[0][y2 - 20][x2 + 28] = id;dx[0][y2 - 20][x2 + 29] = id;
	dx[0][y2 - 20][x2 + 30] = id;dx[0][y2 - 20][x2 + 31] = id;dx[0][y2 - 20][x2 + 32] = id;dx[0][y2 - 20][x2 + 33] = id;dx[0][y2 - 20][x2 + 34] = id;dx[0][y2 - 20][x2 + 35] = id;dx[0][y2 - 20][x2 + 36] = id;dx[0][y2 - 20][x2 + 37] = id;dx[0][y2 - 20][x2 + 38] = id;
	dx[0][y2 - 20][x2 + 39] = id;dx[0][y2 - 20][x2 + 40] = id;dx[0][y2 - 20][x2 + 41] = id;dx[0][y2 - 20][x2 + 42] = id;dx[0][y2 - 20][x2 + 43] = id;dx[0][y2 - 20][x2 + 44] = id;dx[0][y2 - 20][x2 + 45] = id;dx[0][y2 - 20][x2 + 46] = id;dx[0][y2 - 20][x2 + 47] = id;
	dx[0][y2 - 20][x2 + 48] = id;dx[0][y2 - 20][x2 + 49] = id;dx[0][y2 - 20][x2 + 50] = id;dx[0][y2 - 20][x2 + 51] = id;dx[0][y2 - 20][x2 + 52] = id;dx[0][y2 - 20][x2 + 53] = id;dx[0][y2 - 20][x2 + 54] = id;dx[0][y2 - 20][x2 + 55] = id;dx[0][y2 - 20][x2 + 56] = id;
	dx[0][y2 - 20][x2 + 57] = id;dx[0][y2 - 20][x2 + 58] = id;dx[0][y2 - 20][x2 + 59] = id;dx[0][y2 - 20][x2 + 60] = id;dx[0][y2 - 20][x2 + 61] = id;dx[0][y2 - 20][x2 + 62] = id;dx[0][y2 - 20][x2 + 63] = id;dx[0][y2 - 20][x2 + 64] = id;dx[0][y2 - 20][x2 + 65] = id;
	dx[0][y2 - 20][x2 + 66] = id;dx[0][y2 - 20][x2 + 67] = id;dx[0][y2 - 20][x2 + 68] = id;dx[0][y2 - 20][x2 + 69] = id;dx[0][y2 - 20][x2 + 70] = id;dx[0][y2 - 20][x2 + 71] = id;dx[0][y2 - 20][x2 + 72] = id;dx[0][y2 - 20][x2 + 73] = id;dx[0][y2 - 20][x2 + 74] = id;
	dx[0][y2 - 20][x2 + 75] = id;dx[0][y2 - 20][x2 + 76] = id;dx[0][y2 - 20][x2 + 77] = id;dx[0][y2 - 20][x2 + 78] = id;dx[0][y2 - 20][x2 + 80] = id;dx[0][y2 - 19][x2 + 0] = id;dx[0][y2 - 19][x2 + 2] = id;dx[0][y2 - 19][x2 + 41] = id;dx[0][y2 - 19][x2 + 42] = id;
	dx[0][y2 - 19][x2 + 43] = id;dx[0][y2 - 19][x2 + 44] = id;dx[0][y2 - 19][x2 + 45] = id;dx[0][y2 - 19][x2 + 46] = id;dx[0][y2 - 19][x2 + 47] = id;dx[0][y2 - 19][x2 + 48] = id;dx[0][y2 - 19][x2 + 49] = id;dx[0][y2 - 19][x2 + 50] = id;dx[0][y2 - 19][x2 + 51] = id;
	dx[0][y2 - 19][x2 + 52] = id;dx[0][y2 - 19][x2 + 53] = id;dx[0][y2 - 19][x2 + 54] = id;dx[0][y2 - 19][x2 + 55] = id;dx[0][y2 - 19][x2 + 56] = id;dx[0][y2 - 19][x2 + 57] = id;dx[0][y2 - 19][x2 + 58] = id;dx[0][y2 - 19][x2 + 59] = id;dx[0][y2 - 19][x2 + 60] = id;
	dx[0][y2 - 19][x2 + 61] = id;dx[0][y2 - 19][x2 + 62] = id;dx[0][y2 - 19][x2 + 63] = id;dx[0][y2 - 19][x2 + 64] = id;dx[0][y2 - 19][x2 + 65] = id;dx[0][y2 - 19][x2 + 66] = id;dx[0][y2 - 19][x2 + 67] = id;dx[0][y2 - 19][x2 + 68] = id;dx[0][y2 - 19][x2 + 69] = id;
	dx[0][y2 - 19][x2 + 70] = id;dx[0][y2 - 19][x2 + 71] = id;dx[0][y2 - 19][x2 + 72] = id;dx[0][y2 - 19][x2 + 73] = id;dx[0][y2 - 19][x2 + 74] = id;dx[0][y2 - 19][x2 + 75] = id;dx[0][y2 - 19][x2 + 76] = id;dx[0][y2 - 19][x2 + 77] = id;dx[0][y2 - 19][x2 + 78] = id;
	dx[0][y2 - 19][x2 + 80] = id;dx[0][y2 - 18][x2 + 0] = id;dx[0][y2 - 18][x2 + 2] = id;dx[0][y2 - 18][x2 + 3] = id;dx[0][y2 - 18][x2 + 4] = id;dx[0][y2 - 18][x2 + 5] = id;dx[0][y2 - 18][x2 + 6] = id;dx[0][y2 - 18][x2 + 7] = id;dx[0][y2 - 18][x2 + 8] = id;
	dx[0][y2 - 18][x2 + 9] = id;dx[0][y2 - 18][x2 + 10] = id;dx[0][y2 - 18][x2 + 11] = id;dx[0][y2 - 18][x2 + 12] = id;dx[0][y2 - 18][x2 + 13] = id;dx[0][y2 - 18][x2 + 14] = id;dx[0][y2 - 18][x2 + 15] = id;dx[0][y2 - 18][x2 + 16] = id;dx[0][y2 - 18][x2 + 17] = id;
	dx[0][y2 - 18][x2 + 18] = id;dx[0][y2 - 18][x2 + 19] = id;dx[0][y2 - 18][x2 + 20] = id;dx[0][y2 - 18][x2 + 21] = id;dx[0][y2 - 18][x2 + 22] = id;dx[0][y2 - 18][x2 + 23] = id;dx[0][y2 - 18][x2 + 24] = id;dx[0][y2 - 18][x2 + 25] = id;dx[0][y2 - 18][x2 + 26] = id;
	dx[0][y2 - 18][x2 + 27] = id;dx[0][y2 - 18][x2 + 28] = id;dx[0][y2 - 18][x2 + 29] = id;dx[0][y2 - 18][x2 + 30] = id;dx[0][y2 - 18][x2 + 31] = id;dx[0][y2 - 18][x2 + 32] = id;dx[0][y2 - 18][x2 + 33] = id;dx[0][y2 - 18][x2 + 34] = id;dx[0][y2 - 18][x2 + 35] = id;
	dx[0][y2 - 18][x2 + 36] = id;dx[0][y2 - 18][x2 + 37] = id;dx[0][y2 - 18][x2 + 38] = id;dx[0][y2 - 18][x2 + 39] = id;dx[0][y2 - 18][x2 + 78] = id;dx[0][y2 - 18][x2 + 80] = id;dx[0][y2 - 17][x2 + 0] = id;dx[0][y2 - 17][x2 + 2] = id;dx[0][y2 - 17][x2 + 3] = id;
	dx[0][y2 - 17][x2 + 4] = id;dx[0][y2 - 17][x2 + 5] = id;dx[0][y2 - 17][x2 + 6] = id;dx[0][y2 - 17][x2 + 7] = id;dx[0][y2 - 17][x2 + 8] = id;dx[0][y2 - 17][x2 + 9] = id;dx[0][y2 - 17][x2 + 10] = id;dx[0][y2 - 17][x2 + 11] = id;dx[0][y2 - 17][x2 + 12] = id;
	dx[0][y2 - 17][x2 + 13] = id;dx[0][y2 - 17][x2 + 14] = id;dx[0][y2 - 17][x2 + 15] = id;dx[0][y2 - 17][x2 + 16] = id;dx[0][y2 - 17][x2 + 17] = id;dx[0][y2 - 17][x2 + 18] = id;dx[0][y2 - 17][x2 + 19] = id;dx[0][y2 - 17][x2 + 20] = id;dx[0][y2 - 17][x2 + 21] = id;
	dx[0][y2 - 17][x2 + 22] = id;dx[0][y2 - 17][x2 + 23] = id;dx[0][y2 - 17][x2 + 24] = id;dx[0][y2 - 17][x2 + 25] = id;dx[0][y2 - 17][x2 + 26] = id;dx[0][y2 - 17][x2 + 27] = id;dx[0][y2 - 17][x2 + 28] = id;dx[0][y2 - 17][x2 + 29] = id;dx[0][y2 - 17][x2 + 30] = id;
	dx[0][y2 - 17][x2 + 31] = id;dx[0][y2 - 17][x2 + 32] = id;dx[0][y2 - 17][x2 + 33] = id;dx[0][y2 - 17][x2 + 34] = id;dx[0][y2 - 17][x2 + 35] = id;dx[0][y2 - 17][x2 + 36] = id;dx[0][y2 - 17][x2 + 37] = id;dx[0][y2 - 17][x2 + 38] = id;dx[0][y2 - 17][x2 + 39] = id;
	dx[0][y2 - 17][x2 + 41] = id;dx[0][y2 - 17][x2 + 42] = id;dx[0][y2 - 17][x2 + 43] = id;dx[0][y2 - 17][x2 + 44] = id;dx[0][y2 - 17][x2 + 45] = id;dx[0][y2 - 17][x2 + 46] = id;dx[0][y2 - 17][x2 + 47] = id;dx[0][y2 - 17][x2 + 48] = id;dx[0][y2 - 17][x2 + 49] = id;
	dx[0][y2 - 17][x2 + 50] = id;dx[0][y2 - 17][x2 + 51] = id;dx[0][y2 - 17][x2 + 52] = id;dx[0][y2 - 17][x2 + 53] = id;dx[0][y2 - 17][x2 + 54] = id;dx[0][y2 - 17][x2 + 55] = id;dx[0][y2 - 17][x2 + 56] = id;dx[0][y2 - 17][x2 + 57] = id;dx[0][y2 - 17][x2 + 58] = id;
	dx[0][y2 - 17][x2 + 59] = id;dx[0][y2 - 17][x2 + 60] = id;dx[0][y2 - 17][x2 + 61] = id;dx[0][y2 - 17][x2 + 62] = id;dx[0][y2 - 17][x2 + 63] = id;dx[0][y2 - 17][x2 + 64] = id;dx[0][y2 - 17][x2 + 65] = id;dx[0][y2 - 17][x2 + 66] = id;dx[0][y2 - 17][x2 + 67] = id;
	dx[0][y2 - 17][x2 + 68] = id;dx[0][y2 - 17][x2 + 69] = id;dx[0][y2 - 17][x2 + 70] = id;dx[0][y2 - 17][x2 + 71] = id;dx[0][y2 - 17][x2 + 72] = id;dx[0][y2 - 17][x2 + 73] = id;dx[0][y2 - 17][x2 + 74] = id;dx[0][y2 - 17][x2 + 75] = id;dx[0][y2 - 17][x2 + 76] = id;
	dx[0][y2 - 17][x2 + 77] = id;dx[0][y2 - 17][x2 + 78] = id;dx[0][y2 - 17][x2 + 80] = id;dx[0][y2 - 16][x2 + 0] = id;dx[0][y2 - 16][x2 + 2] = id;dx[0][y2 - 16][x2 + 14] = id;dx[0][y2 - 16][x2 + 15] = id;dx[0][y2 - 16][x2 + 22] = id;dx[0][y2 - 16][x2 + 23] = id;
	dx[0][y2 - 16][x2 + 30] = id;dx[0][y2 - 16][x2 + 31] = id;dx[0][y2 - 16][x2 + 41] = id;dx[0][y2 - 16][x2 + 42] = id;dx[0][y2 - 16][x2 + 43] = id;dx[0][y2 - 16][x2 + 44] = id;dx[0][y2 - 16][x2 + 45] = id;dx[0][y2 - 16][x2 + 46] = id;dx[0][y2 - 16][x2 + 47] = id;
	dx[0][y2 - 16][x2 + 48] = id;dx[0][y2 - 16][x2 + 49] = id;dx[0][y2 - 16][x2 + 50] = id;dx[0][y2 - 16][x2 + 51] = id;dx[0][y2 - 16][x2 + 52] = id;dx[0][y2 - 16][x2 + 53] = id;dx[0][y2 - 16][x2 + 54] = id;dx[0][y2 - 16][x2 + 55] = id;dx[0][y2 - 16][x2 + 56] = id;
	dx[0][y2 - 16][x2 + 57] = id;dx[0][y2 - 16][x2 + 58] = id;dx[0][y2 - 16][x2 + 59] = id;dx[0][y2 - 16][x2 + 60] = id;dx[0][y2 - 16][x2 + 61] = id;dx[0][y2 - 16][x2 + 62] = id;dx[0][y2 - 16][x2 + 63] = id;dx[0][y2 - 16][x2 + 64] = id;dx[0][y2 - 16][x2 + 65] = id;
	dx[0][y2 - 16][x2 + 66] = id;dx[0][y2 - 16][x2 + 67] = id;dx[0][y2 - 16][x2 + 68] = id;dx[0][y2 - 16][x2 + 69] = id;dx[0][y2 - 16][x2 + 70] = id;dx[0][y2 - 16][x2 + 71] = id;dx[0][y2 - 16][x2 + 72] = id;dx[0][y2 - 16][x2 + 73] = id;dx[0][y2 - 16][x2 + 74] = id;
	dx[0][y2 - 16][x2 + 75] = id;dx[0][y2 - 16][x2 + 76] = id;dx[0][y2 - 16][x2 + 77] = id;dx[0][y2 - 16][x2 + 78] = id;dx[0][y2 - 16][x2 + 80] = id;dx[0][y2 - 15][x2 + 0] = id;dx[0][y2 - 15][x2 + 2] = id;dx[0][y2 - 15][x2 + 3] = id;dx[0][y2 - 15][x2 + 4] = id;
	dx[0][y2 - 15][x2 + 5] = id;dx[0][y2 - 15][x2 + 6] = id;dx[0][y2 - 15][x2 + 7] = id;dx[0][y2 - 15][x2 + 8] = id;dx[0][y2 - 15][x2 + 9] = id;dx[0][y2 - 15][x2 + 10] = id;dx[0][y2 - 15][x2 + 11] = id;dx[0][y2 - 15][x2 + 12] = id;dx[0][y2 - 15][x2 + 13] = id;
	dx[0][y2 - 15][x2 + 14] = id;dx[0][y2 - 15][x2 + 15] = id;dx[0][y2 - 15][x2 + 22] = id;dx[0][y2 - 15][x2 + 23] = id;dx[0][y2 - 15][x2 + 30] = id;dx[0][y2 - 15][x2 + 31] = id;dx[0][y2 - 15][x2 + 32] = id;dx[0][y2 - 15][x2 + 33] = id;dx[0][y2 - 15][x2 + 34] = id;
	dx[0][y2 - 15][x2 + 35] = id;dx[0][y2 - 15][x2 + 36] = id;dx[0][y2 - 15][x2 + 37] = id;dx[0][y2 - 15][x2 + 38] = id;dx[0][y2 - 15][x2 + 39] = id;dx[0][y2 - 15][x2 + 44] = id;dx[0][y2 - 15][x2 + 45] = id;dx[0][y2 - 15][x2 + 46] = id;dx[0][y2 - 15][x2 + 47] = id;
	dx[0][y2 - 15][x2 + 48] = id;dx[0][y2 - 15][x2 + 49] = id;dx[0][y2 - 15][x2 + 50] = id;dx[0][y2 - 15][x2 + 52] = id;dx[0][y2 - 15][x2 + 53] = id;dx[0][y2 - 15][x2 + 54] = id;dx[0][y2 - 15][x2 + 55] = id;dx[0][y2 - 15][x2 + 56] = id;dx[0][y2 - 15][x2 + 58] = id;
	dx[0][y2 - 15][x2 + 59] = id;dx[0][y2 - 15][x2 + 61] = id;dx[0][y2 - 15][x2 + 62] = id;dx[0][y2 - 15][x2 + 63] = id;dx[0][y2 - 15][x2 + 64] = id;dx[0][y2 - 15][x2 + 65] = id;dx[0][y2 - 15][x2 + 78] = id;dx[0][y2 - 15][x2 + 80] = id;dx[0][y2 - 14][x2 + 0] = id;
	dx[0][y2 - 14][x2 + 2] = id;dx[0][y2 - 14][x2 + 14] = id;dx[0][y2 - 14][x2 + 15] = id;dx[0][y2 - 14][x2 + 22] = id;dx[0][y2 - 14][x2 + 23] = id;dx[0][y2 - 14][x2 + 30] = id;dx[0][y2 - 14][x2 + 31] = id;dx[0][y2 - 14][x2 + 44] = id;dx[0][y2 - 14][x2 + 45] = id;
	dx[0][y2 - 14][x2 + 47] = id;dx[0][y2 - 14][x2 + 48] = id;dx[0][y2 - 14][x2 + 49] = id;dx[0][y2 - 14][x2 + 50] = id;dx[0][y2 - 14][x2 + 51] = id;dx[0][y2 - 14][x2 + 52] = id;dx[0][y2 - 14][x2 + 53] = id;dx[0][y2 - 14][x2 + 55] = id;dx[0][y2 - 14][x2 + 56] = id;
	dx[0][y2 - 14][x2 + 57] = id;dx[0][y2 - 14][x2 + 58] = id;dx[0][y2 - 14][x2 + 59] = id;dx[0][y2 - 14][x2 + 60] = id;dx[0][y2 - 14][x2 + 61] = id;dx[0][y2 - 14][x2 + 62] = id;dx[0][y2 - 14][x2 + 64] = id;dx[0][y2 - 14][x2 + 65] = id;dx[0][y2 - 14][x2 + 78] = id;
	dx[0][y2 - 14][x2 + 80] = id;dx[0][y2 - 13][x2 + 0] = id;dx[0][y2 - 13][x2 + 2] = id;dx[0][y2 - 13][x2 + 3] = id;dx[0][y2 - 13][x2 + 4] = id;dx[0][y2 - 13][x2 + 5] = id;dx[0][y2 - 13][x2 + 6] = id;dx[0][y2 - 13][x2 + 7] = id;dx[0][y2 - 13][x2 + 8] = id;
	dx[0][y2 - 13][x2 + 9] = id;dx[0][y2 - 13][x2 + 10] = id;dx[0][y2 - 13][x2 + 11] = id;dx[0][y2 - 13][x2 + 12] = id;dx[0][y2 - 13][x2 + 13] = id;dx[0][y2 - 13][x2 + 14] = id;dx[0][y2 - 13][x2 + 15] = id;dx[0][y2 - 13][x2 + 16] = id;dx[0][y2 - 13][x2 + 17] = id;
	dx[0][y2 - 13][x2 + 18] = id;dx[0][y2 - 13][x2 + 19] = id;dx[0][y2 - 13][x2 + 20] = id;dx[0][y2 - 13][x2 + 21] = id;dx[0][y2 - 13][x2 + 22] = id;dx[0][y2 - 13][x2 + 23] = id;dx[0][y2 - 13][x2 + 24] = id;dx[0][y2 - 13][x2 + 25] = id;dx[0][y2 - 13][x2 + 26] = id;
	dx[0][y2 - 13][x2 + 27] = id;dx[0][y2 - 13][x2 + 28] = id;dx[0][y2 - 13][x2 + 29] = id;dx[0][y2 - 13][x2 + 30] = id;dx[0][y2 - 13][x2 + 31] = id;dx[0][y2 - 13][x2 + 32] = id;dx[0][y2 - 13][x2 + 33] = id;dx[0][y2 - 13][x2 + 34] = id;dx[0][y2 - 13][x2 + 35] = id;
	dx[0][y2 - 13][x2 + 36] = id;dx[0][y2 - 13][x2 + 37] = id;dx[0][y2 - 13][x2 + 38] = id;dx[0][y2 - 13][x2 + 39] = id;dx[0][y2 - 13][x2 + 41] = id;dx[0][y2 - 13][x2 + 42] = id;dx[0][y2 - 13][x2 + 43] = id;dx[0][y2 - 13][x2 + 44] = id;dx[0][y2 - 13][x2 + 45] = id;
	dx[0][y2 - 13][x2 + 46] = id;dx[0][y2 - 13][x2 + 47] = id;dx[0][y2 - 13][x2 + 48] = id;dx[0][y2 - 13][x2 + 49] = id;dx[0][y2 - 13][x2 + 50] = id;dx[0][y2 - 13][x2 + 51] = id;dx[0][y2 - 13][x2 + 52] = id;dx[0][y2 - 13][x2 + 53] = id;dx[0][y2 - 13][x2 + 54] = id;
	dx[0][y2 - 13][x2 + 55] = id;dx[0][y2 - 13][x2 + 56] = id;dx[0][y2 - 13][x2 + 57] = id;dx[0][y2 - 13][x2 + 58] = id;dx[0][y2 - 13][x2 + 59] = id;dx[0][y2 - 13][x2 + 60] = id;dx[0][y2 - 13][x2 + 61] = id;dx[0][y2 - 13][x2 + 62] = id;dx[0][y2 - 13][x2 + 63] = id;
	dx[0][y2 - 13][x2 + 64] = id;dx[0][y2 - 13][x2 + 65] = id;dx[0][y2 - 13][x2 + 66] = id;dx[0][y2 - 13][x2 + 67] = id;dx[0][y2 - 13][x2 + 68] = id;dx[0][y2 - 13][x2 + 69] = id;dx[0][y2 - 13][x2 + 70] = id;dx[0][y2 - 13][x2 + 71] = id;dx[0][y2 - 13][x2 + 72] = id;
	dx[0][y2 - 13][x2 + 73] = id;dx[0][y2 - 13][x2 + 74] = id;dx[0][y2 - 13][x2 + 75] = id;dx[0][y2 - 13][x2 + 76] = id;dx[0][y2 - 13][x2 + 77] = id;dx[0][y2 - 13][x2 + 78] = id;dx[0][y2 - 13][x2 + 80] = id;dx[0][y2 - 12][x2 + 0] = id;dx[0][y2 - 12][x2 + 2] = id;
	dx[0][y2 - 12][x2 + 3] = id;dx[0][y2 - 12][x2 + 4] = id;dx[0][y2 - 12][x2 + 5] = id;dx[0][y2 - 12][x2 + 6] = id;dx[0][y2 - 12][x2 + 7] = id;dx[0][y2 - 12][x2 + 8] = id;dx[0][y2 - 12][x2 + 9] = id;dx[0][y2 - 12][x2 + 10] = id;dx[0][y2 - 12][x2 + 11] = id;
	dx[0][y2 - 12][x2 + 12] = id;dx[0][y2 - 12][x2 + 13] = id;dx[0][y2 - 12][x2 + 14] = id;dx[0][y2 - 12][x2 + 15] = id;dx[0][y2 - 12][x2 + 16] = id;dx[0][y2 - 12][x2 + 17] = id;dx[0][y2 - 12][x2 + 18] = id;dx[0][y2 - 12][x2 + 19] = id;dx[0][y2 - 12][x2 + 20] = id;
	dx[0][y2 - 12][x2 + 21] = id;dx[0][y2 - 12][x2 + 22] = id;dx[0][y2 - 12][x2 + 23] = id;dx[0][y2 - 12][x2 + 24] = id;dx[0][y2 - 12][x2 + 25] = id;dx[0][y2 - 12][x2 + 26] = id;dx[0][y2 - 12][x2 + 27] = id;dx[0][y2 - 12][x2 + 28] = id;dx[0][y2 - 12][x2 + 29] = id;
	dx[0][y2 - 12][x2 + 30] = id;dx[0][y2 - 12][x2 + 31] = id;dx[0][y2 - 12][x2 + 32] = id;dx[0][y2 - 12][x2 + 33] = id;dx[0][y2 - 12][x2 + 34] = id;dx[0][y2 - 12][x2 + 35] = id;dx[0][y2 - 12][x2 + 36] = id;dx[0][y2 - 12][x2 + 37] = id;dx[0][y2 - 12][x2 + 38] = id;
	dx[0][y2 - 12][x2 + 39] = id;dx[0][y2 - 12][x2 + 59] = id;dx[0][y2 - 12][x2 + 60] = id;dx[0][y2 - 12][x2 + 61] = id;dx[0][y2 - 12][x2 + 62] = id;dx[0][y2 - 12][x2 + 63] = id;dx[0][y2 - 12][x2 + 64] = id;dx[0][y2 - 12][x2 + 65] = id;dx[0][y2 - 12][x2 + 66] = id;
	dx[0][y2 - 12][x2 + 67] = id;dx[0][y2 - 12][x2 + 68] = id;dx[0][y2 - 12][x2 + 69] = id;dx[0][y2 - 12][x2 + 70] = id;dx[0][y2 - 12][x2 + 71] = id;dx[0][y2 - 12][x2 + 72] = id;dx[0][y2 - 12][x2 + 73] = id;dx[0][y2 - 12][x2 + 78] = id;dx[0][y2 - 12][x2 + 80] = id;
	dx[0][y2 - 11][x2 + 0] = id;dx[0][y2 - 11][x2 + 2] = id;dx[0][y2 - 11][x2 + 14] = id;dx[0][y2 - 11][x2 + 15] = id;dx[0][y2 - 11][x2 + 22] = id;dx[0][y2 - 11][x2 + 23] = id;dx[0][y2 - 11][x2 + 30] = id;dx[0][y2 - 11][x2 + 31] = id;dx[0][y2 - 11][x2 + 59] = id;
	dx[0][y2 - 11][x2 + 60] = id;dx[0][y2 - 11][x2 + 61] = id;dx[0][y2 - 11][x2 + 71] = id;dx[0][y2 - 11][x2 + 72] = id;dx[0][y2 - 11][x2 + 73] = id;dx[0][y2 - 11][x2 + 78] = id;dx[0][y2 - 11][x2 + 80] = id;dx[0][y2 - 10][x2 + 0] = id;dx[0][y2 - 10][x2 + 2] = id;
	dx[0][y2 - 10][x2 + 14] = id;dx[0][y2 - 10][x2 + 15] = id;dx[0][y2 - 10][x2 + 22] = id;dx[0][y2 - 10][x2 + 23] = id;dx[0][y2 - 10][x2 + 30] = id;dx[0][y2 - 10][x2 + 31] = id;dx[0][y2 - 10][x2 + 41] = id;dx[0][y2 - 10][x2 + 42] = id;dx[0][y2 - 10][x2 + 43] = id;
	dx[0][y2 - 10][x2 + 44] = id;dx[0][y2 - 10][x2 + 45] = id;dx[0][y2 - 10][x2 + 46] = id;dx[0][y2 - 10][x2 + 47] = id;dx[0][y2 - 10][x2 + 48] = id;dx[0][y2 - 10][x2 + 49] = id;dx[0][y2 - 10][x2 + 50] = id;dx[0][y2 - 10][x2 + 51] = id;dx[0][y2 - 10][x2 + 52] = id;
	dx[0][y2 - 10][x2 + 53] = id;dx[0][y2 - 10][x2 + 54] = id;dx[0][y2 - 10][x2 + 55] = id;dx[0][y2 - 10][x2 + 56] = id;dx[0][y2 - 10][x2 + 57] = id;dx[0][y2 - 10][x2 + 58] = id;dx[0][y2 - 10][x2 + 59] = id;dx[0][y2 - 10][x2 + 60] = id;dx[0][y2 - 10][x2 + 72] = id;
	dx[0][y2 - 10][x2 + 73] = id;dx[0][y2 - 10][x2 + 74] = id;dx[0][y2 - 10][x2 + 75] = id;dx[0][y2 - 10][x2 + 76] = id;dx[0][y2 - 10][x2 + 77] = id;dx[0][y2 - 10][x2 + 78] = id;dx[0][y2 - 10][x2 + 80] = id;dx[0][y2 - 9][x2 + 0] = id;dx[0][y2 - 9][x2 + 2] = id;
	dx[0][y2 - 9][x2 + 3] = id;dx[0][y2 - 9][x2 + 4] = id;dx[0][y2 - 9][x2 + 5] = id;dx[0][y2 - 9][x2 + 6] = id;dx[0][y2 - 9][x2 + 7] = id;dx[0][y2 - 9][x2 + 8] = id;dx[0][y2 - 9][x2 + 9] = id;dx[0][y2 - 9][x2 + 10] = id;dx[0][y2 - 9][x2 + 11] = id;
	dx[0][y2 - 9][x2 + 12] = id;dx[0][y2 - 9][x2 + 13] = id;dx[0][y2 - 9][x2 + 14] = id;dx[0][y2 - 9][x2 + 15] = id;dx[0][y2 - 9][x2 + 22] = id;dx[0][y2 - 9][x2 + 23] = id;dx[0][y2 - 9][x2 + 30] = id;dx[0][y2 - 9][x2 + 31] = id;dx[0][y2 - 9][x2 + 32] = id;
	dx[0][y2 - 9][x2 + 33] = id;dx[0][y2 - 9][x2 + 34] = id;dx[0][y2 - 9][x2 + 35] = id;dx[0][y2 - 9][x2 + 36] = id;dx[0][y2 - 9][x2 + 37] = id;dx[0][y2 - 9][x2 + 38] = id;dx[0][y2 - 9][x2 + 39] = id;dx[0][y2 - 9][x2 + 41] = id;dx[0][y2 - 9][x2 + 42] = id;
	dx[0][y2 - 9][x2 + 43] = id;dx[0][y2 - 9][x2 + 44] = id;dx[0][y2 - 9][x2 + 45] = id;dx[0][y2 - 9][x2 + 46] = id;dx[0][y2 - 9][x2 + 47] = id;dx[0][y2 - 9][x2 + 48] = id;dx[0][y2 - 9][x2 + 49] = id;dx[0][y2 - 9][x2 + 50] = id;dx[0][y2 - 9][x2 + 51] = id;
	dx[0][y2 - 9][x2 + 52] = id;dx[0][y2 - 9][x2 + 53] = id;dx[0][y2 - 9][x2 + 54] = id;dx[0][y2 - 9][x2 + 55] = id;dx[0][y2 - 9][x2 + 56] = id;dx[0][y2 - 9][x2 + 57] = id;dx[0][y2 - 9][x2 + 58] = id;dx[0][y2 - 9][x2 + 59] = id;dx[0][y2 - 9][x2 + 60] = id;
	dx[0][y2 - 9][x2 + 72] = id;dx[0][y2 - 9][x2 + 73] = id;dx[0][y2 - 9][x2 + 74] = id;dx[0][y2 - 9][x2 + 75] = id;dx[0][y2 - 9][x2 + 76] = id;dx[0][y2 - 9][x2 + 77] = id;dx[0][y2 - 9][x2 + 78] = id;dx[0][y2 - 9][x2 + 80] = id;dx[0][y2 - 8][x2 + 0] = id;
	dx[0][y2 - 8][x2 + 2] = id;dx[0][y2 - 8][x2 + 3] = id;dx[0][y2 - 8][x2 + 4] = id;dx[0][y2 - 8][x2 + 5] = id;dx[0][y2 - 8][x2 + 6] = id;dx[0][y2 - 8][x2 + 7] = id;dx[0][y2 - 8][x2 + 8] = id;dx[0][y2 - 8][x2 + 9] = id;dx[0][y2 - 8][x2 + 10] = id;
	dx[0][y2 - 8][x2 + 11] = id;dx[0][y2 - 8][x2 + 12] = id;dx[0][y2 - 8][x2 + 13] = id;dx[0][y2 - 8][x2 + 14] = id;dx[0][y2 - 8][x2 + 15] = id;dx[0][y2 - 8][x2 + 22] = id;dx[0][y2 - 8][x2 + 23] = id;dx[0][y2 - 8][x2 + 30] = id;dx[0][y2 - 8][x2 + 31] = id;
	dx[0][y2 - 8][x2 + 32] = id;dx[0][y2 - 8][x2 + 33] = id;dx[0][y2 - 8][x2 + 34] = id;dx[0][y2 - 8][x2 + 35] = id;dx[0][y2 - 8][x2 + 36] = id;dx[0][y2 - 8][x2 + 37] = id;dx[0][y2 - 8][x2 + 38] = id;dx[0][y2 - 8][x2 + 39] = id;dx[0][y2 - 8][x2 + 59] = id;
	dx[0][y2 - 8][x2 + 60] = id;dx[0][y2 - 8][x2 + 69] = id;dx[0][y2 - 8][x2 + 72] = id;dx[0][y2 - 8][x2 + 73] = id;dx[0][y2 - 8][x2 + 78] = id;dx[0][y2 - 8][x2 + 80] = id;dx[0][y2 - 7][x2 + 0] = id;dx[0][y2 - 7][x2 + 2] = id;dx[0][y2 - 7][x2 + 14] = id;
	dx[0][y2 - 7][x2 + 15] = id;dx[0][y2 - 7][x2 + 16] = id;dx[0][y2 - 7][x2 + 17] = id;dx[0][y2 - 7][x2 + 18] = id;dx[0][y2 - 7][x2 + 19] = id;dx[0][y2 - 7][x2 + 20] = id;dx[0][y2 - 7][x2 + 21] = id;dx[0][y2 - 7][x2 + 22] = id;dx[0][y2 - 7][x2 + 23] = id;
	dx[0][y2 - 7][x2 + 24] = id;dx[0][y2 - 7][x2 + 25] = id;dx[0][y2 - 7][x2 + 26] = id;dx[0][y2 - 7][x2 + 27] = id;dx[0][y2 - 7][x2 + 28] = id;dx[0][y2 - 7][x2 + 29] = id;dx[0][y2 - 7][x2 + 30] = id;dx[0][y2 - 7][x2 + 31] = id;dx[0][y2 - 7][x2 + 41] = id;
	dx[0][y2 - 7][x2 + 42] = id;dx[0][y2 - 7][x2 + 43] = id;dx[0][y2 - 7][x2 + 44] = id;dx[0][y2 - 7][x2 + 45] = id;dx[0][y2 - 7][x2 + 46] = id;dx[0][y2 - 7][x2 + 47] = id;dx[0][y2 - 7][x2 + 48] = id;dx[0][y2 - 7][x2 + 49] = id;dx[0][y2 - 7][x2 + 50] = id;
	dx[0][y2 - 7][x2 + 51] = id;dx[0][y2 - 7][x2 + 52] = id;dx[0][y2 - 7][x2 + 53] = id;dx[0][y2 - 7][x2 + 54] = id;dx[0][y2 - 7][x2 + 55] = id;dx[0][y2 - 7][x2 + 56] = id;dx[0][y2 - 7][x2 + 57] = id;dx[0][y2 - 7][x2 + 58] = id;dx[0][y2 - 7][x2 + 59] = id;
	dx[0][y2 - 7][x2 + 60] = id;dx[0][y2 - 7][x2 + 72] = id;dx[0][y2 - 7][x2 + 73] = id;dx[0][y2 - 7][x2 + 74] = id;dx[0][y2 - 7][x2 + 75] = id;dx[0][y2 - 7][x2 + 76] = id;dx[0][y2 - 7][x2 + 77] = id;dx[0][y2 - 7][x2 + 78] = id;dx[0][y2 - 7][x2 + 80] = id;
	dx[0][y2 - 6][x2 + 0] = id;dx[0][y2 - 6][x2 + 2] = id;dx[0][y2 - 6][x2 + 41] = id;dx[0][y2 - 6][x2 + 42] = id;dx[0][y2 - 6][x2 + 43] = id;dx[0][y2 - 6][x2 + 44] = id;dx[0][y2 - 6][x2 + 45] = id;dx[0][y2 - 6][x2 + 46] = id;dx[0][y2 - 6][x2 + 47] = id;
	dx[0][y2 - 6][x2 + 48] = id;dx[0][y2 - 6][x2 + 49] = id;dx[0][y2 - 6][x2 + 50] = id;dx[0][y2 - 6][x2 + 51] = id;dx[0][y2 - 6][x2 + 52] = id;dx[0][y2 - 6][x2 + 53] = id;dx[0][y2 - 6][x2 + 54] = id;dx[0][y2 - 6][x2 + 55] = id;dx[0][y2 - 6][x2 + 56] = id;
	dx[0][y2 - 6][x2 + 57] = id;dx[0][y2 - 6][x2 + 58] = id;dx[0][y2 - 6][x2 + 59] = id;dx[0][y2 - 6][x2 + 60] = id;dx[0][y2 - 6][x2 + 72] = id;dx[0][y2 - 6][x2 + 73] = id;dx[0][y2 - 6][x2 + 74] = id;dx[0][y2 - 6][x2 + 75] = id;dx[0][y2 - 6][x2 + 76] = id;
	dx[0][y2 - 6][x2 + 77] = id;dx[0][y2 - 6][x2 + 78] = id;dx[0][y2 - 6][x2 + 79] = id;dx[0][y2 - 6][x2 + 80] = id;dx[0][y2 - 5][x2 + 0] = id;dx[0][y2 - 5][x2 + 2] = id;dx[0][y2 - 5][x2 + 3] = id;dx[0][y2 - 5][x2 + 4] = id;dx[0][y2 - 5][x2 + 5] = id;
	dx[0][y2 - 5][x2 + 6] = id;dx[0][y2 - 5][x2 + 7] = id;dx[0][y2 - 5][x2 + 8] = id;dx[0][y2 - 5][x2 + 9] = id;dx[0][y2 - 5][x2 + 10] = id;dx[0][y2 - 5][x2 + 11] = id;dx[0][y2 - 5][x2 + 12] = id;dx[0][y2 - 5][x2 + 13] = id;dx[0][y2 - 5][x2 + 14] = id;
	dx[0][y2 - 5][x2 + 15] = id;dx[0][y2 - 5][x2 + 16] = id;dx[0][y2 - 5][x2 + 17] = id;dx[0][y2 - 5][x2 + 18] = id;dx[0][y2 - 5][x2 + 19] = id;dx[0][y2 - 5][x2 + 20] = id;dx[0][y2 - 5][x2 + 21] = id;dx[0][y2 - 5][x2 + 22] = id;dx[0][y2 - 5][x2 + 23] = id;
	dx[0][y2 - 5][x2 + 24] = id;dx[0][y2 - 5][x2 + 25] = id;dx[0][y2 - 5][x2 + 26] = id;dx[0][y2 - 5][x2 + 27] = id;dx[0][y2 - 5][x2 + 28] = id;dx[0][y2 - 5][x2 + 29] = id;dx[0][y2 - 5][x2 + 30] = id;dx[0][y2 - 5][x2 + 31] = id;dx[0][y2 - 5][x2 + 32] = id;
	dx[0][y2 - 5][x2 + 33] = id;dx[0][y2 - 5][x2 + 34] = id;dx[0][y2 - 5][x2 + 35] = id;dx[0][y2 - 5][x2 + 36] = id;dx[0][y2 - 5][x2 + 37] = id;dx[0][y2 - 5][x2 + 38] = id;dx[0][y2 - 5][x2 + 39] = id;dx[0][y2 - 5][x2 + 59] = id;dx[0][y2 - 5][x2 + 60] = id;
	dx[0][y2 - 5][x2 + 72] = id;dx[0][y2 - 5][x2 + 73] = id;dx[0][y2 - 5][x2 + 78] = id;dx[0][y2 - 5][x2 + 80] = id;dx[0][y2 - 4][x2 + 0] = id;dx[0][y2 - 4][x2 + 2] = id;dx[0][y2 - 4][x2 + 3] = id;dx[0][y2 - 4][x2 + 4] = id;dx[0][y2 - 4][x2 + 5] = id;
	dx[0][y2 - 4][x2 + 6] = id;dx[0][y2 - 4][x2 + 7] = id;dx[0][y2 - 4][x2 + 8] = id;dx[0][y2 - 4][x2 + 9] = id;dx[0][y2 - 4][x2 + 10] = id;dx[0][y2 - 4][x2 + 11] = id;dx[0][y2 - 4][x2 + 12] = id;dx[0][y2 - 4][x2 + 13] = id;dx[0][y2 - 4][x2 + 14] = id;
	dx[0][y2 - 4][x2 + 15] = id;dx[0][y2 - 4][x2 + 16] = id;dx[0][y2 - 4][x2 + 17] = id;dx[0][y2 - 4][x2 + 18] = id;dx[0][y2 - 4][x2 + 19] = id;dx[0][y2 - 4][x2 + 20] = id;dx[0][y2 - 4][x2 + 21] = id;dx[0][y2 - 4][x2 + 22] = id;dx[0][y2 - 4][x2 + 23] = id;
	dx[0][y2 - 4][x2 + 24] = id;dx[0][y2 - 4][x2 + 25] = id;dx[0][y2 - 4][x2 + 26] = id;dx[0][y2 - 4][x2 + 27] = id;dx[0][y2 - 4][x2 + 28] = id;dx[0][y2 - 4][x2 + 29] = id;dx[0][y2 - 4][x2 + 30] = id;dx[0][y2 - 4][x2 + 31] = id;dx[0][y2 - 4][x2 + 32] = id;
	dx[0][y2 - 4][x2 + 33] = id;dx[0][y2 - 4][x2 + 34] = id;dx[0][y2 - 4][x2 + 35] = id;dx[0][y2 - 4][x2 + 36] = id;dx[0][y2 - 4][x2 + 37] = id;dx[0][y2 - 4][x2 + 38] = id;dx[0][y2 - 4][x2 + 39] = id;dx[0][y2 - 4][x2 + 40] = id;dx[0][y2 - 4][x2 + 41] = id;
	dx[0][y2 - 4][x2 + 42] = id;dx[0][y2 - 4][x2 + 43] = id;dx[0][y2 - 4][x2 + 44] = id;dx[0][y2 - 4][x2 + 45] = id;dx[0][y2 - 4][x2 + 46] = id;dx[0][y2 - 4][x2 + 47] = id;dx[0][y2 - 4][x2 + 48] = id;dx[0][y2 - 4][x2 + 49] = id;dx[0][y2 - 4][x2 + 50] = id;
	dx[0][y2 - 4][x2 + 51] = id;dx[0][y2 - 4][x2 + 52] = id;dx[0][y2 - 4][x2 + 53] = id;dx[0][y2 - 4][x2 + 54] = id;dx[0][y2 - 4][x2 + 55] = id;dx[0][y2 - 4][x2 + 56] = id;dx[0][y2 - 4][x2 + 57] = id;dx[0][y2 - 4][x2 + 58] = id;dx[0][y2 - 4][x2 + 59] = id;
	dx[0][y2 - 4][x2 + 60] = id;dx[0][y2 - 4][x2 + 61] = id;dx[0][y2 - 4][x2 + 62] = id;dx[0][y2 - 4][x2 + 63] = id;dx[0][y2 - 4][x2 + 64] = id;dx[0][y2 - 4][x2 + 65] = id;dx[0][y2 - 4][x2 + 66] = id;dx[0][y2 - 4][x2 + 67] = id;dx[0][y2 - 4][x2 + 68] = id;
	dx[0][y2 - 4][x2 + 69] = id;dx[0][y2 - 4][x2 + 70] = id;dx[0][y2 - 4][x2 + 71] = id;dx[0][y2 - 4][x2 + 72] = id;dx[0][y2 - 4][x2 + 73] = id;dx[0][y2 - 4][x2 + 74] = id;dx[0][y2 - 4][x2 + 75] = id;dx[0][y2 - 4][x2 + 76] = id;dx[0][y2 - 4][x2 + 77] = id;
	dx[0][y2 - 4][x2 + 78] = id;dx[0][y2 - 4][x2 + 80] = id;dx[0][y2 - 3][x2 + 0] = id;dx[0][y2 - 3][x2 + 2] = id;dx[0][y2 - 3][x2 + 61] = 2;dx[0][y2 - 3][x2 + 62] = 2;dx[0][y2 - 3][x2 + 63] = 2;dx[0][y2 - 3][x2 + 64] = 2;dx[0][y2 - 3][x2 + 65] = 2;
	dx[0][y2 - 3][x2 + 66] = 2;dx[0][y2 - 3][x2 + 67] = 2;dx[0][y2 - 3][x2 + 68] = 2;dx[0][y2 - 3][x2 + 69] = 2;dx[0][y2 - 3][x2 + 70] = 2;dx[0][y2 - 3][x2 + 78] = id;dx[0][y2 - 3][x2 + 80] = id;dx[0][y2 - 2][x2 + 0] = id;dx[0][y2 - 2][x2 + 2] = id;
	dx[0][y2 - 2][x2 + 3] = id;dx[0][y2 - 2][x2 + 4] = id;dx[0][y2 - 2][x2 + 5] = id;dx[0][y2 - 2][x2 + 6] = id;dx[0][y2 - 2][x2 + 7] = id;dx[0][y2 - 2][x2 + 8] = id;dx[0][y2 - 2][x2 + 9] = id;dx[0][y2 - 2][x2 + 10] = id;dx[0][y2 - 2][x2 + 11] = id;
	dx[0][y2 - 2][x2 + 12] = id;dx[0][y2 - 2][x2 + 13] = id;dx[0][y2 - 2][x2 + 14] = id;dx[0][y2 - 2][x2 + 15] = id;dx[0][y2 - 2][x2 + 16] = id;dx[0][y2 - 2][x2 + 17] = id;dx[0][y2 - 2][x2 + 18] = id;dx[0][y2 - 2][x2 + 19] = id;dx[0][y2 - 2][x2 + 20] = id;
	dx[0][y2 - 2][x2 + 21] = id;dx[0][y2 - 2][x2 + 22] = id;dx[0][y2 - 2][x2 + 23] = id;dx[0][y2 - 2][x2 + 24] = id;dx[0][y2 - 2][x2 + 25] = id;dx[0][y2 - 2][x2 + 26] = id;dx[0][y2 - 2][x2 + 27] = id;dx[0][y2 - 2][x2 + 28] = id;dx[0][y2 - 2][x2 + 29] = id;
	dx[0][y2 - 2][x2 + 30] = id;dx[0][y2 - 2][x2 + 31] = id;dx[0][y2 - 2][x2 + 32] = id;dx[0][y2 - 2][x2 + 33] = id;dx[0][y2 - 2][x2 + 34] = id;dx[0][y2 - 2][x2 + 35] = id;dx[0][y2 - 2][x2 + 36] = id;dx[0][y2 - 2][x2 + 37] = id;dx[0][y2 - 2][x2 + 38] = id;
	dx[0][y2 - 2][x2 + 39] = id;dx[0][y2 - 2][x2 + 40] = id;dx[0][y2 - 2][x2 + 41] = id;dx[0][y2 - 2][x2 + 42] = id;dx[0][y2 - 2][x2 + 43] = id;dx[0][y2 - 2][x2 + 44] = id;dx[0][y2 - 2][x2 + 45] = id;dx[0][y2 - 2][x2 + 46] = id;dx[0][y2 - 2][x2 + 47] = id;
	dx[0][y2 - 2][x2 + 48] = id;dx[0][y2 - 2][x2 + 49] = id;dx[0][y2 - 2][x2 + 50] = id;dx[0][y2 - 2][x2 + 51] = id;dx[0][y2 - 2][x2 + 52] = id;dx[0][y2 - 2][x2 + 53] = id;dx[0][y2 - 2][x2 + 54] = id;dx[0][y2 - 2][x2 + 55] = id;dx[0][y2 - 2][x2 + 56] = id;
	dx[0][y2 - 2][x2 + 57] = id;dx[0][y2 - 2][x2 + 58] = id;dx[0][y2 - 2][x2 + 59] = id;dx[0][y2 - 2][x2 + 60] = id;dx[0][y2 - 2][x2 + 61] = id;dx[0][y2 - 2][x2 + 62] = id;dx[0][y2 - 2][x2 + 63] = id;dx[0][y2 - 2][x2 + 64] = id;dx[0][y2 - 2][x2 + 65] = id;
	dx[0][y2 - 2][x2 + 66] = id;dx[0][y2 - 2][x2 + 67] = id;dx[0][y2 - 2][x2 + 68] = id;dx[0][y2 - 2][x2 + 69] = id;dx[0][y2 - 2][x2 + 70] = id;dx[0][y2 - 2][x2 + 71] = id;dx[0][y2 - 2][x2 + 72] = id;dx[0][y2 - 2][x2 + 73] = id;dx[0][y2 - 2][x2 + 74] = id;
	dx[0][y2 - 2][x2 + 75] = id;dx[0][y2 - 2][x2 + 76] = id;dx[0][y2 - 2][x2 + 77] = id;dx[0][y2 - 2][x2 + 78] = id;dx[0][y2 - 2][x2 + 80] = id;dx[0][y2 - 1][x2 + 0] = id;dx[0][y2 - 1][x2 + 2] = id;dx[0][y2 - 1][x2 + 59] = id;dx[0][y2 - 1][x2 + 60] = id;
	dx[0][y2 - 1][x2 + 61] = id;dx[0][y2 - 1][x2 + 62] = id;dx[0][y2 - 1][x2 + 63] = id;dx[0][y2 - 1][x2 + 64] = id;dx[0][y2 - 1][x2 + 65] = id;dx[0][y2 - 1][x2 + 66] = id;dx[0][y2 - 1][x2 + 67] = id;dx[0][y2 - 1][x2 + 68] = id;dx[0][y2 - 1][x2 + 69] = id;
	dx[0][y2 - 1][x2 + 70] = id;dx[0][y2 - 1][x2 + 71] = id;dx[0][y2 - 1][x2 + 72] = id;dx[0][y2 - 1][x2 + 73] = id;dx[0][y2 - 1][x2 + 78] = id;dx[0][y2 - 1][x2 + 80] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 78] = id;
	dx[0][y2 + 0][x2 + 80] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 1][x2 + 57] = id;dx[0][y2 + 1][x2 + 58] = 2;dx[0][y2 + 1][x2 + 59] = 2;dx[0][y2 + 1][x2 + 60] = 2;dx[0][y2 + 1][x2 + 61] = 2;dx[0][y2 + 1][x2 + 62] = 2;
	dx[0][y2 + 1][x2 + 63] = 2;dx[0][y2 + 1][x2 + 64] = 2;dx[0][y2 + 1][x2 + 65] = 2;dx[0][y2 + 1][x2 + 66] = 2;dx[0][y2 + 1][x2 + 67] = 2;dx[0][y2 + 1][x2 + 68] = 2;dx[0][y2 + 1][x2 + 69] = 2;dx[0][y2 + 1][x2 + 70] = 2;dx[0][y2 + 1][x2 + 71] = 2;
	dx[0][y2 + 1][x2 + 72] = 2;dx[0][y2 + 1][x2 + 73] = 2;dx[0][y2 + 1][x2 + 74] = 2;dx[0][y2 + 1][x2 + 75] = 2;dx[0][y2 + 1][x2 + 78] = id;dx[0][y2 + 1][x2 + 80] = id;dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 2] = id;dx[0][y2 + 2][x2 + 78] = id;
	dx[0][y2 + 2][x2 + 80] = id;dx[0][y2 + 3][x2 + 0] = id;dx[0][y2 + 3][x2 + 2] = id;dx[0][y2 + 3][x2 + 78] = id;dx[0][y2 + 3][x2 + 80] = id;dx[0][y2 + 4][x2 + 0] = id;dx[0][y2 + 4][x2 + 2] = id;dx[0][y2 + 4][x2 + 78] = id;dx[0][y2 + 4][x2 + 80] = id;
}

void stick(int x1, int y1,int *step)
{
    #define 基础倍时 8*8
	int x2 = x1 + 30 + 30;
	int y2 = 600 - y1;
	int id = 15;
	int y=-4;
	
	int dance;
	int lengh=5;

	dance = (*step)/8-4;
	lengh = 5 + ((16-dance*dance) / 8);
	if ((*step)++ > 2 * 基础倍时) 
	{ *step = 0;dance = (*step) / 8 - 4; 
	lengh = 5 + ((16 - dance * dance) / 8);
	}
	else 
	{
		if (*step > 基础倍时 + 1) 
		{ dance = 12 - (*step) / 8;lengh = 5 - ((16 - dance * dance) / 8); }
	}
	y = dance;
	for (int a = 1;a < 7;a++)
	{
		dx[2][y2 + a][x2 - 1] = id;
	}
	if (y > 1) {
		dx[2][y2 + 1][x2 + 18] = id;
		dx[2][y2 + 1][x2 + 19] = id;
	}
	if(y<-1)
	{
		dx[2][y2 - 1 ][x2 + 18] = id;
		dx[2][y2 - 1][x2 + 19] = id;
	}
	if(y>0)
	for(int a=1;a<y;a++)
	dx[2][y2 + a][x2 + 20] = id;
	else
		for (int a = -1;a > y ;a--)
			dx[2][y2 + a][x2 + 20] = id;
	
	
	
	//printf("[%d]\n[%d]",dance,*step);
	for(int a=0;a<lengh;a++)
	dx[2][y2 + y][x2 + 20+a] = id;

	

	
}

void well (int x1, int y1, int broken) 
{
	int id = 15;
	int x2 = x1 + 30 + 30;
	int y2 = 600 - y1;
	if (broken) 
	{
		dx[0][y2 - 8][x2 - 11] = id;dx[0][y2 - 8][x2 - 10] = id;dx[0][y2 - 8][x2 - 9] = id;dx[0][y2 - 8][x2 - 8] = id;dx[0][y2 - 8][x2 - 7] = id;dx[0][y2 - 8][x2 - 6] = id;dx[0][y2 - 8][x2 - 5] = id;dx[0][y2 - 8][x2 - 4] = id;dx[0][y2 - 8][x2 - 3] = id;
		dx[0][y2 - 8][x2 - 2] = id;dx[0][y2 - 8][x2 - 1] = id;dx[0][y2 - 8][x2 + 0] = id;dx[0][y2 - 8][x2 + 1] = id;dx[0][y2 - 8][x2 + 2] = id;dx[0][y2 - 8][x2 + 3] = id;dx[0][y2 - 8][x2 + 4] = id;dx[0][y2 - 8][x2 + 5] = id;dx[0][y2 - 8][x2 + 6] = id;
		dx[0][y2 - 7][x2 - 13] = id;dx[0][y2 - 7][x2 - 12] = id;dx[0][y2 - 7][x2 - 8] = id;dx[0][y2 - 7][x2 - 7] = id;dx[0][y2 - 7][x2 - 6] = id;dx[0][y2 - 7][x2 - 5] = id;dx[0][y2 - 7][x2 - 4] = id;dx[0][y2 - 7][x2 - 3] = id;dx[0][y2 - 7][x2 - 2] = id;
		dx[0][y2 - 7][x2 - 1] = id;dx[0][y2 - 7][x2 + 0] = id;dx[0][y2 - 7][x2 + 1] = id;dx[0][y2 - 7][x2 + 2] = id;dx[0][y2 - 7][x2 + 3] = id;dx[0][y2 - 7][x2 + 4] = id;dx[0][y2 - 7][x2 + 5] = id;dx[0][y2 - 7][x2 + 6] = id;dx[0][y2 - 7][x2 + 7] = id;
		dx[0][y2 - 7][x2 + 8] = id;dx[0][y2 - 7][x2 + 9] = id;dx[0][y2 - 7][x2 + 10] = id;dx[0][y2 - 7][x2 + 11] = id;dx[0][y2 - 7][x2 + 12] = id;dx[0][y2 - 7][x2 + 13] = id;dx[0][y2 - 7][x2 + 14] = id;dx[0][y2 - 6][x2 - 14] = id;dx[0][y2 - 6][x2 - 13] = id;
		dx[0][y2 - 6][x2 - 12] = id;dx[0][y2 - 6][x2 - 11] = id;dx[0][y2 - 6][x2 - 10] = id;dx[0][y2 - 6][x2 - 9] = id;dx[0][y2 - 6][x2 - 8] = id;dx[0][y2 - 6][x2 - 7] = id;dx[0][y2 - 6][x2 - 6] = id;dx[0][y2 - 6][x2 - 5] = id;dx[0][y2 - 6][x2 - 4] = id;
		dx[0][y2 - 6][x2 - 3] = id;dx[0][y2 - 6][x2 - 2] = id;dx[0][y2 - 6][x2 - 1] = id;dx[0][y2 - 6][x2 + 0] = id;dx[0][y2 - 6][x2 + 1] = id;dx[0][y2 - 6][x2 + 2] = id;dx[0][y2 - 6][x2 + 3] = id;dx[0][y2 - 6][x2 + 13] = id;dx[0][y2 - 6][x2 + 14] = id;
		dx[0][y2 - 6][x2 + 15] = id;dx[0][y2 - 5][x2 - 13] = id;dx[0][y2 - 5][x2 - 12] = id;dx[0][y2 - 5][x2 - 11] = id;dx[0][y2 - 5][x2 - 10] = id;dx[0][y2 - 5][x2 - 9] = id;dx[0][y2 - 5][x2 - 8] = id;dx[0][y2 - 5][x2 - 7] = id;dx[0][y2 - 5][x2 - 6] = id;
		dx[0][y2 - 5][x2 - 5] = id;dx[0][y2 - 5][x2 - 4] = id;dx[0][y2 - 5][x2 - 3] = id;dx[0][y2 - 5][x2 - 2] = id;dx[0][y2 - 5][x2 - 1] = id;dx[0][y2 - 5][x2 + 0] = id;dx[0][y2 - 5][x2 + 1] = id;dx[0][y2 - 5][x2 + 2] = id;dx[0][y2 - 5][x2 + 3] = id;
		dx[0][y2 - 5][x2 + 4] = id;dx[0][y2 - 5][x2 + 5] = id;dx[0][y2 - 5][x2 + 6] = id;dx[0][y2 - 5][x2 + 7] = id;dx[0][y2 - 5][x2 + 8] = id;dx[0][y2 - 5][x2 + 9] = id;dx[0][y2 - 5][x2 + 10] = id;dx[0][y2 - 5][x2 + 11] = id;dx[0][y2 - 5][x2 + 12] = id;
		dx[0][y2 - 5][x2 + 13] = id;dx[0][y2 - 5][x2 + 14] = id;dx[0][y2 - 5][x2 + 15] = id;dx[0][y2 - 5][x2 + 16] = id;dx[0][y2 - 4][x2 - 14] = id;dx[0][y2 - 4][x2 - 13] = id;dx[0][y2 - 4][x2 - 12] = id;dx[0][y2 - 4][x2 - 11] = id;dx[0][y2 - 4][x2 - 10] = id;
		dx[0][y2 - 4][x2 - 2] = id;dx[0][y2 - 4][x2 - 1] = id;dx[0][y2 - 4][x2 + 0] = id;dx[0][y2 - 4][x2 + 1] = id;dx[0][y2 - 4][x2 + 2] = id;dx[0][y2 - 4][x2 + 3] = id;dx[0][y2 - 4][x2 + 4] = id;dx[0][y2 - 4][x2 + 5] = id;dx[0][y2 - 4][x2 + 6] = id;
		dx[0][y2 - 4][x2 + 7] = id;dx[0][y2 - 4][x2 + 14] = id;dx[0][y2 - 4][x2 + 15] = id;dx[0][y2 - 4][x2 + 16] = id;dx[0][y2 - 3][x2 - 14] = id;dx[0][y2 - 3][x2 - 13] = id;dx[0][y2 - 3][x2 + 14] = id;dx[0][y2 - 3][x2 + 15] = id;dx[0][y2 - 2][x2 - 14] = id;
		dx[0][y2 - 2][x2 - 13] = id;dx[0][y2 - 2][x2 + 14] = id;dx[0][y2 - 2][x2 + 15] = id;dx[0][y2 - 1][x2 - 14] = id;dx[0][y2 - 1][x2 - 13] = id;dx[0][y2 - 1][x2 - 1] = id;dx[0][y2 - 1][x2 + 1] = id;dx[0][y2 - 1][x2 + 3] = id;dx[0][y2 - 1][x2 + 5] = id;
		dx[0][y2 - 1][x2 + 7] = id;dx[0][y2 - 1][x2 + 14] = id;dx[0][y2 - 1][x2 + 15] = id;dx[0][y2 + 0][x2 - 14] = id;dx[0][y2 + 0][x2 - 13] = id;dx[0][y2 + 0][x2 - 12] = id;dx[0][y2 + 0][x2 - 11] = id;dx[0][y2 + 0][x2 - 10] = id;dx[0][y2 + 0][x2 - 9] = id;
		dx[0][y2 + 0][x2 - 8] = id;dx[0][y2 + 0][x2 - 7] = id;dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;
		dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;dx[0][y2 + 0][x2 + 7] = id;dx[0][y2 + 0][x2 + 8] = id;dx[0][y2 + 0][x2 + 9] = id;
		dx[0][y2 + 0][x2 + 10] = id;dx[0][y2 + 0][x2 + 11] = id;dx[0][y2 + 0][x2 + 12] = id;dx[0][y2 + 0][x2 + 13] = id;dx[0][y2 + 0][x2 + 14] = id;dx[0][y2 + 0][x2 + 15] = id;dx[0][y2 + 0][x2 + 16] = id;dx[0][y2 + 0][x2 + 17] = id;dx[0][y2 + 0][x2 + 18] = id;
		dx[0][y2 + 0][x2 + 19] = id;dx[0][y2 + 1][x2 - 14] = id;dx[0][y2 + 1][x2 - 13] = id;dx[0][y2 + 1][x2 - 1] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 1][x2 + 4] = id;dx[0][y2 + 1][x2 + 6] = id;dx[0][y2 + 1][x2 + 8] = id;
		dx[0][y2 + 1][x2 + 14] = id;dx[0][y2 + 1][x2 + 15] = id;dx[0][y2 + 2][x2 - 14] = id;dx[0][y2 + 2][x2 - 13] = id;dx[0][y2 + 2][x2 - 1] = id;dx[0][y2 + 2][x2 + 14] = id;dx[0][y2 + 2][x2 + 15] = id;dx[0][y2 + 3][x2 - 14] = id;dx[0][y2 + 3][x2 - 13] = id;
		dx[0][y2 + 3][x2 + 14] = id;dx[0][y2 + 3][x2 + 15] = id;dx[0][y2 + 4][x2 - 14] = id;dx[0][y2 + 4][x2 - 13] = id;dx[0][y2 + 4][x2 + 14] = id;dx[0][y2 + 4][x2 + 15] = id;dx[0][y2 + 5][x2 - 14] = id;dx[0][y2 + 5][x2 - 13] = id;dx[0][y2 + 5][x2 + 14] = id;
		dx[0][y2 + 5][x2 + 15] = id;dx[0][y2 + 6][x2 - 14] = id;dx[0][y2 + 6][x2 - 13] = id;dx[0][y2 + 6][x2 + 14] = id;dx[0][y2 + 6][x2 + 15] = id;dx[0][y2 + 7][x2 - 17] = id;dx[0][y2 + 7][x2 - 16] = id;dx[0][y2 + 7][x2 - 15] = id;dx[0][y2 + 7][x2 - 14] = id;
		dx[0][y2 + 7][x2 - 13] = id;dx[0][y2 + 7][x2 - 12] = id;dx[0][y2 + 7][x2 - 11] = id;dx[0][y2 + 7][x2 - 10] = id;dx[0][y2 + 7][x2 - 9] = id;dx[0][y2 + 7][x2 - 8] = id;dx[0][y2 + 7][x2 - 7] = id;dx[0][y2 + 7][x2 - 6] = id;dx[0][y2 + 7][x2 - 5] = id;
		dx[0][y2 + 7][x2 - 4] = id;dx[0][y2 + 7][x2 - 3] = id;dx[0][y2 + 7][x2 - 2] = id;dx[0][y2 + 7][x2 - 1] = id;dx[0][y2 + 7][x2 + 0] = id;dx[0][y2 + 7][x2 + 1] = id;dx[0][y2 + 7][x2 + 2] = id;dx[0][y2 + 7][x2 + 3] = id;dx[0][y2 + 7][x2 + 4] = id;
		dx[0][y2 + 7][x2 + 5] = id;dx[0][y2 + 7][x2 + 6] = id;dx[0][y2 + 7][x2 + 7] = id;dx[0][y2 + 7][x2 + 8] = id;dx[0][y2 + 7][x2 + 9] = id;dx[0][y2 + 7][x2 + 10] = id;dx[0][y2 + 7][x2 + 11] = id;dx[0][y2 + 7][x2 + 12] = id;dx[0][y2 + 7][x2 + 13] = id;
		dx[0][y2 + 7][x2 + 14] = id;dx[0][y2 + 7][x2 + 15] = id;dx[0][y2 + 7][x2 + 16] = id;dx[0][y2 + 7][x2 + 17] = id;dx[0][y2 + 7][x2 + 18] = id;dx[0][y2 + 8][x2 - 17] = id;dx[0][y2 + 8][x2 - 16] = id;dx[0][y2 + 8][x2 - 15] = id;dx[0][y2 + 8][x2 - 14] = id;
		dx[0][y2 + 8][x2 - 13] = id;dx[0][y2 + 8][x2 - 10] = id;dx[0][y2 + 8][x2 - 9] = id;dx[0][y2 + 8][x2 - 8] = id;dx[0][y2 + 8][x2 - 5] = id;dx[0][y2 + 8][x2 - 4] = id;dx[0][y2 + 8][x2 - 3] = id;dx[0][y2 + 8][x2 + 0] = id;dx[0][y2 + 8][x2 + 1] = id;
		dx[0][y2 + 8][x2 + 2] = id;dx[0][y2 + 8][x2 + 5] = id;dx[0][y2 + 8][x2 + 6] = id;dx[0][y2 + 8][x2 + 7] = id;dx[0][y2 + 8][x2 + 10] = id;dx[0][y2 + 8][x2 + 11] = id;dx[0][y2 + 8][x2 + 12] = id;dx[0][y2 + 8][x2 + 13] = id;dx[0][y2 + 8][x2 + 16] = id;
		dx[0][y2 + 8][x2 + 17] = id;dx[0][y2 + 8][x2 + 18] = id;dx[0][y2 + 9][x2 - 16] = id;dx[0][y2 + 9][x2 - 15] = id;dx[0][y2 + 9][x2 - 12] = id;dx[0][y2 + 9][x2 - 11] = id;dx[0][y2 + 9][x2 - 10] = id;dx[0][y2 + 9][x2 - 7] = id;dx[0][y2 + 9][x2 - 6] = id;
		dx[0][y2 + 9][x2 - 5] = id;dx[0][y2 + 9][x2 - 2] = id;dx[0][y2 + 9][x2 - 1] = id;dx[0][y2 + 9][x2 + 0] = id;dx[0][y2 + 9][x2 + 3] = id;dx[0][y2 + 9][x2 + 4] = id;dx[0][y2 + 9][x2 + 5] = id;dx[0][y2 + 9][x2 + 8] = id;dx[0][y2 + 9][x2 + 9] = id;
		dx[0][y2 + 9][x2 + 10] = id;dx[0][y2 + 9][x2 + 13] = id;dx[0][y2 + 9][x2 + 14] = id;dx[0][y2 + 9][x2 + 15] = id;dx[0][y2 + 9][x2 + 17] = id;dx[0][y2 + 10][x2 - 16] = id;dx[0][y2 + 10][x2 - 14] = id;dx[0][y2 + 10][x2 - 13] = id;dx[0][y2 + 10][x2 - 12] = id;
		dx[0][y2 + 10][x2 - 9] = id;dx[0][y2 + 10][x2 - 8] = id;dx[0][y2 + 10][x2 - 7] = id;dx[0][y2 + 10][x2 - 4] = id;dx[0][y2 + 10][x2 - 3] = id;dx[0][y2 + 10][x2 - 2] = id;dx[0][y2 + 10][x2 + 1] = id;dx[0][y2 + 10][x2 + 2] = id;dx[0][y2 + 10][x2 + 3] = id;
		dx[0][y2 + 10][x2 + 6] = id;dx[0][y2 + 10][x2 + 7] = id;dx[0][y2 + 10][x2 + 8] = id;dx[0][y2 + 10][x2 + 11] = id;dx[0][y2 + 10][x2 + 12] = id;dx[0][y2 + 10][x2 + 13] = id;dx[0][y2 + 10][x2 + 16] = id;dx[0][y2 + 10][x2 + 17] = id;dx[0][y2 + 11][x2 - 16] = id;
		dx[0][y2 + 11][x2 - 15] = id;dx[0][y2 + 11][x2 - 14] = id;dx[0][y2 + 11][x2 - 11] = id;dx[0][y2 + 11][x2 - 10] = id;dx[0][y2 + 11][x2 - 9] = id;dx[0][y2 + 11][x2 - 6] = id;dx[0][y2 + 11][x2 - 5] = id;dx[0][y2 + 11][x2 - 4] = id;dx[0][y2 + 11][x2 - 1] = id;
		dx[0][y2 + 11][x2 + 0] = id;dx[0][y2 + 11][x2 + 1] = id;dx[0][y2 + 11][x2 + 4] = id;dx[0][y2 + 11][x2 + 5] = id;dx[0][y2 + 11][x2 + 6] = id;dx[0][y2 + 11][x2 + 9] = id;dx[0][y2 + 11][x2 + 10] = id;dx[0][y2 + 11][x2 + 11] = id;dx[0][y2 + 11][x2 + 14] = id;
		dx[0][y2 + 11][x2 + 15] = id;dx[0][y2 + 11][x2 + 17] = id;dx[0][y2 + 12][x2 - 16] = id;dx[0][y2 + 12][x2 - 15] = id;dx[0][y2 + 12][x2 - 14] = id;dx[0][y2 + 12][x2 - 13] = id;dx[0][y2 + 12][x2 - 12] = id;dx[0][y2 + 12][x2 - 11] = id;dx[0][y2 + 12][x2 - 10] = id;
		dx[0][y2 + 12][x2 - 9] = id;dx[0][y2 + 12][x2 - 8] = id;dx[0][y2 + 12][x2 - 7] = id;dx[0][y2 + 12][x2 - 6] = id;dx[0][y2 + 12][x2 - 5] = id;dx[0][y2 + 12][x2 - 4] = id;dx[0][y2 + 12][x2 - 3] = id;dx[0][y2 + 12][x2 - 2] = id;dx[0][y2 + 12][x2 - 1] = id;
		dx[0][y2 + 12][x2 + 0] = id;dx[0][y2 + 12][x2 + 1] = id;dx[0][y2 + 12][x2 + 2] = id;dx[0][y2 + 12][x2 + 3] = id;dx[0][y2 + 12][x2 + 4] = id;dx[0][y2 + 12][x2 + 5] = id;dx[0][y2 + 12][x2 + 6] = id;dx[0][y2 + 12][x2 + 7] = id;dx[0][y2 + 12][x2 + 8] = id;
		dx[0][y2 + 12][x2 + 9] = id;dx[0][y2 + 12][x2 + 10] = id;dx[0][y2 + 12][x2 + 11] = id;dx[0][y2 + 12][x2 + 12] = id;dx[0][y2 + 12][x2 + 13] = id;dx[0][y2 + 12][x2 + 14] = id;dx[0][y2 + 12][x2 + 15] = id;dx[0][y2 + 12][x2 + 16] = id;dx[0][y2 + 12][x2 + 17] = id;
		dx[0][y2 + 12][x2 - 3] = id;dx[0][y2 + 12][x2 - 2] = id;dx[0][y2 + 12][x2 - 1] = id;dx[0][y2 + 12][x2 + 0] = id;dx[0][y2 + 12][x2 + 1] = id;dx[0][y2 + 12][x2 + 2] = id;dx[0][y2 + 12][x2 + 3] = id;dx[0][y2 + 12][x2 + 4] = id;
		dx[0][y2 + 12][x2 + 5] = id;dx[0][y2 + 12][x2 + 6] = id;dx[0][y2 + 12][x2 + 7] = id;dx[0][y2 + 12][x2 + 8] = id;dx[0][y2 + 12][x2 + 9] = id;dx[0][y2 + 12][x2 + 10] = id;dx[0][y2 + 12][x2 + 11] = id;dx[0][y2 + 12][x2 + 12] = id;dx[0][y2 + 12][x2 + 13] = id;
		dx[0][y2 + 12][x2 + 14] = id;dx[0][y2 + 12][x2 + 15] = id;dx[0][y2 + 12][x2 + 16] = id;dx[0][y2 + 12][x2 + 17] = id;
	}
	{
		dx[0][y2 - 8][x2 - 12] = id;dx[0][y2 - 8][x2 - 11] = id;dx[0][y2 - 8][x2 - 10] = id;dx[0][y2 - 8][x2 - 9] = id;dx[0][y2 - 8][x2 - 8] = id;dx[0][y2 - 8][x2 - 7] = id;dx[0][y2 - 8][x2 - 6] = id;dx[0][y2 - 8][x2 - 5] = id;dx[0][y2 - 8][x2 - 4] = id;
		dx[0][y2 - 8][x2 - 3] = id;dx[0][y2 - 8][x2 - 2] = id;dx[0][y2 - 8][x2 - 1] = id;dx[0][y2 - 8][x2 + 0] = id;dx[0][y2 - 8][x2 + 1] = id;dx[0][y2 - 8][x2 + 2] = id;dx[0][y2 - 8][x2 + 3] = id;dx[0][y2 - 8][x2 + 4] = id;dx[0][y2 - 8][x2 + 5] = id;
		dx[0][y2 - 8][x2 + 6] = id;dx[0][y2 - 8][x2 + 7] = id;dx[0][y2 - 8][x2 + 8] = id;dx[0][y2 - 8][x2 + 9] = id;dx[0][y2 - 8][x2 + 10] = id;dx[0][y2 - 8][x2 + 11] = id;dx[0][y2 - 8][x2 + 12] = id;dx[0][y2 - 8][x2 + 13] = id;dx[0][y2 - 7][x2 - 13] = id;
		dx[0][y2 - 7][x2 - 12] = id;dx[0][y2 - 7][x2 - 11] = id;dx[0][y2 - 7][x2 - 10] = id;dx[0][y2 - 7][x2 - 9] = id;dx[0][y2 - 7][x2 - 8] = id;dx[0][y2 - 7][x2 - 7] = id;dx[0][y2 - 7][x2 - 6] = id;dx[0][y2 - 7][x2 - 5] = id;dx[0][y2 - 7][x2 - 4] = id;
		dx[0][y2 - 7][x2 - 3] = id;dx[0][y2 - 7][x2 - 2] = id;dx[0][y2 - 7][x2 - 1] = id;dx[0][y2 - 7][x2 + 0] = id;dx[0][y2 - 7][x2 + 1] = id;dx[0][y2 - 7][x2 + 2] = id;dx[0][y2 - 7][x2 + 3] = id;dx[0][y2 - 7][x2 + 4] = id;dx[0][y2 - 7][x2 + 5] = id;
		dx[0][y2 - 7][x2 + 6] = id;dx[0][y2 - 7][x2 + 7] = id;dx[0][y2 - 7][x2 + 8] = id;dx[0][y2 - 7][x2 + 9] = id;dx[0][y2 - 7][x2 + 10] = id;dx[0][y2 - 7][x2 + 11] = id;dx[0][y2 - 7][x2 + 12] = id;dx[0][y2 - 7][x2 + 13] = id;dx[0][y2 - 7][x2 + 14] = id;
		dx[0][y2 - 6][x2 - 14] = id;dx[0][y2 - 6][x2 - 13] = id;dx[0][y2 - 6][x2 - 12] = id;dx[0][y2 - 6][x2 - 11] = id;dx[0][y2 - 6][x2 - 10] = id;dx[0][y2 - 6][x2 - 9] = id;dx[0][y2 - 6][x2 - 8] = id;dx[0][y2 - 6][x2 - 7] = id;dx[0][y2 - 6][x2 - 6] = id;
		dx[0][y2 - 6][x2 - 5] = id;dx[0][y2 - 6][x2 - 4] = id;dx[0][y2 - 6][x2 - 3] = id;dx[0][y2 - 6][x2 - 2] = id;dx[0][y2 - 6][x2 - 1] = id;dx[0][y2 - 6][x2 + 0] = id;dx[0][y2 - 6][x2 + 1] = id;dx[0][y2 - 6][x2 + 2] = id;dx[0][y2 - 6][x2 + 3] = id;
		dx[0][y2 - 6][x2 + 4] = id;dx[0][y2 - 6][x2 + 5] = id;dx[0][y2 - 6][x2 + 6] = id;dx[0][y2 - 6][x2 + 7] = id;dx[0][y2 - 6][x2 + 8] = id;dx[0][y2 - 6][x2 + 9] = id;dx[0][y2 - 6][x2 + 10] = id;dx[0][y2 - 6][x2 + 11] = id;dx[0][y2 - 6][x2 + 12] = id;
		dx[0][y2 - 6][x2 + 13] = id;dx[0][y2 - 6][x2 + 14] = id;dx[0][y2 - 6][x2 + 15] = id;dx[0][y2 - 5][x2 - 15] = id;dx[0][y2 - 5][x2 - 14] = id;dx[0][y2 - 5][x2 - 13] = id;dx[0][y2 - 5][x2 - 12] = id;dx[0][y2 - 5][x2 - 11] = id;dx[0][y2 - 5][x2 - 10] = id;
		dx[0][y2 - 5][x2 - 9] = id;dx[0][y2 - 5][x2 - 8] = id;dx[0][y2 - 5][x2 - 7] = id;dx[0][y2 - 5][x2 - 6] = id;dx[0][y2 - 5][x2 - 5] = id;dx[0][y2 - 5][x2 - 4] = id;dx[0][y2 - 5][x2 - 3] = id;dx[0][y2 - 5][x2 - 2] = id;dx[0][y2 - 5][x2 - 1] = id;
		dx[0][y2 - 5][x2 + 0] = id;dx[0][y2 - 5][x2 + 1] = id;dx[0][y2 - 5][x2 + 2] = id;dx[0][y2 - 5][x2 + 3] = id;dx[0][y2 - 5][x2 + 4] = id;dx[0][y2 - 5][x2 + 5] = id;dx[0][y2 - 5][x2 + 6] = id;dx[0][y2 - 5][x2 + 7] = id;dx[0][y2 - 5][x2 + 8] = id;
		dx[0][y2 - 5][x2 + 9] = id;dx[0][y2 - 5][x2 + 10] = id;dx[0][y2 - 5][x2 + 11] = id;dx[0][y2 - 5][x2 + 12] = id;dx[0][y2 - 5][x2 + 13] = id;dx[0][y2 - 5][x2 + 14] = id;dx[0][y2 - 5][x2 + 15] = id;dx[0][y2 - 5][x2 + 16] = id;dx[0][y2 - 4][x2 - 15] = id;
		dx[0][y2 - 4][x2 - 14] = id;dx[0][y2 - 4][x2 - 13] = id;dx[0][y2 - 4][x2 - 12] = id;dx[0][y2 - 4][x2 - 11] = id;dx[0][y2 - 4][x2 - 10] = id;dx[0][y2 - 4][x2 - 9] = id;dx[0][y2 - 4][x2 - 8] = id;dx[0][y2 - 4][x2 - 7] = id;dx[0][y2 - 4][x2 - 6] = id;
		dx[0][y2 - 4][x2 - 5] = id;dx[0][y2 - 4][x2 - 4] = id;dx[0][y2 - 4][x2 - 3] = id;dx[0][y2 - 4][x2 - 2] = id;dx[0][y2 - 4][x2 - 1] = id;dx[0][y2 - 4][x2 + 0] = id;dx[0][y2 - 4][x2 + 1] = id;dx[0][y2 - 4][x2 + 2] = id;dx[0][y2 - 4][x2 + 3] = id;
		dx[0][y2 - 4][x2 + 4] = id;dx[0][y2 - 4][x2 + 5] = id;dx[0][y2 - 4][x2 + 6] = id;dx[0][y2 - 4][x2 + 7] = id;dx[0][y2 - 4][x2 + 8] = id;dx[0][y2 - 4][x2 + 9] = id;dx[0][y2 - 4][x2 + 10] = id;dx[0][y2 - 4][x2 + 11] = id;dx[0][y2 - 4][x2 + 12] = id;
		dx[0][y2 - 4][x2 + 13] = id;dx[0][y2 - 4][x2 + 14] = id;dx[0][y2 - 4][x2 + 15] = id;dx[0][y2 - 4][x2 + 16] = id;dx[0][y2 - 3][x2 - 14] = id;dx[0][y2 - 3][x2 - 13] = id;dx[0][y2 - 3][x2 + 14] = id;dx[0][y2 - 3][x2 + 15] = id;dx[0][y2 - 2][x2 - 14] = id;
		dx[0][y2 - 2][x2 - 13] = id;dx[0][y2 - 2][x2 + 14] = id;dx[0][y2 - 2][x2 + 15] = id;dx[0][y2 - 1][x2 - 14] = id;dx[0][y2 - 1][x2 - 13] = id;dx[0][y2 - 1][x2 - 1] = id;dx[0][y2 - 1][x2 + 1] = id;dx[0][y2 - 1][x2 + 3] = id;dx[0][y2 - 1][x2 + 5] = id;
		dx[0][y2 - 1][x2 + 7] = id;dx[0][y2 - 1][x2 + 14] = id;dx[0][y2 - 1][x2 + 15] = id;dx[0][y2 + 0][x2 - 14] = id;dx[0][y2 + 0][x2 - 13] = id;dx[0][y2 + 0][x2 - 12] = id;dx[0][y2 + 0][x2 - 11] = id;dx[0][y2 + 0][x2 - 10] = id;dx[0][y2 + 0][x2 - 9] = id;
		dx[0][y2 + 0][x2 - 8] = id;dx[0][y2 + 0][x2 - 7] = id;dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;
		dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;dx[0][y2 + 0][x2 + 7] = id;dx[0][y2 + 0][x2 + 8] = id;dx[0][y2 + 0][x2 + 9] = id;
		dx[0][y2 + 0][x2 + 10] = id;dx[0][y2 + 0][x2 + 11] = id;dx[0][y2 + 0][x2 + 12] = id;dx[0][y2 + 0][x2 + 13] = id;dx[0][y2 + 0][x2 + 14] = id;dx[0][y2 + 0][x2 + 15] = id;dx[0][y2 + 0][x2 + 16] = id;dx[0][y2 + 0][x2 + 17] = id;dx[0][y2 + 0][x2 + 18] = id;
		dx[0][y2 + 0][x2 + 19] = id;dx[0][y2 + 1][x2 - 14] = id;dx[0][y2 + 1][x2 - 13] = id;dx[0][y2 + 1][x2 - 1] = id;dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 1][x2 + 4] = id;dx[0][y2 + 1][x2 + 6] = id;dx[0][y2 + 1][x2 + 8] = id;
		dx[0][y2 + 1][x2 + 14] = id;dx[0][y2 + 1][x2 + 15] = id;dx[0][y2 + 2][x2 - 14] = id;dx[0][y2 + 2][x2 - 13] = id;dx[0][y2 + 2][x2 - 1] = id;dx[0][y2 + 2][x2 + 14] = id;dx[0][y2 + 2][x2 + 15] = id;dx[0][y2 + 3][x2 - 14] = id;dx[0][y2 + 3][x2 - 13] = id;
		dx[0][y2 + 3][x2 + 14] = id;dx[0][y2 + 3][x2 + 15] = id;dx[0][y2 + 4][x2 - 14] = id;dx[0][y2 + 4][x2 - 13] = id;dx[0][y2 + 4][x2 + 14] = id;dx[0][y2 + 4][x2 + 15] = id;dx[0][y2 + 5][x2 - 14] = id;dx[0][y2 + 5][x2 - 13] = id;dx[0][y2 + 5][x2 + 14] = id;
		dx[0][y2 + 5][x2 + 15] = id;dx[0][y2 + 6][x2 - 14] = id;dx[0][y2 + 6][x2 - 13] = id;dx[0][y2 + 6][x2 + 14] = id;dx[0][y2 + 6][x2 + 15] = id;dx[0][y2 + 7][x2 - 17] = id;dx[0][y2 + 7][x2 - 16] = id;dx[0][y2 + 7][x2 - 15] = id;dx[0][y2 + 7][x2 - 14] = id;
		dx[0][y2 + 7][x2 - 13] = id;dx[0][y2 + 7][x2 - 12] = id;dx[0][y2 + 7][x2 - 11] = id;dx[0][y2 + 7][x2 - 10] = id;dx[0][y2 + 7][x2 - 9] = id;dx[0][y2 + 7][x2 - 8] = id;dx[0][y2 + 7][x2 - 7] = id;dx[0][y2 + 7][x2 - 6] = id;dx[0][y2 + 7][x2 - 5] = id;
		dx[0][y2 + 7][x2 - 4] = id;dx[0][y2 + 7][x2 - 3] = id;dx[0][y2 + 7][x2 - 2] = id;dx[0][y2 + 7][x2 - 1] = id;dx[0][y2 + 7][x2 + 0] = id;dx[0][y2 + 7][x2 + 1] = id;dx[0][y2 + 7][x2 + 2] = id;dx[0][y2 + 7][x2 + 3] = id;dx[0][y2 + 7][x2 + 4] = id;
		dx[0][y2 + 7][x2 + 5] = id;dx[0][y2 + 7][x2 + 6] = id;dx[0][y2 + 7][x2 + 7] = id;dx[0][y2 + 7][x2 + 8] = id;dx[0][y2 + 7][x2 + 9] = id;dx[0][y2 + 7][x2 + 10] = id;dx[0][y2 + 7][x2 + 11] = id;dx[0][y2 + 7][x2 + 12] = id;dx[0][y2 + 7][x2 + 13] = id;
		dx[0][y2 + 7][x2 + 14] = id;dx[0][y2 + 7][x2 + 15] = id;dx[0][y2 + 7][x2 + 16] = id;dx[0][y2 + 7][x2 + 17] = id;dx[0][y2 + 7][x2 + 18] = id;dx[0][y2 + 8][x2 - 17] = id;dx[0][y2 + 8][x2 - 16] = id;dx[0][y2 + 8][x2 - 15] = id;dx[0][y2 + 8][x2 - 14] = id;
		dx[0][y2 + 8][x2 - 13] = id;dx[0][y2 + 8][x2 - 10] = id;dx[0][y2 + 8][x2 - 9] = id;dx[0][y2 + 8][x2 - 8] = id;dx[0][y2 + 8][x2 - 5] = id;dx[0][y2 + 8][x2 - 4] = id;dx[0][y2 + 8][x2 - 3] = id;dx[0][y2 + 8][x2 + 0] = id;dx[0][y2 + 8][x2 + 1] = id;
		dx[0][y2 + 8][x2 + 2] = id;dx[0][y2 + 8][x2 + 5] = id;dx[0][y2 + 8][x2 + 6] = id;dx[0][y2 + 8][x2 + 7] = id;dx[0][y2 + 8][x2 + 10] = id;dx[0][y2 + 8][x2 + 11] = id;dx[0][y2 + 8][x2 + 12] = id;dx[0][y2 + 8][x2 + 13] = id;dx[0][y2 + 8][x2 + 16] = id;
		dx[0][y2 + 8][x2 + 17] = id;dx[0][y2 + 8][x2 + 18] = id;dx[0][y2 + 9][x2 - 16] = id;dx[0][y2 + 9][x2 - 15] = id;dx[0][y2 + 9][x2 - 12] = id;dx[0][y2 + 9][x2 - 11] = id;dx[0][y2 + 9][x2 - 10] = id;dx[0][y2 + 9][x2 - 7] = id;dx[0][y2 + 9][x2 - 6] = id;
		dx[0][y2 + 9][x2 - 5] = id;dx[0][y2 + 9][x2 - 2] = id;dx[0][y2 + 9][x2 - 1] = id;dx[0][y2 + 9][x2 + 0] = id;dx[0][y2 + 9][x2 + 3] = id;dx[0][y2 + 9][x2 + 4] = id;dx[0][y2 + 9][x2 + 5] = id;dx[0][y2 + 9][x2 + 8] = id;dx[0][y2 + 9][x2 + 9] = id;
		dx[0][y2 + 9][x2 + 10] = id;dx[0][y2 + 9][x2 + 13] = id;dx[0][y2 + 9][x2 + 14] = id;dx[0][y2 + 9][x2 + 15] = id;dx[0][y2 + 9][x2 + 17] = id;dx[0][y2 + 10][x2 - 16] = id;dx[0][y2 + 10][x2 - 14] = id;dx[0][y2 + 10][x2 - 13] = id;dx[0][y2 + 10][x2 - 12] = id;
		dx[0][y2 + 10][x2 - 9] = id;dx[0][y2 + 10][x2 - 8] = id;dx[0][y2 + 10][x2 - 7] = id;dx[0][y2 + 10][x2 - 4] = id;dx[0][y2 + 10][x2 - 3] = id;dx[0][y2 + 10][x2 - 2] = id;dx[0][y2 + 10][x2 + 1] = id;dx[0][y2 + 10][x2 + 2] = id;dx[0][y2 + 10][x2 + 3] = id;
		dx[0][y2 + 10][x2 + 6] = id;dx[0][y2 + 10][x2 + 7] = id;dx[0][y2 + 10][x2 + 8] = id;dx[0][y2 + 10][x2 + 11] = id;dx[0][y2 + 10][x2 + 12] = id;dx[0][y2 + 10][x2 + 13] = id;dx[0][y2 + 10][x2 + 16] = id;dx[0][y2 + 10][x2 + 17] = id;dx[0][y2 + 11][x2 - 16] = id;
		dx[0][y2 + 11][x2 - 15] = id;dx[0][y2 + 11][x2 - 14] = id;dx[0][y2 + 11][x2 - 11] = id;dx[0][y2 + 11][x2 - 10] = id;dx[0][y2 + 11][x2 - 9] = id;dx[0][y2 + 11][x2 - 6] = id;dx[0][y2 + 11][x2 - 5] = id;dx[0][y2 + 11][x2 - 4] = id;dx[0][y2 + 11][x2 - 1] = id;
		dx[0][y2 + 11][x2 + 0] = id;dx[0][y2 + 11][x2 + 1] = id;dx[0][y2 + 11][x2 + 4] = id;dx[0][y2 + 11][x2 + 5] = id;dx[0][y2 + 11][x2 + 6] = id;dx[0][y2 + 11][x2 + 9] = id;dx[0][y2 + 11][x2 + 10] = id;dx[0][y2 + 11][x2 + 11] = id;dx[0][y2 + 11][x2 + 14] = id;
		dx[0][y2 + 11][x2 + 15] = id;dx[0][y2 + 11][x2 + 17] = id;dx[0][y2 + 12][x2 - 16] = id;dx[0][y2 + 12][x2 - 15] = id;dx[0][y2 + 12][x2 - 14] = id;dx[0][y2 + 12][x2 - 13] = id;dx[0][y2 + 12][x2 - 12] = id;dx[0][y2 + 12][x2 - 11] = id;dx[0][y2 + 12][x2 - 10] = id;
		dx[0][y2 + 12][x2 - 9] = id;dx[0][y2 + 12][x2 - 8] = id;dx[0][y2 + 12][x2 - 7] = id;dx[0][y2 + 12][x2 - 6] = id;dx[0][y2 + 12][x2 - 5] = id;dx[0][y2 + 12][x2 - 4] = id;dx[0][y2 + 12][x2 - 3] = id;dx[0][y2 + 12][x2 - 2] = id;dx[0][y2 + 12][x2 - 1] = id;
		dx[0][y2 + 12][x2 + 0] = id;dx[0][y2 + 12][x2 + 1] = id;dx[0][y2 + 12][x2 + 2] = id;dx[0][y2 + 12][x2 + 3] = id;dx[0][y2 + 12][x2 + 4] = id;dx[0][y2 + 12][x2 + 5] = id;dx[0][y2 + 12][x2 + 6] = id;dx[0][y2 + 12][x2 + 7] = id;dx[0][y2 + 12][x2 + 8] = id;
		dx[0][y2 + 12][x2 + 9] = id;dx[0][y2 + 12][x2 + 10] = id;dx[0][y2 + 12][x2 + 11] = id;dx[0][y2 + 12][x2 + 12] = id;dx[0][y2 + 12][x2 + 13] = id;dx[0][y2 + 12][x2 + 14] = id;dx[0][y2 + 12][x2 + 15] = id;dx[0][y2 + 12][x2 + 16] = id;dx[0][y2 + 12][x2 + 17] = id;
	}

	dx[0][y2 - 1][x2 - 1] = id;dx[0][y2 - 1][x2 + 1] = id;dx[0][y2 - 1][x2 + 3] = id;dx[0][y2 - 1][x2 + 5] = id;dx[0][y2 - 1][x2 + 7] = id;
	
	
	dx[0][y2 + 0][x2 - 14] = id;dx[0][y2 + 0][x2 - 13] = id;dx[0][y2 + 0][x2 - 12] = id;dx[0][y2 + 0][x2 - 11] = id;
	dx[0][y2 + 0][x2 - 10] = id;dx[0][y2 + 0][x2 - 9] = id;dx[0][y2 + 0][x2 - 8] = id;dx[0][y2 + 0][x2 - 7] = id;dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;
	dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;dx[0][y2 + 0][x2 + 7] = id;
	dx[0][y2 + 0][x2 + 8] = id;dx[0][y2 + 0][x2 + 9] = id;dx[0][y2 + 0][x2 + 10] = id;dx[0][y2 + 0][x2 + 11] = id;dx[0][y2 + 0][x2 + 12] = id;dx[0][y2 + 0][x2 + 13] = id;dx[0][y2 + 0][x2 + 14] = id;dx[0][y2 + 0][x2 + 15] = id;dx[0][y2 + 0][x2 + 16] = id;
	dx[0][y2 + 0][x2 + 17] = id;dx[0][y2 + 0][x2 + 18] = id;dx[0][y2 + 0][x2 + 19] = id;
	
	
	
	dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 1][x2 + 4] = id;dx[0][y2 + 1][x2 + 6] = id;dx[0][y2 + 1][x2 + 8] = id;

	
	visualt(1, x1,y1,"stick");
	
}

void roadstore(int x1, int y1) 
{
	int id = 15;
	int x2 = x1 + 30 + 30;
	int y2 = 600 - y1;
	dx[0][y2 - 5][x2 - 34] = id;dx[0][y2 - 5][x2 - 33] = id;dx[0][y2 - 5][x2 - 32] = id;dx[0][y2 - 5][x2 - 31] = id;dx[0][y2 - 5][x2 - 30] = id;dx[0][y2 - 5][x2 - 29] = id;dx[0][y2 - 5][x2 - 28] = id;dx[0][y2 - 5][x2 - 27] = id;dx[0][y2 - 5][x2 - 26] = id;
	dx[0][y2 - 5][x2 - 25] = id;dx[0][y2 - 5][x2 + 23] = id;dx[0][y2 - 5][x2 + 24] = id;dx[0][y2 - 5][x2 + 25] = id;dx[0][y2 - 5][x2 + 26] = id;dx[0][y2 - 5][x2 + 27] = id;dx[0][y2 - 5][x2 + 28] = id;dx[0][y2 - 5][x2 + 29] = id;dx[0][y2 - 5][x2 + 30] = id;
	dx[0][y2 - 5][x2 + 31] = id;dx[0][y2 - 5][x2 + 32] = id;dx[0][y2 - 5][x2 + 33] = id;dx[0][y2 - 5][x2 + 34] = id;dx[0][y2 - 4][x2 - 34] = id;dx[0][y2 - 4][x2 - 30] = id;dx[0][y2 - 4][x2 - 29] = id;dx[0][y2 - 4][x2 - 28] = id;dx[0][y2 - 4][x2 - 27] = id;
	dx[0][y2 - 4][x2 - 26] = id;dx[0][y2 - 4][x2 - 25] = id;dx[0][y2 - 4][x2 - 24] = id;dx[0][y2 - 4][x2 - 23] = id;dx[0][y2 - 4][x2 - 22] = id;dx[0][y2 - 4][x2 + 20] = id;dx[0][y2 - 4][x2 + 21] = id;dx[0][y2 - 4][x2 + 22] = id;dx[0][y2 - 4][x2 + 23] = id;
	dx[0][y2 - 4][x2 + 24] = id;dx[0][y2 - 4][x2 + 25] = id;dx[0][y2 - 4][x2 + 26] = id;dx[0][y2 - 4][x2 + 27] = id;dx[0][y2 - 4][x2 + 28] = id;dx[0][y2 - 4][x2 + 29] = id;dx[0][y2 - 4][x2 + 30] = id;dx[0][y2 - 4][x2 + 34] = id;dx[0][y2 - 3][x2 - 34] = id;
	dx[0][y2 - 3][x2 - 30] = id;dx[0][y2 - 3][x2 - 29] = id;dx[0][y2 - 3][x2 - 28] = id;dx[0][y2 - 3][x2 - 27] = id;dx[0][y2 - 3][x2 - 26] = id;dx[0][y2 - 3][x2 - 25] = id;dx[0][y2 - 3][x2 - 24] = id;dx[0][y2 - 3][x2 - 23] = id;dx[0][y2 - 3][x2 - 22] = id;
	dx[0][y2 - 3][x2 - 21] = id;dx[0][y2 - 3][x2 - 20] = id;dx[0][y2 - 3][x2 - 19] = id;dx[0][y2 - 3][x2 - 18] = id;dx[0][y2 - 3][x2 - 17] = id;dx[0][y2 - 3][x2 - 16] = id;dx[0][y2 - 3][x2 - 15] = id;dx[0][y2 - 3][x2 - 14] = id;dx[0][y2 - 3][x2 - 13] = id;
	dx[0][y2 - 3][x2 - 12] = id;dx[0][y2 - 3][x2 - 11] = id;dx[0][y2 - 3][x2 - 10] = id;dx[0][y2 - 3][x2 + 8] = id;dx[0][y2 - 3][x2 + 9] = id;dx[0][y2 - 3][x2 + 10] = id;dx[0][y2 - 3][x2 + 11] = id;dx[0][y2 - 3][x2 + 12] = id;dx[0][y2 - 3][x2 + 13] = id;
	dx[0][y2 - 3][x2 + 14] = id;dx[0][y2 - 3][x2 + 15] = id;dx[0][y2 - 3][x2 + 16] = id;dx[0][y2 - 3][x2 + 17] = id;dx[0][y2 - 3][x2 + 18] = id;dx[0][y2 - 3][x2 + 19] = id;dx[0][y2 - 3][x2 + 20] = id;dx[0][y2 - 3][x2 + 21] = id;dx[0][y2 - 3][x2 + 22] = id;
	dx[0][y2 - 3][x2 + 23] = id;dx[0][y2 - 3][x2 + 24] = id;dx[0][y2 - 3][x2 + 25] = id;dx[0][y2 - 3][x2 + 26] = id;dx[0][y2 - 3][x2 + 27] = id;dx[0][y2 - 3][x2 + 28] = id;dx[0][y2 - 3][x2 + 29] = id;dx[0][y2 - 3][x2 + 30] = id;dx[0][y2 - 3][x2 + 34] = id;
	dx[0][y2 - 2][x2 - 34] = id;dx[0][y2 - 2][x2 - 30] = id;dx[0][y2 - 2][x2 - 21] = id;dx[0][y2 - 2][x2 - 20] = id;dx[0][y2 - 2][x2 - 19] = id;dx[0][y2 - 2][x2 - 18] = id;dx[0][y2 - 2][x2 - 17] = id;dx[0][y2 - 2][x2 - 16] = id;dx[0][y2 - 2][x2 - 15] = id;
	dx[0][y2 - 2][x2 - 14] = id;dx[0][y2 - 2][x2 - 13] = id;dx[0][y2 - 2][x2 - 12] = id;dx[0][y2 - 2][x2 - 11] = id;dx[0][y2 - 2][x2 - 10] = id;dx[0][y2 - 2][x2 - 9] = id;dx[0][y2 - 2][x2 - 8] = id;dx[0][y2 - 2][x2 - 7] = id;dx[0][y2 - 2][x2 - 6] = id;
	dx[0][y2 - 2][x2 - 5] = id;dx[0][y2 - 2][x2 - 4] = id;dx[0][y2 - 2][x2 - 3] = id;dx[0][y2 - 2][x2 - 2] = id;dx[0][y2 - 2][x2 - 1] = id;dx[0][y2 - 2][x2 + 0] = id;dx[0][y2 - 2][x2 + 1] = id;dx[0][y2 - 2][x2 + 2] = id;dx[0][y2 - 2][x2 + 3] = id;
	dx[0][y2 - 2][x2 + 4] = id;dx[0][y2 - 2][x2 + 5] = id;dx[0][y2 - 2][x2 + 6] = id;dx[0][y2 - 2][x2 + 7] = id;dx[0][y2 - 2][x2 + 8] = id;dx[0][y2 - 2][x2 + 9] = id;dx[0][y2 - 2][x2 + 10] = id;dx[0][y2 - 2][x2 + 11] = id;dx[0][y2 - 2][x2 + 12] = id;
	dx[0][y2 - 2][x2 + 13] = id;dx[0][y2 - 2][x2 + 14] = id;dx[0][y2 - 2][x2 + 15] = id;dx[0][y2 - 2][x2 + 16] = id;dx[0][y2 - 2][x2 + 17] = id;dx[0][y2 - 2][x2 + 18] = id;dx[0][y2 - 2][x2 + 19] = id;dx[0][y2 - 2][x2 + 20] = id;dx[0][y2 - 2][x2 + 30] = id;
	dx[0][y2 - 2][x2 + 34] = id;dx[0][y2 - 1][x2 - 34] = id;dx[0][y2 - 1][x2 - 30] = id;dx[0][y2 - 1][x2 - 7] = id;dx[0][y2 - 1][x2 - 6] = id;dx[0][y2 - 1][x2 - 5] = id;dx[0][y2 - 1][x2 - 4] = id;dx[0][y2 - 1][x2 - 3] = id;dx[0][y2 - 1][x2 - 2] = id;
	dx[0][y2 - 1][x2 - 1] = id;dx[0][y2 - 1][x2 + 0] = id;dx[0][y2 - 1][x2 + 1] = id;dx[0][y2 - 1][x2 + 2] = id;dx[0][y2 - 1][x2 + 3] = id;dx[0][y2 - 1][x2 + 4] = id;dx[0][y2 - 1][x2 + 5] = id;dx[0][y2 - 1][x2 + 6] = id;dx[0][y2 - 1][x2 + 30] = id;
	dx[0][y2 - 1][x2 + 34] = id;dx[0][y2 + 0][x2 - 34] = id;dx[0][y2 + 0][x2 - 30] = id;dx[0][y2 + 0][x2 + 30] = id;dx[0][y2 + 0][x2 + 34] = id;dx[0][y2 + 1][x2 - 34] = id;dx[0][y2 + 1][x2 - 30] = id;dx[0][y2 + 1][x2 + 30] = id;dx[0][y2 + 1][x2 + 34] = id;
	dx[0][y2 + 2][x2 - 34] = id;dx[0][y2 + 2][x2 - 30] = id;dx[0][y2 + 2][x2 + 30] = id;dx[0][y2 + 2][x2 + 34] = id;dx[0][y2 + 3][x2 - 34] = id;dx[0][y2 + 3][x2 - 30] = id;dx[0][y2 + 3][x2 + 30] = id;dx[0][y2 + 3][x2 + 34] = id;dx[0][y2 + 4][x2 - 34] = id;
	dx[0][y2 + 4][x2 - 30] = id;dx[0][y2 + 4][x2 + 30] = id;dx[0][y2 + 4][x2 + 34] = id;dx[0][y2 + 5][x2 - 34] = id;dx[0][y2 + 5][x2 - 30] = id;dx[0][y2 + 5][x2 - 17] = id;dx[0][y2 + 5][x2 - 16] = id;dx[0][y2 + 5][x2 - 15] = id;dx[0][y2 + 5][x2 - 14] = id;
	dx[0][y2 + 5][x2 - 13] = id;dx[0][y2 + 5][x2 - 12] = id;dx[0][y2 + 5][x2 - 11] = id;dx[0][y2 + 5][x2 - 10] = id;dx[0][y2 + 5][x2 - 9] = id;dx[0][y2 + 5][x2 - 8] = id;dx[0][y2 + 5][x2 + 12] = id;dx[0][y2 + 5][x2 + 13] = id;dx[0][y2 + 5][x2 + 14] = id;
	dx[0][y2 + 5][x2 + 15] = id;dx[0][y2 + 5][x2 + 16] = id;dx[0][y2 + 5][x2 + 17] = id;dx[0][y2 + 5][x2 + 30] = id;dx[0][y2 + 5][x2 + 34] = id;dx[0][y2 + 6][x2 - 34] = id;dx[0][y2 + 6][x2 - 30] = id;dx[0][y2 + 6][x2 - 16] = id;dx[0][y2 + 6][x2 - 9] = id;
	dx[0][y2 + 6][x2 + 12] = id;dx[0][y2 + 6][x2 + 17] = id;dx[0][y2 + 6][x2 + 30] = id;dx[0][y2 + 6][x2 + 34] = id;dx[0][y2 + 7][x2 - 34] = id;dx[0][y2 + 7][x2 - 30] = id;dx[0][y2 + 7][x2 - 15] = id;dx[0][y2 + 7][x2 - 14] = id;dx[0][y2 + 7][x2 - 13] = id;
	dx[0][y2 + 7][x2 - 12] = id;dx[0][y2 + 7][x2 - 11] = id;dx[0][y2 + 7][x2 - 10] = id;dx[0][y2 + 7][x2 + 12] = id;dx[0][y2 + 7][x2 + 13] = id;dx[0][y2 + 7][x2 + 14] = id;dx[0][y2 + 7][x2 + 15] = id;dx[0][y2 + 7][x2 + 16] = id;dx[0][y2 + 7][x2 + 17] = id;
	dx[0][y2 + 7][x2 + 30] = id;dx[0][y2 + 7][x2 + 34] = id;dx[0][y2 + 8][x2 - 34] = id;dx[0][y2 + 8][x2 - 30] = id;dx[0][y2 + 8][x2 - 21] = id;dx[0][y2 + 8][x2 - 20] = id;dx[0][y2 + 8][x2 - 19] = id;dx[0][y2 + 8][x2 - 18] = id;dx[0][y2 + 8][x2 - 17] = id;
	dx[0][y2 + 8][x2 - 16] = id;dx[0][y2 + 8][x2 - 15] = id;dx[0][y2 + 8][x2 - 14] = id;dx[0][y2 + 8][x2 - 13] = id;dx[0][y2 + 8][x2 - 12] = id;dx[0][y2 + 8][x2 - 11] = id;dx[0][y2 + 8][x2 - 10] = id;dx[0][y2 + 8][x2 - 9] = id;dx[0][y2 + 8][x2 - 8] = id;
	dx[0][y2 + 8][x2 - 7] = id;dx[0][y2 + 8][x2 - 6] = id;dx[0][y2 + 8][x2 - 5] = id;dx[0][y2 + 8][x2 - 4] = id;dx[0][y2 + 8][x2 - 3] = id;dx[0][y2 + 8][x2 - 2] = id;dx[0][y2 + 8][x2 - 1] = id;dx[0][y2 + 8][x2 + 0] = id;dx[0][y2 + 8][x2 + 1] = id;
	dx[0][y2 + 8][x2 + 2] = id;dx[0][y2 + 8][x2 + 3] = id;dx[0][y2 + 8][x2 + 4] = id;dx[0][y2 + 8][x2 + 5] = id;dx[0][y2 + 8][x2 + 6] = id;dx[0][y2 + 8][x2 + 7] = id;dx[0][y2 + 8][x2 + 8] = id;dx[0][y2 + 8][x2 + 9] = id;dx[0][y2 + 8][x2 + 10] = id;
	dx[0][y2 + 8][x2 + 11] = id;dx[0][y2 + 8][x2 + 12] = id;dx[0][y2 + 8][x2 + 13] = id;dx[0][y2 + 8][x2 + 14] = id;dx[0][y2 + 8][x2 + 15] = id;dx[0][y2 + 8][x2 + 16] = id;dx[0][y2 + 8][x2 + 17] = id;dx[0][y2 + 8][x2 + 18] = id;dx[0][y2 + 8][x2 + 19] = id;
	dx[0][y2 + 8][x2 + 20] = id;dx[0][y2 + 8][x2 + 21] = id;dx[0][y2 + 8][x2 + 30] = id;dx[0][y2 + 8][x2 + 34] = id;dx[0][y2 + 9][x2 - 34] = id;dx[0][y2 + 9][x2 - 30] = id;dx[0][y2 + 9][x2 - 21] = id;dx[0][y2 + 9][x2 - 20] = id;dx[0][y2 + 9][x2 - 19] = id;
	dx[0][y2 + 9][x2 - 18] = id;dx[0][y2 + 9][x2 - 17] = id;dx[0][y2 + 9][x2 - 16] = id;dx[0][y2 + 9][x2 - 15] = id;dx[0][y2 + 9][x2 - 14] = id;dx[0][y2 + 9][x2 - 13] = id;dx[0][y2 + 9][x2 - 12] = id;dx[0][y2 + 9][x2 - 11] = id;dx[0][y2 + 9][x2 - 10] = id;
	dx[0][y2 + 9][x2 - 9] = id;dx[0][y2 + 9][x2 - 8] = id;dx[0][y2 + 9][x2 - 7] = id;dx[0][y2 + 9][x2 - 6] = id;dx[0][y2 + 9][x2 - 5] = id;dx[0][y2 + 9][x2 - 4] = id;dx[0][y2 + 9][x2 - 3] = id;dx[0][y2 + 9][x2 - 2] = id;dx[0][y2 + 9][x2 - 1] = id;
	dx[0][y2 + 9][x2 + 0] = id;dx[0][y2 + 9][x2 + 1] = id;dx[0][y2 + 9][x2 + 2] = id;dx[0][y2 + 9][x2 + 3] = id;dx[0][y2 + 9][x2 + 4] = id;dx[0][y2 + 9][x2 + 5] = id;dx[0][y2 + 9][x2 + 6] = id;dx[0][y2 + 9][x2 + 7] = id;dx[0][y2 + 9][x2 + 8] = id;
	dx[0][y2 + 9][x2 + 9] = id;dx[0][y2 + 9][x2 + 10] = id;dx[0][y2 + 9][x2 + 11] = id;dx[0][y2 + 9][x2 + 12] = id;dx[0][y2 + 9][x2 + 13] = id;dx[0][y2 + 9][x2 + 14] = id;dx[0][y2 + 9][x2 + 15] = id;dx[0][y2 + 9][x2 + 16] = id;dx[0][y2 + 9][x2 + 17] = id;
	dx[0][y2 + 9][x2 + 18] = id;dx[0][y2 + 9][x2 + 19] = id;dx[0][y2 + 9][x2 + 20] = id;dx[0][y2 + 9][x2 + 21] = id;dx[0][y2 + 9][x2 + 30] = id;dx[0][y2 + 9][x2 + 34] = id;dx[0][y2 + 10][x2 - 34] = id;dx[0][y2 + 10][x2 - 30] = id;dx[0][y2 + 10][x2 - 15] = id;
	dx[0][y2 + 10][x2 - 13] = id;dx[0][y2 + 10][x2 + 14] = id;dx[0][y2 + 10][x2 + 16] = id;dx[0][y2 + 10][x2 + 30] = id;dx[0][y2 + 10][x2 + 34] = id;dx[0][y2 + 11][x2 - 34] = id;dx[0][y2 + 11][x2 - 30] = id;dx[0][y2 + 11][x2 - 15] = id;dx[0][y2 + 11][x2 - 13] = id;
	dx[0][y2 + 11][x2 + 14] = id;dx[0][y2 + 11][x2 + 16] = id;dx[0][y2 + 11][x2 + 30] = id;dx[0][y2 + 11][x2 + 34] = id;
}

void sculpture(int x1, int y1) 
{
	int id = 15;
	int x2 = x1 + 30 + 30;
	int y2 = 600 - y1;

	dx[0][y2 - 14][x2 - 12] = id;dx[0][y2 - 14][x2 - 11] = id;dx[0][y2 - 14][x2 - 10] = id;dx[0][y2 - 14][x2 - 9] = id;dx[0][y2 - 14][x2 - 8] = id;dx[0][y2 - 14][x2 - 7] = id;dx[0][y2 - 14][x2 - 6] = id;dx[0][y2 - 14][x2 - 5] = id;dx[0][y2 - 14][x2 - 4] = id;
	dx[0][y2 - 14][x2 - 3] = id;dx[0][y2 - 14][x2 - 2] = id;dx[0][y2 - 14][x2 - 1] = id;dx[0][y2 - 14][x2 + 0] = id;dx[0][y2 - 14][x2 + 1] = id;dx[0][y2 - 14][x2 + 2] = id;dx[0][y2 - 14][x2 + 3] = id;dx[0][y2 - 14][x2 + 4] = id;dx[0][y2 - 14][x2 + 5] = id;
	dx[0][y2 - 14][x2 + 6] = id;dx[0][y2 - 14][x2 + 7] = id;dx[0][y2 - 14][x2 + 8] = id;dx[0][y2 - 14][x2 + 9] = id;dx[0][y2 - 14][x2 + 10] = id;dx[0][y2 - 14][x2 + 11] = id;dx[0][y2 - 14][x2 + 12] = id;dx[0][y2 - 14][x2 + 13] = id;dx[0][y2 - 13][x2 - 11] = id;
	dx[0][y2 - 13][x2 - 10] = id;dx[0][y2 - 13][x2 - 9] = id;dx[0][y2 - 13][x2 - 8] = id;dx[0][y2 - 13][x2 - 7] = id;dx[0][y2 - 13][x2 - 6] = id;dx[0][y2 - 13][x2 - 5] = id;dx[0][y2 - 13][x2 - 4] = id;dx[0][y2 - 13][x2 - 3] = id;dx[0][y2 - 13][x2 - 2] = id;
	dx[0][y2 - 13][x2 - 1] = id;dx[0][y2 - 13][x2 + 0] = id;dx[0][y2 - 13][x2 + 1] = id;dx[0][y2 - 13][x2 + 2] = id;dx[0][y2 - 13][x2 + 3] = id;dx[0][y2 - 13][x2 + 4] = id;dx[0][y2 - 13][x2 + 5] = id;dx[0][y2 - 13][x2 + 6] = id;dx[0][y2 - 13][x2 + 7] = id;
	dx[0][y2 - 13][x2 + 8] = id;dx[0][y2 - 13][x2 + 9] = id;dx[0][y2 - 13][x2 + 10] = id;dx[0][y2 - 13][x2 + 11] = id;dx[0][y2 - 13][x2 + 12] = id;dx[0][y2 - 12][x2 - 10] = id;dx[0][y2 - 12][x2 - 9] = id;dx[0][y2 - 12][x2 - 8] = id;dx[0][y2 - 12][x2 - 7] = id;
	dx[0][y2 - 12][x2 - 6] = id;dx[0][y2 - 12][x2 - 5] = id;dx[0][y2 - 12][x2 - 4] = id;dx[0][y2 - 12][x2 - 3] = id;dx[0][y2 - 12][x2 - 2] = id;dx[0][y2 - 12][x2 - 1] = id;dx[0][y2 - 12][x2 + 0] = id;dx[0][y2 - 12][x2 + 1] = id;dx[0][y2 - 12][x2 + 2] = id;
	dx[0][y2 - 12][x2 + 3] = id;dx[0][y2 - 12][x2 + 4] = id;dx[0][y2 - 12][x2 + 5] = id;dx[0][y2 - 12][x2 + 6] = id;dx[0][y2 - 12][x2 + 7] = id;dx[0][y2 - 12][x2 + 8] = id;dx[0][y2 - 12][x2 + 9] = id;dx[0][y2 - 12][x2 + 10] = id;dx[0][y2 - 12][x2 + 11] = id;
	dx[0][y2 - 11][x2 - 11] = id;dx[0][y2 - 11][x2 - 10] = id;dx[0][y2 - 11][x2 + 11] = id;dx[0][y2 - 11][x2 + 12] = id;dx[0][y2 - 10][x2 - 11] = id;dx[0][y2 - 10][x2 - 10] = id;dx[0][y2 - 10][x2 - 9] = id;dx[0][y2 - 10][x2 - 8] = id;dx[0][y2 - 10][x2 - 7] = id;
	dx[0][y2 - 10][x2 - 6] = id;dx[0][y2 - 10][x2 - 5] = id;dx[0][y2 - 10][x2 - 4] = id;dx[0][y2 - 10][x2 - 3] = id;dx[0][y2 - 10][x2 - 2] = id;dx[0][y2 - 10][x2 - 1] = id;dx[0][y2 - 10][x2 + 0] = id;dx[0][y2 - 10][x2 + 1] = id;dx[0][y2 - 10][x2 + 2] = id;
	dx[0][y2 - 10][x2 + 3] = id;dx[0][y2 - 10][x2 + 4] = id;dx[0][y2 - 10][x2 + 5] = id;dx[0][y2 - 10][x2 + 6] = id;dx[0][y2 - 10][x2 + 7] = id;dx[0][y2 - 10][x2 + 8] = id;dx[0][y2 - 10][x2 + 9] = id;dx[0][y2 - 10][x2 + 10] = id;dx[0][y2 - 10][x2 + 11] = id;
	dx[0][y2 - 10][x2 + 12] = id;dx[0][y2 - 9][x2 - 10] = id;dx[0][y2 - 9][x2 - 9] = id;dx[0][y2 - 9][x2 - 8] = id;dx[0][y2 - 9][x2 - 7] = id;dx[0][y2 - 9][x2 - 6] = id;dx[0][y2 - 9][x2 - 5] = id;dx[0][y2 - 9][x2 - 4] = id;dx[0][y2 - 9][x2 - 3] = id;
	dx[0][y2 - 9][x2 - 2] = id;dx[0][y2 - 9][x2 - 1] = id;dx[0][y2 - 9][x2 + 0] = id;dx[0][y2 - 9][x2 + 1] = id;dx[0][y2 - 9][x2 + 2] = id;dx[0][y2 - 9][x2 + 3] = id;dx[0][y2 - 9][x2 + 4] = id;dx[0][y2 - 9][x2 + 5] = id;dx[0][y2 - 9][x2 + 6] = id;
	dx[0][y2 - 9][x2 + 7] = id;dx[0][y2 - 9][x2 + 8] = id;dx[0][y2 - 9][x2 + 9] = id;dx[0][y2 - 9][x2 + 10] = id;dx[0][y2 - 9][x2 + 11] = id;dx[0][y2 - 8][x2 - 10] = id;dx[0][y2 - 8][x2 - 9] = id;dx[0][y2 - 8][x2 - 8] = id;dx[0][y2 - 8][x2 - 7] = id;
	dx[0][y2 - 8][x2 - 6] = id;dx[0][y2 - 8][x2 - 5] = id;dx[0][y2 - 8][x2 - 4] = id;dx[0][y2 - 8][x2 - 3] = id;dx[0][y2 - 8][x2 - 2] = id;dx[0][y2 - 8][x2 - 1] = id;dx[0][y2 - 8][x2 + 0] = id;dx[0][y2 - 8][x2 + 1] = id;dx[0][y2 - 8][x2 + 2] = id;
	dx[0][y2 - 8][x2 + 3] = id;dx[0][y2 - 8][x2 + 4] = id;dx[0][y2 - 8][x2 + 5] = id;dx[0][y2 - 8][x2 + 6] = id;dx[0][y2 - 8][x2 + 7] = id;dx[0][y2 - 8][x2 + 8] = id;dx[0][y2 - 8][x2 + 9] = id;dx[0][y2 - 8][x2 + 10] = id;dx[0][y2 - 7][x2 - 10] = id;
	dx[0][y2 - 7][x2 - 9] = id;dx[0][y2 - 7][x2 - 8] = id;dx[0][y2 - 7][x2 - 7] = id;dx[0][y2 - 7][x2 - 6] = id;dx[0][y2 - 7][x2 - 5] = id;dx[0][y2 - 7][x2 - 4] = id;dx[0][y2 - 7][x2 - 3] = id;dx[0][y2 - 7][x2 - 2] = id;dx[0][y2 - 7][x2 - 1] = id;
	dx[0][y2 - 7][x2 + 0] = id;dx[0][y2 - 7][x2 + 1] = id;dx[0][y2 - 7][x2 + 2] = id;dx[0][y2 - 7][x2 + 3] = id;dx[0][y2 - 7][x2 + 4] = id;dx[0][y2 - 7][x2 + 5] = id;dx[0][y2 - 7][x2 + 6] = id;dx[0][y2 - 7][x2 + 7] = id;dx[0][y2 - 7][x2 + 8] = id;
	dx[0][y2 - 7][x2 + 9] = id;dx[0][y2 - 7][x2 + 10] = id;dx[0][y2 - 6][x2 - 11] = id;dx[0][y2 - 6][x2 - 10] = id;dx[0][y2 - 6][x2 - 9] = id;dx[0][y2 - 6][x2 - 8] = id;dx[0][y2 - 6][x2 - 7] = id;dx[0][y2 - 6][x2 - 6] = id;dx[0][y2 - 6][x2 - 5] = id;
	dx[0][y2 - 6][x2 - 4] = id;dx[0][y2 - 6][x2 - 3] = id;dx[0][y2 - 6][x2 - 2] = id;dx[0][y2 - 6][x2 - 1] = id;dx[0][y2 - 6][x2 + 0] = id;dx[0][y2 - 6][x2 + 1] = id;dx[0][y2 - 6][x2 + 2] = id;dx[0][y2 - 6][x2 + 3] = id;dx[0][y2 - 6][x2 + 4] = id;
	dx[0][y2 - 6][x2 + 5] = id;dx[0][y2 - 6][x2 + 6] = id;dx[0][y2 - 6][x2 + 7] = id;dx[0][y2 - 6][x2 + 8] = id;dx[0][y2 - 6][x2 + 9] = id;dx[0][y2 - 6][x2 + 10] = id;dx[0][y2 - 6][x2 + 11] = id;dx[0][y2 - 5][x2 - 12] = id;dx[0][y2 - 5][x2 - 11] = id;
	dx[0][y2 - 5][x2 - 10] = id;dx[0][y2 - 5][x2 - 9] = id;dx[0][y2 - 5][x2 - 8] = id;dx[0][y2 - 5][x2 - 7] = id;dx[0][y2 - 5][x2 - 6] = id;dx[0][y2 - 5][x2 - 5] = id;dx[0][y2 - 5][x2 - 4] = id;dx[0][y2 - 5][x2 - 3] = id;dx[0][y2 - 5][x2 - 2] = id;
	dx[0][y2 - 5][x2 - 1] = id;dx[0][y2 - 5][x2 + 0] = id;dx[0][y2 - 5][x2 + 1] = id;dx[0][y2 - 5][x2 + 2] = id;dx[0][y2 - 5][x2 + 3] = id;dx[0][y2 - 5][x2 + 4] = id;dx[0][y2 - 5][x2 + 5] = id;dx[0][y2 - 5][x2 + 6] = id;dx[0][y2 - 5][x2 + 7] = id;
	dx[0][y2 - 5][x2 + 8] = id;dx[0][y2 - 5][x2 + 9] = id;dx[0][y2 - 5][x2 + 10] = id;dx[0][y2 - 5][x2 + 11] = id;dx[0][y2 - 5][x2 + 12] = id;dx[0][y2 - 4][x2 - 13] = id;dx[0][y2 - 4][x2 - 12] = id;dx[0][y2 - 4][x2 - 10] = id;dx[0][y2 - 4][x2 - 9] = id;
	dx[0][y2 - 4][x2 - 8] = id;dx[0][y2 - 4][x2 - 7] = id;dx[0][y2 - 4][x2 - 6] = id;dx[0][y2 - 4][x2 - 5] = id;dx[0][y2 - 4][x2 - 4] = id;dx[0][y2 - 4][x2 - 3] = id;dx[0][y2 - 4][x2 - 2] = id;dx[0][y2 - 4][x2 - 1] = id;dx[0][y2 - 4][x2 + 0] = id;
	dx[0][y2 - 4][x2 + 1] = id;dx[0][y2 - 4][x2 + 2] = id;dx[0][y2 - 4][x2 + 3] = id;dx[0][y2 - 4][x2 + 4] = id;dx[0][y2 - 4][x2 + 5] = id;dx[0][y2 - 4][x2 + 6] = id;dx[0][y2 - 4][x2 + 7] = id;dx[0][y2 - 4][x2 + 8] = id;dx[0][y2 - 4][x2 + 9] = id;
	dx[0][y2 - 4][x2 + 10] = id;dx[0][y2 - 4][x2 + 12] = id;dx[0][y2 - 4][x2 + 13] = id;dx[0][y2 - 3][x2 - 13] = id;dx[0][y2 - 3][x2 - 12] = id;dx[0][y2 - 3][x2 - 5] = id;dx[0][y2 - 3][x2 - 4] = id;dx[0][y2 - 3][x2 - 3] = id;dx[0][y2 - 3][x2 - 2] = id;
	dx[0][y2 - 3][x2 - 1] = id;dx[0][y2 - 3][x2 + 0] = id;dx[0][y2 - 3][x2 + 1] = id;dx[0][y2 - 3][x2 + 2] = id;dx[0][y2 - 3][x2 + 3] = id;dx[0][y2 - 3][x2 + 4] = id;dx[0][y2 - 3][x2 + 5] = id;dx[0][y2 - 3][x2 + 12] = id;dx[0][y2 - 3][x2 + 13] = id;
	dx[0][y2 - 2][x2 - 12] = id;dx[0][y2 - 2][x2 - 11] = id;dx[0][y2 - 2][x2 - 10] = id;dx[0][y2 - 2][x2 - 9] = id;dx[0][y2 - 2][x2 - 8] = id;dx[0][y2 - 2][x2 + 8] = id;dx[0][y2 - 2][x2 + 9] = id;dx[0][y2 - 2][x2 + 10] = id;dx[0][y2 - 2][x2 + 11] = id;
	dx[0][y2 - 2][x2 + 12] = id;dx[0][y2 - 1][x2 - 11] = id;dx[0][y2 - 1][x2 - 10] = id;dx[0][y2 - 1][x2 - 9] = id;dx[0][y2 - 1][x2 - 8] = id;dx[0][y2 - 1][x2 - 7] = id;dx[0][y2 - 1][x2 - 6] = id;dx[0][y2 - 1][x2 - 5] = id;dx[0][y2 - 1][x2 - 4] = id;
	dx[0][y2 - 1][x2 - 3] = id;dx[0][y2 - 1][x2 - 2] = id;dx[0][y2 - 1][x2 - 1] = id;dx[0][y2 - 1][x2 + 0] = id;dx[0][y2 - 1][x2 + 1] = id;dx[0][y2 - 1][x2 + 2] = id;dx[0][y2 - 1][x2 + 3] = id;dx[0][y2 - 1][x2 + 4] = id;dx[0][y2 - 1][x2 + 5] = id;
	dx[0][y2 - 1][x2 + 6] = id;dx[0][y2 - 1][x2 + 7] = id;dx[0][y2 - 1][x2 + 8] = id;dx[0][y2 - 1][x2 + 9] = id;dx[0][y2 - 1][x2 + 10] = id;dx[0][y2 - 1][x2 + 11] = id;dx[0][y2 + 0][x2 - 12] = id;dx[0][y2 + 0][x2 - 11] = id;dx[0][y2 + 0][x2 - 10] = id;
	dx[0][y2 + 0][x2 - 9] = id;dx[0][y2 + 0][x2 - 8] = id;dx[0][y2 + 0][x2 - 7] = id;dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;dx[0][y2 + 0][x2 - 1] = id;
	dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;dx[0][y2 + 0][x2 + 7] = id;dx[0][y2 + 0][x2 + 8] = id;
	dx[0][y2 + 0][x2 + 9] = id;dx[0][y2 + 0][x2 + 10] = id;dx[0][y2 + 0][x2 + 11] = id;dx[0][y2 + 0][x2 + 12] = id;dx[0][y2 + 1][x2 - 14] = id;dx[0][y2 + 1][x2 - 13] = id;dx[0][y2 + 1][x2 - 12] = id;dx[0][y2 + 1][x2 - 11] = id;dx[0][y2 + 1][x2 - 10] = id;
	dx[0][y2 + 1][x2 - 9] = id;dx[0][y2 + 1][x2 - 8] = id;dx[0][y2 + 1][x2 - 7] = id;dx[0][y2 + 1][x2 - 6] = id;dx[0][y2 + 1][x2 - 5] = id;dx[0][y2 + 1][x2 - 4] = id;dx[0][y2 + 1][x2 - 3] = id;dx[0][y2 + 1][x2 - 2] = id;dx[0][y2 + 1][x2 - 1] = id;
	dx[0][y2 + 1][x2 + 0] = id;dx[0][y2 + 1][x2 + 1] = id;dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 1][x2 + 3] = id;dx[0][y2 + 1][x2 + 4] = id;dx[0][y2 + 1][x2 + 5] = id;dx[0][y2 + 1][x2 + 6] = id;dx[0][y2 + 1][x2 + 7] = id;dx[0][y2 + 1][x2 + 8] = id;
	dx[0][y2 + 1][x2 + 9] = id;dx[0][y2 + 1][x2 + 10] = id;dx[0][y2 + 1][x2 + 11] = id;dx[0][y2 + 1][x2 + 12] = id;dx[0][y2 + 1][x2 + 13] = id;dx[0][y2 + 1][x2 + 14] = id;dx[0][y2 + 2][x2 - 16] = id;dx[0][y2 + 2][x2 - 15] = id;dx[0][y2 + 2][x2 - 14] = id;
	dx[0][y2 + 2][x2 + 0] = id;dx[0][y2 + 2][x2 + 14] = id;dx[0][y2 + 2][x2 + 15] = id;dx[0][y2 + 2][x2 + 16] = id;dx[0][y2 + 3][x2 - 16] = id;dx[0][y2 + 3][x2 + 16] = id;dx[0][y2 + 4][x2 - 20] = id;dx[0][y2 + 4][x2 - 19] = id;dx[0][y2 + 4][x2 - 18] = id;
	dx[0][y2 + 4][x2 - 17] = id;dx[0][y2 + 4][x2 - 16] = id;dx[0][y2 + 4][x2 - 15] = id;dx[0][y2 + 4][x2 - 14] = id;dx[0][y2 + 4][x2 - 13] = id;dx[0][y2 + 4][x2 - 12] = id;dx[0][y2 + 4][x2 - 11] = id;dx[0][y2 + 4][x2 - 10] = id;dx[0][y2 + 4][x2 - 9] = id;
	dx[0][y2 + 4][x2 - 8] = id;dx[0][y2 + 4][x2 - 7] = id;dx[0][y2 + 4][x2 - 6] = id;dx[0][y2 + 4][x2 - 5] = id;dx[0][y2 + 4][x2 - 4] = id;dx[0][y2 + 4][x2 - 3] = id;dx[0][y2 + 4][x2 - 2] = id;dx[0][y2 + 4][x2 - 1] = id;dx[0][y2 + 4][x2 + 0] = id;
	dx[0][y2 + 4][x2 + 1] = id;dx[0][y2 + 4][x2 + 2] = id;dx[0][y2 + 4][x2 + 3] = id;dx[0][y2 + 4][x2 + 4] = id;dx[0][y2 + 4][x2 + 5] = id;dx[0][y2 + 4][x2 + 6] = id;dx[0][y2 + 4][x2 + 7] = id;dx[0][y2 + 4][x2 + 8] = id;dx[0][y2 + 4][x2 + 9] = id;
	dx[0][y2 + 4][x2 + 10] = id;dx[0][y2 + 4][x2 + 11] = id;dx[0][y2 + 4][x2 + 12] = id;dx[0][y2 + 4][x2 + 13] = id;dx[0][y2 + 4][x2 + 14] = id;dx[0][y2 + 4][x2 + 15] = id;dx[0][y2 + 4][x2 + 16] = id;dx[0][y2 + 4][x2 + 17] = id;dx[0][y2 + 4][x2 + 18] = id;
	dx[0][y2 + 4][x2 + 19] = id;dx[0][y2 + 5][x2 - 21] = id;dx[0][y2 + 5][x2 - 20] = id;dx[0][y2 + 5][x2 - 19] = id;dx[0][y2 + 5][x2 - 18] = id;dx[0][y2 + 5][x2 - 17] = id;dx[0][y2 + 5][x2 - 16] = id;dx[0][y2 + 5][x2 - 15] = id;dx[0][y2 + 5][x2 - 14] = id;
	dx[0][y2 + 5][x2 - 13] = id;dx[0][y2 + 5][x2 - 12] = id;dx[0][y2 + 5][x2 - 11] = id;dx[0][y2 + 5][x2 - 10] = id;dx[0][y2 + 5][x2 - 9] = id;dx[0][y2 + 5][x2 - 8] = id;dx[0][y2 + 5][x2 - 7] = id;dx[0][y2 + 5][x2 - 6] = id;dx[0][y2 + 5][x2 - 5] = id;
	dx[0][y2 + 5][x2 - 4] = id;dx[0][y2 + 5][x2 - 3] = id;dx[0][y2 + 5][x2 - 2] = id;dx[0][y2 + 5][x2 - 1] = id;dx[0][y2 + 5][x2 + 0] = id;dx[0][y2 + 5][x2 + 1] = id;dx[0][y2 + 5][x2 + 2] = id;dx[0][y2 + 5][x2 + 3] = id;dx[0][y2 + 5][x2 + 4] = id;
	dx[0][y2 + 5][x2 + 5] = id;dx[0][y2 + 5][x2 + 6] = id;dx[0][y2 + 5][x2 + 7] = id;dx[0][y2 + 5][x2 + 8] = id;dx[0][y2 + 5][x2 + 9] = id;dx[0][y2 + 5][x2 + 10] = id;dx[0][y2 + 5][x2 + 11] = id;dx[0][y2 + 5][x2 + 12] = id;dx[0][y2 + 5][x2 + 13] = id;
	dx[0][y2 + 5][x2 + 14] = id;dx[0][y2 + 5][x2 + 15] = id;dx[0][y2 + 5][x2 + 16] = id;dx[0][y2 + 5][x2 + 17] = id;dx[0][y2 + 5][x2 + 18] = id;dx[0][y2 + 5][x2 + 19] = id;dx[0][y2 + 5][x2 + 20] = id;
}

void citydoor(int x1, int y1)
{
	int id = 15;
	int x2 = x1 + 30 + 30;
	int y2 = 600 - y1;
	dx[0][y2 - 60][x2 + 90] = id;dx[0][y2 - 60][x2 + 91] = id;dx[0][y2 - 59][x2 + 88] = id;dx[0][y2 - 59][x2 + 93] = id;dx[0][y2 - 58][x2 + 86] = id;dx[0][y2 - 58][x2 + 95] = id;dx[0][y2 - 57][x2 + 82] = id;dx[0][y2 - 57][x2 + 84] = id;dx[0][y2 - 57][x2 + 97] = id;
	dx[0][y2 - 57][x2 + 100] = id;dx[0][y2 - 56][x2 + 82] = id;dx[0][y2 - 56][x2 + 83] = id;dx[0][y2 - 56][x2 + 99] = id;dx[0][y2 - 56][x2 + 100] = id;dx[0][y2 - 55][x2 + 82] = id;dx[0][y2 - 55][x2 + 83] = id;dx[0][y2 - 55][x2 + 84] = id;dx[0][y2 - 55][x2 + 85] = id;
	dx[0][y2 - 55][x2 + 86] = id;dx[0][y2 - 55][x2 + 87] = id;dx[0][y2 - 55][x2 + 88] = id;dx[0][y2 - 55][x2 + 89] = id;dx[0][y2 - 55][x2 + 90] = id;dx[0][y2 - 55][x2 + 91] = id;dx[0][y2 - 55][x2 + 92] = id;dx[0][y2 - 55][x2 + 93] = id;dx[0][y2 - 55][x2 + 94] = id;
	dx[0][y2 - 55][x2 + 95] = id;dx[0][y2 - 55][x2 + 96] = id;dx[0][y2 - 55][x2 + 97] = id;dx[0][y2 - 55][x2 + 98] = id;dx[0][y2 - 55][x2 + 99] = id;dx[0][y2 - 55][x2 + 100] = id;dx[0][y2 - 55][x2 + 168] = id;dx[0][y2 - 54][x2 + 82] = id;dx[0][y2 - 54][x2 + 85] = id;
	dx[0][y2 - 54][x2 + 89] = id;dx[0][y2 - 54][x2 + 94] = id;dx[0][y2 - 54][x2 + 97] = id;dx[0][y2 - 54][x2 + 100] = id;dx[0][y2 - 54][x2 + 167] = id;dx[0][y2 - 54][x2 + 169] = id;dx[0][y2 - 53][x2 + 82] = id;dx[0][y2 - 53][x2 + 85] = id;dx[0][y2 - 53][x2 + 88] = id;
	dx[0][y2 - 53][x2 + 95] = id;dx[0][y2 - 53][x2 + 97] = id;dx[0][y2 - 53][x2 + 100] = id;dx[0][y2 - 53][x2 + 122] = id;dx[0][y2 - 53][x2 + 166] = id;dx[0][y2 - 53][x2 + 171] = id;dx[0][y2 - 52][x2 + 82] = id;dx[0][y2 - 52][x2 + 85] = id;dx[0][y2 - 52][x2 + 86] = id;
	dx[0][y2 - 52][x2 + 96] = id;dx[0][y2 - 52][x2 + 97] = id;dx[0][y2 - 52][x2 + 100] = id;dx[0][y2 - 52][x2 + 120] = id;dx[0][y2 - 52][x2 + 122] = id;dx[0][y2 - 52][x2 + 165] = id;dx[0][y2 - 52][x2 + 173] = id;dx[0][y2 - 51][x2 + 82] = id;dx[0][y2 - 51][x2 + 85] = id;
	dx[0][y2 - 51][x2 + 97] = id;dx[0][y2 - 51][x2 + 100] = id;dx[0][y2 - 51][x2 + 118] = id;dx[0][y2 - 51][x2 + 122] = id;dx[0][y2 - 51][x2 + 163] = id;dx[0][y2 - 51][x2 + 174] = id;dx[0][y2 - 50][x2 + 82] = id;dx[0][y2 - 50][x2 + 85] = id;dx[0][y2 - 50][x2 + 97] = id;
	dx[0][y2 - 50][x2 + 100] = id;dx[0][y2 - 50][x2 + 116] = id;dx[0][y2 - 50][x2 + 122] = id;dx[0][y2 - 50][x2 + 144] = id;dx[0][y2 - 50][x2 + 145] = id;dx[0][y2 - 50][x2 + 160] = id;dx[0][y2 - 50][x2 + 162] = id;dx[0][y2 - 50][x2 + 176] = id;dx[0][y2 - 50][x2 + 179] = id;
	dx[0][y2 - 49][x2 + 82] = id;dx[0][y2 - 49][x2 + 85] = id;dx[0][y2 - 49][x2 + 97] = id;dx[0][y2 - 49][x2 + 100] = id;dx[0][y2 - 49][x2 + 115] = id;dx[0][y2 - 49][x2 + 123] = id;dx[0][y2 - 49][x2 + 143] = id;dx[0][y2 - 49][x2 + 144] = id;dx[0][y2 - 49][x2 + 145] = id;
	dx[0][y2 - 49][x2 + 146] = id;dx[0][y2 - 49][x2 + 160] = id;dx[0][y2 - 49][x2 + 161] = id;dx[0][y2 - 49][x2 + 162] = id;dx[0][y2 - 49][x2 + 163] = id;dx[0][y2 - 49][x2 + 164] = id;dx[0][y2 - 49][x2 + 165] = id;dx[0][y2 - 49][x2 + 166] = id;dx[0][y2 - 49][x2 + 167] = id;
	dx[0][y2 - 49][x2 + 168] = id;dx[0][y2 - 49][x2 + 169] = id;dx[0][y2 - 49][x2 + 170] = id;dx[0][y2 - 49][x2 + 171] = id;dx[0][y2 - 49][x2 + 172] = id;dx[0][y2 - 49][x2 + 173] = id;dx[0][y2 - 49][x2 + 174] = id;dx[0][y2 - 49][x2 + 175] = id;dx[0][y2 - 49][x2 + 176] = id;
	dx[0][y2 - 49][x2 + 177] = id;dx[0][y2 - 49][x2 + 178] = id;dx[0][y2 - 49][x2 + 179] = id;dx[0][y2 - 48][x2 + 82] = id;dx[0][y2 - 48][x2 + 85] = id;dx[0][y2 - 48][x2 + 97] = id;dx[0][y2 - 48][x2 + 100] = id;dx[0][y2 - 48][x2 + 113] = id;dx[0][y2 - 48][x2 + 123] = id;
	dx[0][y2 - 48][x2 + 143] = id;dx[0][y2 - 48][x2 + 147] = id;dx[0][y2 - 48][x2 + 148] = id;dx[0][y2 - 48][x2 + 149] = id;dx[0][y2 - 48][x2 + 160] = id;dx[0][y2 - 48][x2 + 167] = id;dx[0][y2 - 48][x2 + 168] = id;dx[0][y2 - 48][x2 + 169] = id;dx[0][y2 - 48][x2 + 170] = id;
	dx[0][y2 - 48][x2 + 171] = id;dx[0][y2 - 48][x2 + 179] = id;dx[0][y2 - 47][x2 + 82] = id;dx[0][y2 - 47][x2 + 85] = id;dx[0][y2 - 47][x2 + 97] = id;dx[0][y2 - 47][x2 + 100] = id;dx[0][y2 - 47][x2 + 111] = id;dx[0][y2 - 47][x2 + 123] = id;dx[0][y2 - 47][x2 + 143] = id;
	dx[0][y2 - 47][x2 + 149] = id;dx[0][y2 - 47][x2 + 150] = id;dx[0][y2 - 47][x2 + 151] = id;dx[0][y2 - 47][x2 + 152] = id;dx[0][y2 - 47][x2 + 160] = id;dx[0][y2 - 47][x2 + 164] = id;dx[0][y2 - 47][x2 + 165] = id;dx[0][y2 - 47][x2 + 166] = id;dx[0][y2 - 47][x2 + 172] = id;
	dx[0][y2 - 47][x2 + 173] = id;dx[0][y2 - 47][x2 + 174] = id;dx[0][y2 - 47][x2 + 179] = id;dx[0][y2 - 46][x2 + 82] = id;dx[0][y2 - 46][x2 + 85] = id;dx[0][y2 - 46][x2 + 97] = id;dx[0][y2 - 46][x2 + 100] = id;dx[0][y2 - 46][x2 + 110] = id;dx[0][y2 - 46][x2 + 124] = id;
	dx[0][y2 - 46][x2 + 143] = id;dx[0][y2 - 46][x2 + 146] = id;dx[0][y2 - 46][x2 + 147] = id;dx[0][y2 - 46][x2 + 148] = id;dx[0][y2 - 46][x2 + 149] = id;dx[0][y2 - 46][x2 + 152] = id;dx[0][y2 - 46][x2 + 153] = id;dx[0][y2 - 46][x2 + 154] = id;dx[0][y2 - 46][x2 + 160] = id;
	dx[0][y2 - 46][x2 + 162] = id;dx[0][y2 - 46][x2 + 163] = id;dx[0][y2 - 46][x2 + 175] = id;dx[0][y2 - 46][x2 + 176] = id;dx[0][y2 - 46][x2 + 177] = id;dx[0][y2 - 46][x2 + 179] = id;dx[0][y2 - 45][x2 + 82] = id;dx[0][y2 - 45][x2 + 85] = id;dx[0][y2 - 45][x2 + 97] = id;
	dx[0][y2 - 45][x2 + 100] = id;dx[0][y2 - 45][x2 + 108] = id;dx[0][y2 - 45][x2 + 109] = id;dx[0][y2 - 45][x2 + 124] = id;dx[0][y2 - 45][x2 + 143] = id;dx[0][y2 - 45][x2 + 145] = id;dx[0][y2 - 45][x2 + 146] = id;dx[0][y2 - 45][x2 + 154] = id;dx[0][y2 - 45][x2 + 155] = id;
	dx[0][y2 - 45][x2 + 156] = id;dx[0][y2 - 45][x2 + 160] = id;dx[0][y2 - 45][x2 + 161] = id;dx[0][y2 - 45][x2 + 178] = id;dx[0][y2 - 45][x2 + 179] = id;dx[0][y2 - 44][x2 + 82] = id;dx[0][y2 - 44][x2 + 85] = id;dx[0][y2 - 44][x2 + 97] = id;dx[0][y2 - 44][x2 + 100] = id;
	dx[0][y2 - 44][x2 + 107] = id;dx[0][y2 - 44][x2 + 110] = id;dx[0][y2 - 44][x2 + 125] = id;dx[0][y2 - 44][x2 + 143] = id;dx[0][y2 - 44][x2 + 144] = id;dx[0][y2 - 44][x2 + 145] = id;dx[0][y2 - 44][x2 + 157] = id;dx[0][y2 - 44][x2 + 158] = id;dx[0][y2 - 44][x2 + 160] = id;
	dx[0][y2 - 44][x2 + 179] = id;dx[0][y2 - 43][x2 + 82] = id;dx[0][y2 - 43][x2 + 85] = id;dx[0][y2 - 43][x2 + 97] = id;dx[0][y2 - 43][x2 + 100] = id;dx[0][y2 - 43][x2 + 106] = id;dx[0][y2 - 43][x2 + 111] = id;dx[0][y2 - 43][x2 + 126] = id;dx[0][y2 - 43][x2 + 143] = id;
	dx[0][y2 - 43][x2 + 144] = id;dx[0][y2 - 43][x2 + 158] = id;dx[0][y2 - 43][x2 + 159] = id;dx[0][y2 - 43][x2 + 160] = id;dx[0][y2 - 43][x2 + 179] = id;dx[0][y2 - 42][x2 + 82] = id;dx[0][y2 - 42][x2 + 85] = id;dx[0][y2 - 42][x2 + 97] = id;dx[0][y2 - 42][x2 + 100] = id;
	dx[0][y2 - 42][x2 + 105] = id;dx[0][y2 - 42][x2 + 112] = id;dx[0][y2 - 42][x2 + 128] = id;dx[0][y2 - 42][x2 + 143] = id;dx[0][y2 - 42][x2 + 160] = id;dx[0][y2 - 42][x2 + 179] = id;dx[0][y2 - 41][x2 + 82] = id;dx[0][y2 - 41][x2 + 85] = id;dx[0][y2 - 41][x2 + 97] = id;
	dx[0][y2 - 41][x2 + 100] = id;dx[0][y2 - 41][x2 + 103] = id;dx[0][y2 - 41][x2 + 113] = id;dx[0][y2 - 41][x2 + 129] = id;dx[0][y2 - 41][x2 + 160] = id;dx[0][y2 - 41][x2 + 179] = id;dx[0][y2 - 40][x2 + 82] = id;dx[0][y2 - 40][x2 + 85] = id;dx[0][y2 - 40][x2 + 97] = id;
	dx[0][y2 - 40][x2 + 100] = id;dx[0][y2 - 40][x2 + 102] = id;dx[0][y2 - 40][x2 + 114] = id;dx[0][y2 - 40][x2 + 115] = id;dx[0][y2 - 40][x2 + 116] = id;dx[0][y2 - 40][x2 + 117] = id;dx[0][y2 - 40][x2 + 118] = id;dx[0][y2 - 40][x2 + 130] = id;dx[0][y2 - 40][x2 + 160] = id;
	dx[0][y2 - 40][x2 + 179] = id;dx[0][y2 - 39][x2 + 53] = id;dx[0][y2 - 39][x2 + 82] = id;dx[0][y2 - 39][x2 + 85] = id;dx[0][y2 - 39][x2 + 97] = id;dx[0][y2 - 39][x2 + 100] = id;dx[0][y2 - 39][x2 + 101] = id;dx[0][y2 - 39][x2 + 119] = id;dx[0][y2 - 39][x2 + 120] = id;
	dx[0][y2 - 39][x2 + 121] = id;dx[0][y2 - 39][x2 + 122] = id;dx[0][y2 - 39][x2 + 123] = id;dx[0][y2 - 39][x2 + 132] = id;dx[0][y2 - 39][x2 + 160] = id;dx[0][y2 - 39][x2 + 179] = id;dx[0][y2 - 38][x2 + 53] = id;dx[0][y2 - 38][x2 + 54] = id;dx[0][y2 - 38][x2 + 82] = id;
	dx[0][y2 - 38][x2 + 85] = id;dx[0][y2 - 38][x2 + 97] = id;dx[0][y2 - 38][x2 + 100] = id;dx[0][y2 - 38][x2 + 125] = id;dx[0][y2 - 38][x2 + 126] = id;dx[0][y2 - 38][x2 + 127] = id;dx[0][y2 - 38][x2 + 128] = id;dx[0][y2 - 38][x2 + 129] = id;dx[0][y2 - 38][x2 + 130] = id;
	dx[0][y2 - 38][x2 + 160] = id;dx[0][y2 - 38][x2 + 179] = id;dx[0][y2 - 37][x2 + 53] = id;dx[0][y2 - 37][x2 + 54] = id;dx[0][y2 - 37][x2 + 55] = id;dx[0][y2 - 37][x2 + 56] = id;dx[0][y2 - 37][x2 + 57] = id;dx[0][y2 - 37][x2 + 58] = id;dx[0][y2 - 37][x2 + 59] = id;
	dx[0][y2 - 37][x2 + 60] = id;dx[0][y2 - 37][x2 + 61] = id;dx[0][y2 - 37][x2 + 62] = id;dx[0][y2 - 37][x2 + 63] = id;dx[0][y2 - 37][x2 + 64] = id;dx[0][y2 - 37][x2 + 65] = id;dx[0][y2 - 37][x2 + 66] = id;dx[0][y2 - 37][x2 + 67] = id;dx[0][y2 - 37][x2 + 68] = id;
	dx[0][y2 - 37][x2 + 69] = id;dx[0][y2 - 37][x2 + 70] = id;dx[0][y2 - 37][x2 + 71] = id;dx[0][y2 - 37][x2 + 72] = id;dx[0][y2 - 37][x2 + 73] = id;dx[0][y2 - 37][x2 + 74] = id;dx[0][y2 - 37][x2 + 75] = id;dx[0][y2 - 37][x2 + 76] = id;dx[0][y2 - 37][x2 + 77] = id;
	dx[0][y2 - 37][x2 + 78] = id;dx[0][y2 - 37][x2 + 79] = id;dx[0][y2 - 37][x2 + 80] = id;dx[0][y2 - 37][x2 + 81] = id;dx[0][y2 - 37][x2 + 82] = id;dx[0][y2 - 37][x2 + 83] = id;dx[0][y2 - 37][x2 + 84] = id;dx[0][y2 - 37][x2 + 85] = id;dx[0][y2 - 37][x2 + 86] = id;
	dx[0][y2 - 37][x2 + 87] = id;dx[0][y2 - 37][x2 + 88] = id;dx[0][y2 - 37][x2 + 89] = id;dx[0][y2 - 37][x2 + 90] = id;dx[0][y2 - 37][x2 + 91] = id;dx[0][y2 - 37][x2 + 92] = id;dx[0][y2 - 37][x2 + 93] = id;dx[0][y2 - 37][x2 + 94] = id;dx[0][y2 - 37][x2 + 95] = id;
	dx[0][y2 - 37][x2 + 96] = id;dx[0][y2 - 37][x2 + 97] = id;dx[0][y2 - 37][x2 + 98] = id;dx[0][y2 - 37][x2 + 99] = id;dx[0][y2 - 37][x2 + 100] = id;dx[0][y2 - 37][x2 + 160] = id;dx[0][y2 - 37][x2 + 179] = id;dx[0][y2 - 36][x2 + 53] = id;dx[0][y2 - 36][x2 + 56] = id;
	dx[0][y2 - 36][x2 + 68] = id;dx[0][y2 - 36][x2 + 70] = id;dx[0][y2 - 36][x2 + 80] = id;dx[0][y2 - 36][x2 + 88] = id;dx[0][y2 - 36][x2 + 97] = id;dx[0][y2 - 36][x2 + 100] = id;dx[0][y2 - 36][x2 + 160] = id;dx[0][y2 - 36][x2 + 179] = id;dx[0][y2 - 35][x2 + 53] = id;
	dx[0][y2 - 35][x2 + 56] = id;dx[0][y2 - 35][x2 + 67] = id;dx[0][y2 - 35][x2 + 71] = id;dx[0][y2 - 35][x2 + 80] = id;dx[0][y2 - 35][x2 + 81] = id;dx[0][y2 - 35][x2 + 82] = id;dx[0][y2 - 35][x2 + 83] = id;dx[0][y2 - 35][x2 + 84] = id;dx[0][y2 - 35][x2 + 85] = id;
	dx[0][y2 - 35][x2 + 86] = id;dx[0][y2 - 35][x2 + 87] = id;dx[0][y2 - 35][x2 + 88] = id;dx[0][y2 - 35][x2 + 97] = id;dx[0][y2 - 35][x2 + 100] = id;dx[0][y2 - 35][x2 + 154] = id;dx[0][y2 - 35][x2 + 155] = id;dx[0][y2 - 35][x2 + 156] = id;dx[0][y2 - 35][x2 + 157] = id;
	dx[0][y2 - 35][x2 + 158] = id;dx[0][y2 - 35][x2 + 159] = id;dx[0][y2 - 35][x2 + 160] = id;dx[0][y2 - 35][x2 + 161] = id;dx[0][y2 - 35][x2 + 162] = id;dx[0][y2 - 35][x2 + 163] = id;dx[0][y2 - 35][x2 + 164] = id;dx[0][y2 - 35][x2 + 165] = id;dx[0][y2 - 35][x2 + 166] = id;
	dx[0][y2 - 35][x2 + 167] = id;dx[0][y2 - 35][x2 + 168] = id;dx[0][y2 - 35][x2 + 169] = id;dx[0][y2 - 35][x2 + 170] = id;dx[0][y2 - 35][x2 + 171] = id;dx[0][y2 - 35][x2 + 172] = id;dx[0][y2 - 35][x2 + 173] = id;dx[0][y2 - 35][x2 + 174] = id;dx[0][y2 - 35][x2 + 175] = id;
	dx[0][y2 - 35][x2 + 176] = id;dx[0][y2 - 35][x2 + 177] = id;dx[0][y2 - 35][x2 + 178] = id;dx[0][y2 - 35][x2 + 179] = id;dx[0][y2 - 35][x2 + 180] = id;dx[0][y2 - 35][x2 + 181] = id;dx[0][y2 - 35][x2 + 182] = id;dx[0][y2 - 35][x2 + 183] = id;dx[0][y2 - 35][x2 + 184] = id;
	dx[0][y2 - 35][x2 + 185] = id;dx[0][y2 - 35][x2 + 186] = id;dx[0][y2 - 35][x2 + 187] = id;dx[0][y2 - 35][x2 + 188] = id;dx[0][y2 - 35][x2 + 189] = id;dx[0][y2 - 35][x2 + 190] = id;dx[0][y2 - 35][x2 + 191] = id;dx[0][y2 - 35][x2 + 192] = id;dx[0][y2 - 35][x2 + 193] = id;
	dx[0][y2 - 35][x2 + 194] = id;dx[0][y2 - 35][x2 + 195] = id;dx[0][y2 - 35][x2 + 196] = id;dx[0][y2 - 35][x2 + 197] = id;dx[0][y2 - 35][x2 + 198] = id;dx[0][y2 - 35][x2 + 199] = id;dx[0][y2 - 35][x2 + 200] = id;dx[0][y2 - 35][x2 + 201] = id;dx[0][y2 - 35][x2 + 202] = id;
	dx[0][y2 - 35][x2 + 203] = id;dx[0][y2 - 35][x2 + 204] = id;dx[0][y2 - 35][x2 + 205] = id;dx[0][y2 - 35][x2 + 206] = id;dx[0][y2 - 35][x2 + 207] = id;dx[0][y2 - 35][x2 + 208] = id;dx[0][y2 - 35][x2 + 209] = id;dx[0][y2 - 35][x2 + 210] = id;dx[0][y2 - 35][x2 + 211] = id;
	dx[0][y2 - 35][x2 + 212] = id;dx[0][y2 - 35][x2 + 213] = id;dx[0][y2 - 35][x2 + 214] = id;dx[0][y2 - 34][x2 + 53] = id;dx[0][y2 - 34][x2 + 56] = id;dx[0][y2 - 34][x2 + 67] = id;dx[0][y2 - 34][x2 + 68] = id;dx[0][y2 - 34][x2 + 69] = id;dx[0][y2 - 34][x2 + 70] = id;
	dx[0][y2 - 34][x2 + 71] = id;dx[0][y2 - 34][x2 + 72] = id;dx[0][y2 - 34][x2 + 82] = id;dx[0][y2 - 34][x2 + 85] = id;dx[0][y2 - 34][x2 + 97] = id;dx[0][y2 - 34][x2 + 100] = id;dx[0][y2 - 34][x2 + 154] = id;dx[0][y2 - 34][x2 + 155] = id;dx[0][y2 - 34][x2 + 156] = id;
	dx[0][y2 - 34][x2 + 157] = id;dx[0][y2 - 34][x2 + 158] = id;dx[0][y2 - 34][x2 + 159] = id;dx[0][y2 - 34][x2 + 160] = id;dx[0][y2 - 34][x2 + 161] = id;dx[0][y2 - 34][x2 + 162] = id;dx[0][y2 - 34][x2 + 163] = id;dx[0][y2 - 34][x2 + 164] = id;dx[0][y2 - 34][x2 + 165] = id;
	dx[0][y2 - 34][x2 + 166] = id;dx[0][y2 - 34][x2 + 167] = id;dx[0][y2 - 34][x2 + 168] = id;dx[0][y2 - 34][x2 + 169] = id;dx[0][y2 - 34][x2 + 170] = id;dx[0][y2 - 34][x2 + 171] = id;dx[0][y2 - 34][x2 + 172] = id;dx[0][y2 - 34][x2 + 173] = id;dx[0][y2 - 34][x2 + 174] = id;
	dx[0][y2 - 34][x2 + 175] = id;dx[0][y2 - 34][x2 + 176] = id;dx[0][y2 - 34][x2 + 177] = id;dx[0][y2 - 34][x2 + 178] = id;dx[0][y2 - 34][x2 + 179] = id;dx[0][y2 - 34][x2 + 180] = id;dx[0][y2 - 34][x2 + 181] = id;dx[0][y2 - 34][x2 + 182] = id;dx[0][y2 - 34][x2 + 183] = id;
	dx[0][y2 - 34][x2 + 184] = id;dx[0][y2 - 34][x2 + 185] = id;dx[0][y2 - 34][x2 + 186] = id;dx[0][y2 - 34][x2 + 187] = id;dx[0][y2 - 34][x2 + 188] = id;dx[0][y2 - 34][x2 + 189] = id;dx[0][y2 - 34][x2 + 190] = id;dx[0][y2 - 34][x2 + 191] = id;dx[0][y2 - 34][x2 + 192] = id;
	dx[0][y2 - 34][x2 + 193] = id;dx[0][y2 - 34][x2 + 194] = id;dx[0][y2 - 34][x2 + 195] = id;dx[0][y2 - 34][x2 + 196] = id;dx[0][y2 - 34][x2 + 197] = id;dx[0][y2 - 34][x2 + 198] = id;dx[0][y2 - 34][x2 + 199] = id;dx[0][y2 - 34][x2 + 200] = id;dx[0][y2 - 34][x2 + 201] = id;
	dx[0][y2 - 34][x2 + 202] = id;dx[0][y2 - 34][x2 + 203] = id;dx[0][y2 - 34][x2 + 204] = id;dx[0][y2 - 34][x2 + 205] = id;dx[0][y2 - 34][x2 + 206] = id;dx[0][y2 - 34][x2 + 207] = id;dx[0][y2 - 34][x2 + 208] = id;dx[0][y2 - 34][x2 + 209] = id;dx[0][y2 - 34][x2 + 210] = id;
	dx[0][y2 - 34][x2 + 211] = id;dx[0][y2 - 34][x2 + 212] = id;dx[0][y2 - 34][x2 + 213] = id;dx[0][y2 - 33][x2 + 53] = id;dx[0][y2 - 33][x2 + 56] = id;dx[0][y2 - 33][x2 + 68] = id;dx[0][y2 - 33][x2 + 71] = id;dx[0][y2 - 33][x2 + 82] = id;dx[0][y2 - 33][x2 + 85] = id;
	dx[0][y2 - 33][x2 + 86] = id;dx[0][y2 - 33][x2 + 87] = id;dx[0][y2 - 33][x2 + 88] = id;dx[0][y2 - 33][x2 + 97] = id;dx[0][y2 - 33][x2 + 100] = id;dx[0][y2 - 33][x2 + 154] = id;dx[0][y2 - 33][x2 + 210] = id;dx[0][y2 - 33][x2 + 212] = id;dx[0][y2 - 32][x2 + 53] = id;
	dx[0][y2 - 32][x2 + 56] = id;dx[0][y2 - 32][x2 + 68] = id;dx[0][y2 - 32][x2 + 71] = id;dx[0][y2 - 32][x2 + 82] = id;dx[0][y2 - 32][x2 + 85] = id;dx[0][y2 - 32][x2 + 88] = id;dx[0][y2 - 32][x2 + 97] = id;dx[0][y2 - 32][x2 + 100] = id;dx[0][y2 - 32][x2 + 154] = id;
	dx[0][y2 - 32][x2 + 210] = id;dx[0][y2 - 32][x2 + 212] = id;dx[0][y2 - 31][x2 + 53] = id;dx[0][y2 - 31][x2 + 56] = id;dx[0][y2 - 31][x2 + 68] = id;dx[0][y2 - 31][x2 + 71] = id;dx[0][y2 - 31][x2 + 82] = id;dx[0][y2 - 31][x2 + 83] = id;dx[0][y2 - 31][x2 + 84] = id;
	dx[0][y2 - 31][x2 + 85] = id;dx[0][y2 - 31][x2 + 88] = id;dx[0][y2 - 31][x2 + 89] = id;dx[0][y2 - 31][x2 + 97] = id;dx[0][y2 - 31][x2 + 100] = id;dx[0][y2 - 31][x2 + 154] = id;dx[0][y2 - 31][x2 + 155] = id;dx[0][y2 - 31][x2 + 156] = id;dx[0][y2 - 31][x2 + 157] = id;
	dx[0][y2 - 31][x2 + 158] = id;dx[0][y2 - 31][x2 + 172] = id;dx[0][y2 - 31][x2 + 173] = id;dx[0][y2 - 31][x2 + 197] = id;dx[0][y2 - 31][x2 + 210] = id;dx[0][y2 - 31][x2 + 212] = id;dx[0][y2 - 30][x2 + 53] = id;dx[0][y2 - 30][x2 + 56] = id;dx[0][y2 - 30][x2 + 68] = id;
	dx[0][y2 - 30][x2 + 71] = id;dx[0][y2 - 30][x2 + 81] = id;dx[0][y2 - 30][x2 + 82] = id;dx[0][y2 - 30][x2 + 83] = id;dx[0][y2 - 30][x2 + 84] = id;dx[0][y2 - 30][x2 + 85] = id;dx[0][y2 - 30][x2 + 88] = id;dx[0][y2 - 30][x2 + 89] = id;dx[0][y2 - 30][x2 + 90] = id;
	dx[0][y2 - 30][x2 + 91] = id;dx[0][y2 - 30][x2 + 92] = id;dx[0][y2 - 30][x2 + 97] = id;dx[0][y2 - 30][x2 + 100] = id;dx[0][y2 - 30][x2 + 154] = id;dx[0][y2 - 30][x2 + 155] = id;dx[0][y2 - 30][x2 + 156] = id;dx[0][y2 - 30][x2 + 157] = id;dx[0][y2 - 30][x2 + 158] = id;
	dx[0][y2 - 30][x2 + 169] = id;dx[0][y2 - 30][x2 + 170] = id;dx[0][y2 - 30][x2 + 171] = id;dx[0][y2 - 30][x2 + 174] = id;dx[0][y2 - 30][x2 + 175] = id;dx[0][y2 - 30][x2 + 176] = id;dx[0][y2 - 30][x2 + 194] = id;dx[0][y2 - 30][x2 + 195] = id;dx[0][y2 - 30][x2 + 196] = id;
	dx[0][y2 - 30][x2 + 197] = id;dx[0][y2 - 30][x2 + 198] = id;dx[0][y2 - 30][x2 + 199] = id;dx[0][y2 - 30][x2 + 200] = id;dx[0][y2 - 30][x2 + 201] = id;dx[0][y2 - 30][x2 + 210] = id;dx[0][y2 - 30][x2 + 212] = id;dx[0][y2 - 29][x2 + 4] = id;dx[0][y2 - 29][x2 + 20] = id;
	dx[0][y2 - 29][x2 + 36] = id;dx[0][y2 - 29][x2 + 53] = id;dx[0][y2 - 29][x2 + 56] = id;dx[0][y2 - 29][x2 + 68] = id;dx[0][y2 - 29][x2 + 71] = id;dx[0][y2 - 29][x2 + 80] = id;dx[0][y2 - 29][x2 + 81] = id;dx[0][y2 - 29][x2 + 82] = id;dx[0][y2 - 29][x2 + 83] = id;
	dx[0][y2 - 29][x2 + 84] = id;dx[0][y2 - 29][x2 + 85] = id;dx[0][y2 - 29][x2 + 88] = id;dx[0][y2 - 29][x2 + 89] = id;dx[0][y2 - 29][x2 + 90] = id;dx[0][y2 - 29][x2 + 91] = id;dx[0][y2 - 29][x2 + 92] = id;dx[0][y2 - 29][x2 + 93] = id;dx[0][y2 - 29][x2 + 97] = id;
	dx[0][y2 - 29][x2 + 100] = id;dx[0][y2 - 29][x2 + 154] = id;dx[0][y2 - 29][x2 + 167] = id;dx[0][y2 - 29][x2 + 168] = id;dx[0][y2 - 29][x2 + 176] = id;dx[0][y2 - 29][x2 + 177] = id;dx[0][y2 - 29][x2 + 192] = id;dx[0][y2 - 29][x2 + 193] = id;dx[0][y2 - 29][x2 + 202] = id;
	dx[0][y2 - 29][x2 + 203] = id;dx[0][y2 - 29][x2 + 210] = id;dx[0][y2 - 29][x2 + 212] = id;dx[0][y2 - 28][x2 + 2] = id;dx[0][y2 - 28][x2 + 6] = id;dx[0][y2 - 28][x2 + 18] = id;dx[0][y2 - 28][x2 + 22] = id;dx[0][y2 - 28][x2 + 34] = id;dx[0][y2 - 28][x2 + 38] = id;
	dx[0][y2 - 28][x2 + 53] = id;dx[0][y2 - 28][x2 + 56] = id;dx[0][y2 - 28][x2 + 68] = id;dx[0][y2 - 28][x2 + 71] = id;dx[0][y2 - 28][x2 + 79] = id;dx[0][y2 - 28][x2 + 85] = id;dx[0][y2 - 28][x2 + 88] = id;dx[0][y2 - 28][x2 + 94] = id;dx[0][y2 - 28][x2 + 100] = id;
	dx[0][y2 - 28][x2 + 154] = id;dx[0][y2 - 28][x2 + 155] = id;dx[0][y2 - 28][x2 + 156] = id;dx[0][y2 - 28][x2 + 157] = id;dx[0][y2 - 28][x2 + 158] = id;dx[0][y2 - 28][x2 + 159] = id;dx[0][y2 - 28][x2 + 160] = id;dx[0][y2 - 28][x2 + 167] = id;dx[0][y2 - 28][x2 + 177] = id;
	dx[0][y2 - 28][x2 + 178] = id;dx[0][y2 - 28][x2 + 192] = id;dx[0][y2 - 28][x2 + 203] = id;dx[0][y2 - 28][x2 + 204] = id;dx[0][y2 - 28][x2 + 210] = id;dx[0][y2 - 28][x2 + 212] = id;dx[0][y2 - 27][x2 + 2] = id;dx[0][y2 - 27][x2 + 3] = id;dx[0][y2 - 27][x2 + 4] = id;
	dx[0][y2 - 27][x2 + 5] = id;dx[0][y2 - 27][x2 + 6] = id;dx[0][y2 - 27][x2 + 18] = id;dx[0][y2 - 27][x2 + 19] = id;dx[0][y2 - 27][x2 + 20] = id;dx[0][y2 - 27][x2 + 21] = id;dx[0][y2 - 27][x2 + 22] = id;dx[0][y2 - 27][x2 + 34] = id;dx[0][y2 - 27][x2 + 35] = id;
	dx[0][y2 - 27][x2 + 36] = id;dx[0][y2 - 27][x2 + 37] = id;dx[0][y2 - 27][x2 + 38] = id;dx[0][y2 - 27][x2 + 53] = id;dx[0][y2 - 27][x2 + 56] = id;dx[0][y2 - 27][x2 + 68] = id;dx[0][y2 - 27][x2 + 71] = id;dx[0][y2 - 27][x2 + 79] = id;dx[0][y2 - 27][x2 + 85] = id;
	dx[0][y2 - 27][x2 + 88] = id;dx[0][y2 - 27][x2 + 94] = id;dx[0][y2 - 27][x2 + 100] = id;dx[0][y2 - 27][x2 + 154] = id;dx[0][y2 - 27][x2 + 155] = id;dx[0][y2 - 27][x2 + 156] = id;dx[0][y2 - 27][x2 + 157] = id;dx[0][y2 - 27][x2 + 158] = id;dx[0][y2 - 27][x2 + 159] = id;
	dx[0][y2 - 27][x2 + 160] = id;dx[0][y2 - 27][x2 + 166] = id;dx[0][y2 - 27][x2 + 167] = id;dx[0][y2 - 27][x2 + 178] = id;dx[0][y2 - 27][x2 + 191] = id;dx[0][y2 - 27][x2 + 192] = id;dx[0][y2 - 27][x2 + 204] = id;dx[0][y2 - 27][x2 + 210] = id;dx[0][y2 - 27][x2 + 212] = id;
	dx[0][y2 - 26][x2 + 2] = id;dx[0][y2 - 26][x2 + 4] = id;dx[0][y2 - 26][x2 + 6] = id;dx[0][y2 - 26][x2 + 18] = id;dx[0][y2 - 26][x2 + 20] = id;dx[0][y2 - 26][x2 + 22] = id;dx[0][y2 - 26][x2 + 34] = id;dx[0][y2 - 26][x2 + 36] = id;dx[0][y2 - 26][x2 + 38] = id;
	dx[0][y2 - 26][x2 + 53] = id;dx[0][y2 - 26][x2 + 56] = id;dx[0][y2 - 26][x2 + 68] = id;dx[0][y2 - 26][x2 + 71] = id;dx[0][y2 - 26][x2 + 79] = id;dx[0][y2 - 26][x2 + 85] = id;dx[0][y2 - 26][x2 + 88] = id;dx[0][y2 - 26][x2 + 94] = id;dx[0][y2 - 26][x2 + 100] = id;
	dx[0][y2 - 26][x2 + 154] = id;dx[0][y2 - 26][x2 + 166] = id;dx[0][y2 - 26][x2 + 178] = id;dx[0][y2 - 26][x2 + 179] = id;dx[0][y2 - 26][x2 + 190] = id;dx[0][y2 - 26][x2 + 205] = id;dx[0][y2 - 26][x2 + 210] = id;dx[0][y2 - 26][x2 + 212] = id;dx[0][y2 - 25][x2 + 2] = id;
	dx[0][y2 - 25][x2 + 4] = id;dx[0][y2 - 25][x2 + 6] = id;dx[0][y2 - 25][x2 + 18] = id;dx[0][y2 - 25][x2 + 20] = id;dx[0][y2 - 25][x2 + 22] = id;dx[0][y2 - 25][x2 + 34] = id;dx[0][y2 - 25][x2 + 36] = id;dx[0][y2 - 25][x2 + 38] = id;dx[0][y2 - 25][x2 + 53] = id;
	dx[0][y2 - 25][x2 + 56] = id;dx[0][y2 - 25][x2 + 68] = id;dx[0][y2 - 25][x2 + 71] = id;dx[0][y2 - 25][x2 + 79] = id;dx[0][y2 - 25][x2 + 85] = id;dx[0][y2 - 25][x2 + 88] = id;dx[0][y2 - 25][x2 + 94] = id;dx[0][y2 - 25][x2 + 100] = id;dx[0][y2 - 25][x2 + 154] = id;
	dx[0][y2 - 25][x2 + 155] = id;dx[0][y2 - 25][x2 + 156] = id;dx[0][y2 - 25][x2 + 157] = id;dx[0][y2 - 25][x2 + 166] = id;dx[0][y2 - 25][x2 + 179] = id;dx[0][y2 - 25][x2 + 190] = id;dx[0][y2 - 25][x2 + 205] = id;dx[0][y2 - 25][x2 + 210] = id;dx[0][y2 - 25][x2 + 212] = id;
	dx[0][y2 - 24][x2 + 0] = id;dx[0][y2 - 24][x2 + 1] = id;dx[0][y2 - 24][x2 + 2] = id;dx[0][y2 - 24][x2 + 3] = id;dx[0][y2 - 24][x2 + 4] = id;dx[0][y2 - 24][x2 + 5] = id;dx[0][y2 - 24][x2 + 6] = id;dx[0][y2 - 24][x2 + 7] = id;dx[0][y2 - 24][x2 + 8] = id;
	dx[0][y2 - 24][x2 + 9] = id;dx[0][y2 - 24][x2 + 10] = id;dx[0][y2 - 24][x2 + 11] = id;dx[0][y2 - 24][x2 + 12] = id;dx[0][y2 - 24][x2 + 13] = id;dx[0][y2 - 24][x2 + 14] = id;dx[0][y2 - 24][x2 + 15] = id;dx[0][y2 - 24][x2 + 16] = id;dx[0][y2 - 24][x2 + 17] = id;
	dx[0][y2 - 24][x2 + 18] = id;dx[0][y2 - 24][x2 + 19] = id;dx[0][y2 - 24][x2 + 20] = id;dx[0][y2 - 24][x2 + 21] = id;dx[0][y2 - 24][x2 + 22] = id;dx[0][y2 - 24][x2 + 23] = id;dx[0][y2 - 24][x2 + 24] = id;dx[0][y2 - 24][x2 + 25] = id;dx[0][y2 - 24][x2 + 26] = id;
	dx[0][y2 - 24][x2 + 27] = id;dx[0][y2 - 24][x2 + 28] = id;dx[0][y2 - 24][x2 + 29] = id;dx[0][y2 - 24][x2 + 30] = id;dx[0][y2 - 24][x2 + 31] = id;dx[0][y2 - 24][x2 + 32] = id;dx[0][y2 - 24][x2 + 33] = id;dx[0][y2 - 24][x2 + 34] = id;dx[0][y2 - 24][x2 + 35] = id;
	dx[0][y2 - 24][x2 + 36] = id;dx[0][y2 - 24][x2 + 37] = id;dx[0][y2 - 24][x2 + 38] = id;dx[0][y2 - 24][x2 + 39] = id;dx[0][y2 - 24][x2 + 40] = id;dx[0][y2 - 24][x2 + 41] = id;dx[0][y2 - 24][x2 + 42] = id;dx[0][y2 - 24][x2 + 43] = id;dx[0][y2 - 24][x2 + 44] = id;
	dx[0][y2 - 24][x2 + 45] = id;dx[0][y2 - 24][x2 + 46] = id;dx[0][y2 - 24][x2 + 47] = id;dx[0][y2 - 24][x2 + 48] = id;dx[0][y2 - 24][x2 + 49] = id;dx[0][y2 - 24][x2 + 50] = id;dx[0][y2 - 24][x2 + 51] = id;dx[0][y2 - 24][x2 + 52] = id;dx[0][y2 - 24][x2 + 53] = id;
	dx[0][y2 - 24][x2 + 54] = id;dx[0][y2 - 24][x2 + 55] = id;dx[0][y2 - 24][x2 + 56] = id;dx[0][y2 - 24][x2 + 57] = id;dx[0][y2 - 24][x2 + 58] = id;dx[0][y2 - 24][x2 + 59] = id;dx[0][y2 - 24][x2 + 60] = id;dx[0][y2 - 24][x2 + 61] = id;dx[0][y2 - 24][x2 + 62] = id;
	dx[0][y2 - 24][x2 + 63] = id;dx[0][y2 - 24][x2 + 64] = id;dx[0][y2 - 24][x2 + 65] = id;dx[0][y2 - 24][x2 + 66] = id;dx[0][y2 - 24][x2 + 67] = id;dx[0][y2 - 24][x2 + 68] = id;dx[0][y2 - 24][x2 + 69] = id;dx[0][y2 - 24][x2 + 70] = id;dx[0][y2 - 24][x2 + 71] = id;
	dx[0][y2 - 24][x2 + 72] = id;dx[0][y2 - 24][x2 + 73] = id;dx[0][y2 - 24][x2 + 74] = id;dx[0][y2 - 24][x2 + 75] = id;dx[0][y2 - 24][x2 + 76] = id;dx[0][y2 - 24][x2 + 77] = id;dx[0][y2 - 24][x2 + 78] = id;dx[0][y2 - 24][x2 + 79] = id;dx[0][y2 - 24][x2 + 80] = id;
	dx[0][y2 - 24][x2 + 81] = id;dx[0][y2 - 24][x2 + 82] = id;dx[0][y2 - 24][x2 + 83] = id;dx[0][y2 - 24][x2 + 84] = id;dx[0][y2 - 24][x2 + 85] = id;dx[0][y2 - 24][x2 + 88] = id;dx[0][y2 - 24][x2 + 89] = id;dx[0][y2 - 24][x2 + 90] = id;dx[0][y2 - 24][x2 + 91] = id;
	dx[0][y2 - 24][x2 + 92] = id;dx[0][y2 - 24][x2 + 93] = id;dx[0][y2 - 24][x2 + 94] = id;dx[0][y2 - 24][x2 + 95] = id;dx[0][y2 - 24][x2 + 96] = id;dx[0][y2 - 24][x2 + 97] = id;dx[0][y2 - 24][x2 + 98] = id;dx[0][y2 - 24][x2 + 99] = id;dx[0][y2 - 24][x2 + 100] = id;
	dx[0][y2 - 24][x2 + 101] = id;dx[0][y2 - 24][x2 + 102] = id;dx[0][y2 - 24][x2 + 103] = id;dx[0][y2 - 24][x2 + 104] = id;dx[0][y2 - 24][x2 + 105] = id;dx[0][y2 - 24][x2 + 106] = id;dx[0][y2 - 24][x2 + 107] = id;dx[0][y2 - 24][x2 + 108] = id;dx[0][y2 - 24][x2 + 109] = id;
	dx[0][y2 - 24][x2 + 110] = id;dx[0][y2 - 24][x2 + 111] = id;dx[0][y2 - 24][x2 + 112] = id;dx[0][y2 - 24][x2 + 113] = id;dx[0][y2 - 24][x2 + 114] = id;dx[0][y2 - 24][x2 + 115] = id;dx[0][y2 - 24][x2 + 116] = id;dx[0][y2 - 24][x2 + 117] = id;dx[0][y2 - 24][x2 + 118] = id;
	dx[0][y2 - 24][x2 + 119] = id;dx[0][y2 - 24][x2 + 120] = id;dx[0][y2 - 24][x2 + 121] = id;dx[0][y2 - 24][x2 + 122] = id;dx[0][y2 - 24][x2 + 123] = id;dx[0][y2 - 24][x2 + 124] = id;dx[0][y2 - 24][x2 + 125] = id;dx[0][y2 - 24][x2 + 126] = id;dx[0][y2 - 24][x2 + 127] = id;
	dx[0][y2 - 24][x2 + 128] = id;dx[0][y2 - 24][x2 + 129] = id;dx[0][y2 - 24][x2 + 130] = id;dx[0][y2 - 24][x2 + 131] = id;dx[0][y2 - 24][x2 + 132] = id;dx[0][y2 - 24][x2 + 133] = id;dx[0][y2 - 24][x2 + 134] = id;dx[0][y2 - 24][x2 + 135] = id;dx[0][y2 - 24][x2 + 136] = id;
	dx[0][y2 - 24][x2 + 137] = id;dx[0][y2 - 24][x2 + 138] = id;dx[0][y2 - 24][x2 + 139] = id;dx[0][y2 - 24][x2 + 140] = id;dx[0][y2 - 24][x2 + 141] = id;dx[0][y2 - 24][x2 + 142] = id;dx[0][y2 - 24][x2 + 143] = id;dx[0][y2 - 24][x2 + 144] = id;dx[0][y2 - 24][x2 + 145] = id;
	dx[0][y2 - 24][x2 + 146] = id;dx[0][y2 - 24][x2 + 147] = id;dx[0][y2 - 24][x2 + 148] = id;dx[0][y2 - 24][x2 + 149] = id;dx[0][y2 - 24][x2 + 150] = id;dx[0][y2 - 24][x2 + 151] = id;dx[0][y2 - 24][x2 + 152] = id;dx[0][y2 - 24][x2 + 153] = id;dx[0][y2 - 24][x2 + 154] = id;
	dx[0][y2 - 24][x2 + 155] = id;dx[0][y2 - 24][x2 + 156] = id;dx[0][y2 - 24][x2 + 157] = id;dx[0][y2 - 24][x2 + 166] = id;dx[0][y2 - 24][x2 + 179] = id;dx[0][y2 - 24][x2 + 190] = id;dx[0][y2 - 24][x2 + 205] = id;dx[0][y2 - 24][x2 + 210] = id;dx[0][y2 - 24][x2 + 212] = id;
	dx[0][y2 - 23][x2 + 0] = id;dx[0][y2 - 23][x2 + 1] = id;dx[0][y2 - 23][x2 + 2] = id;dx[0][y2 - 23][x2 + 53] = id;dx[0][y2 - 23][x2 + 56] = id;dx[0][y2 - 23][x2 + 79] = id;dx[0][y2 - 23][x2 + 85] = id;dx[0][y2 - 23][x2 + 86] = id;dx[0][y2 - 23][x2 + 87] = id;
	dx[0][y2 - 23][x2 + 88] = id;dx[0][y2 - 23][x2 + 94] = id;dx[0][y2 - 23][x2 + 100] = id;dx[0][y2 - 23][x2 + 101] = id;dx[0][y2 - 23][x2 + 102] = id;dx[0][y2 - 23][x2 + 103] = id;dx[0][y2 - 23][x2 + 104] = id;dx[0][y2 - 23][x2 + 105] = id;dx[0][y2 - 23][x2 + 106] = id;
	dx[0][y2 - 23][x2 + 107] = id;dx[0][y2 - 23][x2 + 108] = id;dx[0][y2 - 23][x2 + 109] = id;dx[0][y2 - 23][x2 + 110] = id;dx[0][y2 - 23][x2 + 111] = id;dx[0][y2 - 23][x2 + 112] = id;dx[0][y2 - 23][x2 + 113] = id;dx[0][y2 - 23][x2 + 114] = id;dx[0][y2 - 23][x2 + 115] = id;
	dx[0][y2 - 23][x2 + 116] = id;dx[0][y2 - 23][x2 + 117] = id;dx[0][y2 - 23][x2 + 118] = id;dx[0][y2 - 23][x2 + 119] = id;dx[0][y2 - 23][x2 + 120] = id;dx[0][y2 - 23][x2 + 121] = id;dx[0][y2 - 23][x2 + 122] = id;dx[0][y2 - 23][x2 + 123] = id;dx[0][y2 - 23][x2 + 124] = id;
	dx[0][y2 - 23][x2 + 125] = id;dx[0][y2 - 23][x2 + 126] = id;dx[0][y2 - 23][x2 + 127] = id;dx[0][y2 - 23][x2 + 128] = id;dx[0][y2 - 23][x2 + 129] = id;dx[0][y2 - 23][x2 + 130] = id;dx[0][y2 - 23][x2 + 131] = id;dx[0][y2 - 23][x2 + 132] = id;dx[0][y2 - 23][x2 + 133] = id;
	dx[0][y2 - 23][x2 + 134] = id;dx[0][y2 - 23][x2 + 135] = id;dx[0][y2 - 23][x2 + 136] = id;dx[0][y2 - 23][x2 + 137] = id;dx[0][y2 - 23][x2 + 138] = id;dx[0][y2 - 23][x2 + 139] = id;dx[0][y2 - 23][x2 + 140] = id;dx[0][y2 - 23][x2 + 141] = id;dx[0][y2 - 23][x2 + 142] = id;
	dx[0][y2 - 23][x2 + 143] = id;dx[0][y2 - 23][x2 + 144] = id;dx[0][y2 - 23][x2 + 145] = id;dx[0][y2 - 23][x2 + 146] = id;dx[0][y2 - 23][x2 + 147] = id;dx[0][y2 - 23][x2 + 148] = id;dx[0][y2 - 23][x2 + 149] = id;dx[0][y2 - 23][x2 + 150] = id;dx[0][y2 - 23][x2 + 151] = id;
	dx[0][y2 - 23][x2 + 152] = id;dx[0][y2 - 23][x2 + 153] = id;dx[0][y2 - 23][x2 + 154] = id;dx[0][y2 - 23][x2 + 166] = id;dx[0][y2 - 23][x2 + 179] = id;dx[0][y2 - 23][x2 + 190] = id;dx[0][y2 - 23][x2 + 205] = id;dx[0][y2 - 23][x2 + 210] = id;dx[0][y2 - 23][x2 + 212] = id;
	dx[0][y2 - 22][x2 + 0] = id;dx[0][y2 - 22][x2 + 1] = id;dx[0][y2 - 22][x2 + 2] = id;dx[0][y2 - 22][x2 + 14] = id;dx[0][y2 - 22][x2 + 15] = id;dx[0][y2 - 22][x2 + 16] = id;dx[0][y2 - 22][x2 + 17] = id;dx[0][y2 - 22][x2 + 18] = id;dx[0][y2 - 22][x2 + 19] = id;
	dx[0][y2 - 22][x2 + 20] = id;dx[0][y2 - 22][x2 + 21] = id;dx[0][y2 - 22][x2 + 22] = id;dx[0][y2 - 22][x2 + 23] = id;dx[0][y2 - 22][x2 + 24] = id;dx[0][y2 - 22][x2 + 25] = id;dx[0][y2 - 22][x2 + 26] = id;dx[0][y2 - 22][x2 + 27] = id;dx[0][y2 - 22][x2 + 28] = id;
	dx[0][y2 - 22][x2 + 29] = id;dx[0][y2 - 22][x2 + 30] = id;dx[0][y2 - 22][x2 + 31] = id;dx[0][y2 - 22][x2 + 38] = id;dx[0][y2 - 22][x2 + 39] = id;dx[0][y2 - 22][x2 + 40] = id;dx[0][y2 - 22][x2 + 41] = id;dx[0][y2 - 22][x2 + 42] = id;dx[0][y2 - 22][x2 + 43] = id;
	dx[0][y2 - 22][x2 + 44] = id;dx[0][y2 - 22][x2 + 47] = id;dx[0][y2 - 22][x2 + 48] = id;dx[0][y2 - 22][x2 + 49] = id;dx[0][y2 - 22][x2 + 50] = id;dx[0][y2 - 22][x2 + 51] = id;dx[0][y2 - 22][x2 + 52] = id;dx[0][y2 - 22][x2 + 53] = id;dx[0][y2 - 22][x2 + 56] = id;
	dx[0][y2 - 22][x2 + 79] = id;dx[0][y2 - 22][x2 + 82] = id;dx[0][y2 - 22][x2 + 83] = id;dx[0][y2 - 22][x2 + 84] = id;dx[0][y2 - 22][x2 + 85] = id;dx[0][y2 - 22][x2 + 86] = id;dx[0][y2 - 22][x2 + 87] = id;dx[0][y2 - 22][x2 + 88] = id;dx[0][y2 - 22][x2 + 89] = id;
	dx[0][y2 - 22][x2 + 90] = id;dx[0][y2 - 22][x2 + 91] = id;dx[0][y2 - 22][x2 + 94] = id;dx[0][y2 - 22][x2 + 100] = id;dx[0][y2 - 22][x2 + 101] = id;dx[0][y2 - 22][x2 + 102] = id;dx[0][y2 - 22][x2 + 103] = id;dx[0][y2 - 22][x2 + 104] = id;dx[0][y2 - 22][x2 + 105] = id;
	dx[0][y2 - 22][x2 + 106] = id;dx[0][y2 - 22][x2 + 107] = id;dx[0][y2 - 22][x2 + 108] = id;dx[0][y2 - 22][x2 + 109] = id;dx[0][y2 - 22][x2 + 110] = id;dx[0][y2 - 22][x2 + 111] = id;dx[0][y2 - 22][x2 + 112] = id;dx[0][y2 - 22][x2 + 113] = id;dx[0][y2 - 22][x2 + 114] = id;
	dx[0][y2 - 22][x2 + 115] = id;dx[0][y2 - 22][x2 + 116] = id;dx[0][y2 - 22][x2 + 117] = id;dx[0][y2 - 22][x2 + 118] = id;dx[0][y2 - 22][x2 + 119] = id;dx[0][y2 - 22][x2 + 120] = id;dx[0][y2 - 22][x2 + 121] = id;dx[0][y2 - 22][x2 + 122] = id;dx[0][y2 - 22][x2 + 123] = id;
	dx[0][y2 - 22][x2 + 124] = id;dx[0][y2 - 22][x2 + 125] = id;dx[0][y2 - 22][x2 + 126] = id;dx[0][y2 - 22][x2 + 127] = id;dx[0][y2 - 22][x2 + 128] = id;dx[0][y2 - 22][x2 + 129] = id;dx[0][y2 - 22][x2 + 130] = id;dx[0][y2 - 22][x2 + 131] = id;dx[0][y2 - 22][x2 + 132] = id;
	dx[0][y2 - 22][x2 + 133] = id;dx[0][y2 - 22][x2 + 134] = id;dx[0][y2 - 22][x2 + 135] = id;dx[0][y2 - 22][x2 + 136] = id;dx[0][y2 - 22][x2 + 137] = id;dx[0][y2 - 22][x2 + 138] = id;dx[0][y2 - 22][x2 + 139] = id;dx[0][y2 - 22][x2 + 140] = id;dx[0][y2 - 22][x2 + 141] = id;
	dx[0][y2 - 22][x2 + 142] = id;dx[0][y2 - 22][x2 + 143] = id;dx[0][y2 - 22][x2 + 144] = id;dx[0][y2 - 22][x2 + 145] = id;dx[0][y2 - 22][x2 + 146] = id;dx[0][y2 - 22][x2 + 147] = id;dx[0][y2 - 22][x2 + 148] = id;dx[0][y2 - 22][x2 + 149] = id;dx[0][y2 - 22][x2 + 150] = id;
	dx[0][y2 - 22][x2 + 151] = id;dx[0][y2 - 22][x2 + 152] = id;dx[0][y2 - 22][x2 + 153] = id;dx[0][y2 - 22][x2 + 154] = id;dx[0][y2 - 22][x2 + 155] = id;dx[0][y2 - 22][x2 + 156] = id;dx[0][y2 - 22][x2 + 157] = id;dx[0][y2 - 22][x2 + 158] = id;dx[0][y2 - 22][x2 + 159] = id;
	dx[0][y2 - 22][x2 + 160] = id;dx[0][y2 - 22][x2 + 161] = id;dx[0][y2 - 22][x2 + 162] = id;dx[0][y2 - 22][x2 + 163] = id;dx[0][y2 - 22][x2 + 164] = id;dx[0][y2 - 22][x2 + 165] = id;dx[0][y2 - 22][x2 + 166] = id;dx[0][y2 - 22][x2 + 167] = id;dx[0][y2 - 22][x2 + 168] = id;
	dx[0][y2 - 22][x2 + 169] = id;dx[0][y2 - 22][x2 + 170] = id;dx[0][y2 - 22][x2 + 171] = id;dx[0][y2 - 22][x2 + 172] = id;dx[0][y2 - 22][x2 + 173] = id;dx[0][y2 - 22][x2 + 174] = id;dx[0][y2 - 22][x2 + 175] = id;dx[0][y2 - 22][x2 + 176] = id;dx[0][y2 - 22][x2 + 177] = id;
	dx[0][y2 - 22][x2 + 178] = id;dx[0][y2 - 22][x2 + 179] = id;dx[0][y2 - 22][x2 + 180] = id;dx[0][y2 - 22][x2 + 181] = id;dx[0][y2 - 22][x2 + 182] = id;dx[0][y2 - 22][x2 + 183] = id;dx[0][y2 - 22][x2 + 184] = id;dx[0][y2 - 22][x2 + 185] = id;dx[0][y2 - 22][x2 + 186] = id;
	dx[0][y2 - 22][x2 + 187] = id;dx[0][y2 - 22][x2 + 188] = id;dx[0][y2 - 22][x2 + 189] = id;dx[0][y2 - 22][x2 + 190] = id;dx[0][y2 - 22][x2 + 191] = id;dx[0][y2 - 22][x2 + 192] = id;dx[0][y2 - 22][x2 + 193] = id;dx[0][y2 - 22][x2 + 194] = id;dx[0][y2 - 22][x2 + 195] = id;
	dx[0][y2 - 22][x2 + 196] = id;dx[0][y2 - 22][x2 + 197] = id;dx[0][y2 - 22][x2 + 198] = id;dx[0][y2 - 22][x2 + 199] = id;dx[0][y2 - 22][x2 + 200] = id;dx[0][y2 - 22][x2 + 201] = id;dx[0][y2 - 22][x2 + 202] = id;dx[0][y2 - 22][x2 + 203] = id;dx[0][y2 - 22][x2 + 204] = id;
	dx[0][y2 - 22][x2 + 205] = id;dx[0][y2 - 22][x2 + 206] = id;dx[0][y2 - 22][x2 + 207] = id;dx[0][y2 - 22][x2 + 208] = id;dx[0][y2 - 22][x2 + 209] = id;dx[0][y2 - 22][x2 + 210] = id;dx[0][y2 - 22][x2 + 211] = id;dx[0][y2 - 22][x2 + 212] = id;dx[0][y2 - 21][x2 + 0] = id;
	dx[0][y2 - 21][x2 + 1] = id;dx[0][y2 - 21][x2 + 2] = id;dx[0][y2 - 21][x2 + 14] = id;dx[0][y2 - 21][x2 + 15] = id;dx[0][y2 - 21][x2 + 16] = id;dx[0][y2 - 21][x2 + 17] = id;dx[0][y2 - 21][x2 + 28] = id;dx[0][y2 - 21][x2 + 29] = id;dx[0][y2 - 21][x2 + 30] = id;
	dx[0][y2 - 21][x2 + 31] = id;dx[0][y2 - 21][x2 + 37] = id;dx[0][y2 - 21][x2 + 38] = id;dx[0][y2 - 21][x2 + 41] = id;dx[0][y2 - 21][x2 + 44] = id;dx[0][y2 - 21][x2 + 45] = id;dx[0][y2 - 21][x2 + 48] = id;dx[0][y2 - 21][x2 + 49] = id;dx[0][y2 - 21][x2 + 50] = id;
	dx[0][y2 - 21][x2 + 51] = id;dx[0][y2 - 21][x2 + 52] = id;dx[0][y2 - 21][x2 + 53] = id;dx[0][y2 - 21][x2 + 56] = id;dx[0][y2 - 21][x2 + 79] = id;dx[0][y2 - 21][x2 + 82] = id;dx[0][y2 - 21][x2 + 86] = id;dx[0][y2 - 21][x2 + 87] = id;dx[0][y2 - 21][x2 + 91] = id;
	dx[0][y2 - 21][x2 + 94] = id;dx[0][y2 - 21][x2 + 100] = id;dx[0][y2 - 21][x2 + 106] = id;dx[0][y2 - 21][x2 + 107] = id;dx[0][y2 - 21][x2 + 108] = id;dx[0][y2 - 21][x2 + 109] = id;dx[0][y2 - 21][x2 + 110] = id;dx[0][y2 - 21][x2 + 141] = id;dx[0][y2 - 21][x2 + 142] = id;
	dx[0][y2 - 21][x2 + 143] = id;dx[0][y2 - 21][x2 + 144] = id;dx[0][y2 - 21][x2 + 146] = id;dx[0][y2 - 21][x2 + 147] = id;dx[0][y2 - 21][x2 + 154] = id;dx[0][y2 - 21][x2 + 209] = id;dx[0][y2 - 21][x2 + 210] = id;dx[0][y2 - 21][x2 + 211] = id;dx[0][y2 - 21][x2 + 212] = id;
	dx[0][y2 - 20][x2 + 0] = id;dx[0][y2 - 20][x2 + 14] = id;dx[0][y2 - 20][x2 + 15] = id;dx[0][y2 - 20][x2 + 16] = id;dx[0][y2 - 20][x2 + 29] = id;dx[0][y2 - 20][x2 + 30] = id;dx[0][y2 - 20][x2 + 31] = id;dx[0][y2 - 20][x2 + 36] = id;dx[0][y2 - 20][x2 + 37] = id;
	dx[0][y2 - 20][x2 + 41] = id;dx[0][y2 - 20][x2 + 45] = id;dx[0][y2 - 20][x2 + 46] = id;dx[0][y2 - 20][x2 + 53] = id;dx[0][y2 - 20][x2 + 56] = id;dx[0][y2 - 20][x2 + 79] = id;dx[0][y2 - 20][x2 + 82] = id;dx[0][y2 - 20][x2 + 83] = id;dx[0][y2 - 20][x2 + 84] = id;
	dx[0][y2 - 20][x2 + 85] = id;dx[0][y2 - 20][x2 + 86] = id;dx[0][y2 - 20][x2 + 87] = id;dx[0][y2 - 20][x2 + 88] = id;dx[0][y2 - 20][x2 + 89] = id;dx[0][y2 - 20][x2 + 90] = id;dx[0][y2 - 20][x2 + 91] = id;dx[0][y2 - 20][x2 + 94] = id;dx[0][y2 - 20][x2 + 100] = id;
	dx[0][y2 - 20][x2 + 103] = id;dx[0][y2 - 20][x2 + 104] = id;dx[0][y2 - 20][x2 + 105] = id;dx[0][y2 - 20][x2 + 111] = id;dx[0][y2 - 20][x2 + 140] = id;dx[0][y2 - 20][x2 + 148] = id;dx[0][y2 - 20][x2 + 154] = id;dx[0][y2 - 20][x2 + 155] = id;dx[0][y2 - 20][x2 + 156] = id;
	dx[0][y2 - 20][x2 + 210] = id;dx[0][y2 - 20][x2 + 211] = id;dx[0][y2 - 20][x2 + 212] = id;dx[0][y2 - 19][x2 + 0] = id;dx[0][y2 - 19][x2 + 1] = id;dx[0][y2 - 19][x2 + 2] = id;dx[0][y2 - 19][x2 + 3] = id;dx[0][y2 - 19][x2 + 4] = id;dx[0][y2 - 19][x2 + 14] = id;
	dx[0][y2 - 19][x2 + 15] = id;dx[0][y2 - 19][x2 + 30] = id;dx[0][y2 - 19][x2 + 31] = id;dx[0][y2 - 19][x2 + 35] = id;dx[0][y2 - 19][x2 + 41] = id;dx[0][y2 - 19][x2 + 46] = id;dx[0][y2 - 19][x2 + 47] = id;dx[0][y2 - 19][x2 + 53] = id;dx[0][y2 - 19][x2 + 56] = id;
	dx[0][y2 - 19][x2 + 60] = id;dx[0][y2 - 19][x2 + 61] = id;dx[0][y2 - 19][x2 + 62] = id;dx[0][y2 - 19][x2 + 63] = id;dx[0][y2 - 19][x2 + 64] = id;dx[0][y2 - 19][x2 + 69] = id;dx[0][y2 - 19][x2 + 70] = id;dx[0][y2 - 19][x2 + 71] = id;dx[0][y2 - 19][x2 + 72] = id;
	dx[0][y2 - 19][x2 + 73] = id;dx[0][y2 - 19][x2 + 79] = id;dx[0][y2 - 19][x2 + 82] = id;dx[0][y2 - 19][x2 + 86] = id;dx[0][y2 - 19][x2 + 87] = id;dx[0][y2 - 19][x2 + 91] = id;dx[0][y2 - 19][x2 + 94] = id;dx[0][y2 - 19][x2 + 100] = id;dx[0][y2 - 19][x2 + 102] = id;
	dx[0][y2 - 19][x2 + 111] = id;dx[0][y2 - 19][x2 + 122] = id;dx[0][y2 - 19][x2 + 123] = id;dx[0][y2 - 19][x2 + 124] = id;dx[0][y2 - 19][x2 + 125] = id;dx[0][y2 - 19][x2 + 127] = id;dx[0][y2 - 19][x2 + 128] = id;dx[0][y2 - 19][x2 + 129] = id;dx[0][y2 - 19][x2 + 130] = id;
	dx[0][y2 - 19][x2 + 140] = id;dx[0][y2 - 19][x2 + 154] = id;dx[0][y2 - 19][x2 + 212] = id;dx[0][y2 - 18][x2 + 0] = id;dx[0][y2 - 18][x2 + 1] = id;dx[0][y2 - 18][x2 + 2] = id;dx[0][y2 - 18][x2 + 3] = id;dx[0][y2 - 18][x2 + 4] = id;dx[0][y2 - 18][x2 + 5] = id;
	dx[0][y2 - 18][x2 + 6] = id;dx[0][y2 - 18][x2 + 14] = id;dx[0][y2 - 18][x2 + 15] = id;dx[0][y2 - 18][x2 + 30] = id;dx[0][y2 - 18][x2 + 31] = id;dx[0][y2 - 18][x2 + 35] = id;dx[0][y2 - 18][x2 + 37] = id;dx[0][y2 - 18][x2 + 38] = id;dx[0][y2 - 18][x2 + 39] = id;
	dx[0][y2 - 18][x2 + 40] = id;dx[0][y2 - 18][x2 + 41] = id;dx[0][y2 - 18][x2 + 42] = id;dx[0][y2 - 18][x2 + 43] = id;dx[0][y2 - 18][x2 + 44] = id;dx[0][y2 - 18][x2 + 45] = id;dx[0][y2 - 18][x2 + 46] = id;dx[0][y2 - 18][x2 + 47] = id;dx[0][y2 - 18][x2 + 50] = id;
	dx[0][y2 - 18][x2 + 51] = id;dx[0][y2 - 18][x2 + 53] = id;dx[0][y2 - 18][x2 + 56] = id;dx[0][y2 - 18][x2 + 61] = id;dx[0][y2 - 18][x2 + 62] = id;dx[0][y2 - 18][x2 + 63] = id;dx[0][y2 - 18][x2 + 64] = id;dx[0][y2 - 18][x2 + 65] = id;dx[0][y2 - 18][x2 + 66] = id;
	dx[0][y2 - 18][x2 + 67] = id;dx[0][y2 - 18][x2 + 68] = id;dx[0][y2 - 18][x2 + 69] = id;dx[0][y2 - 18][x2 + 70] = id;dx[0][y2 - 18][x2 + 71] = id;dx[0][y2 - 18][x2 + 79] = id;dx[0][y2 - 18][x2 + 82] = id;dx[0][y2 - 18][x2 + 86] = id;dx[0][y2 - 18][x2 + 87] = id;
	dx[0][y2 - 18][x2 + 91] = id;dx[0][y2 - 18][x2 + 94] = id;dx[0][y2 - 18][x2 + 100] = id;dx[0][y2 - 18][x2 + 102] = id;dx[0][y2 - 18][x2 + 111] = id;dx[0][y2 - 18][x2 + 118] = id;dx[0][y2 - 18][x2 + 119] = id;dx[0][y2 - 18][x2 + 120] = id;dx[0][y2 - 18][x2 + 121] = id;
	dx[0][y2 - 18][x2 + 131] = id;dx[0][y2 - 18][x2 + 132] = id;dx[0][y2 - 18][x2 + 133] = id;dx[0][y2 - 18][x2 + 134] = id;dx[0][y2 - 18][x2 + 140] = id;dx[0][y2 - 18][x2 + 148] = id;dx[0][y2 - 18][x2 + 154] = id;dx[0][y2 - 18][x2 + 155] = id;dx[0][y2 - 18][x2 + 156] = id;
	dx[0][y2 - 18][x2 + 208] = id;dx[0][y2 - 18][x2 + 209] = id;dx[0][y2 - 18][x2 + 210] = id;dx[0][y2 - 18][x2 + 211] = id;dx[0][y2 - 18][x2 + 212] = id;dx[0][y2 - 17][x2 + 0] = id;dx[0][y2 - 17][x2 + 1] = id;dx[0][y2 - 17][x2 + 2] = id;dx[0][y2 - 17][x2 + 3] = id;
	dx[0][y2 - 17][x2 + 4] = id;dx[0][y2 - 17][x2 + 5] = id;dx[0][y2 - 17][x2 + 6] = id;dx[0][y2 - 17][x2 + 14] = id;dx[0][y2 - 17][x2 + 15] = id;dx[0][y2 - 17][x2 + 30] = id;dx[0][y2 - 17][x2 + 31] = id;dx[0][y2 - 17][x2 + 35] = id;dx[0][y2 - 17][x2 + 41] = id;
	dx[0][y2 - 17][x2 + 47] = id;dx[0][y2 - 17][x2 + 50] = id;dx[0][y2 - 17][x2 + 51] = id;dx[0][y2 - 17][x2 + 52] = id;dx[0][y2 - 17][x2 + 53] = id;dx[0][y2 - 17][x2 + 56] = id;dx[0][y2 - 17][x2 + 62] = id;dx[0][y2 - 17][x2 + 63] = id;dx[0][y2 - 17][x2 + 69] = id;
	dx[0][y2 - 17][x2 + 70] = id;dx[0][y2 - 17][x2 + 79] = id;dx[0][y2 - 17][x2 + 82] = id;dx[0][y2 - 17][x2 + 83] = id;dx[0][y2 - 17][x2 + 84] = id;dx[0][y2 - 17][x2 + 85] = id;dx[0][y2 - 17][x2 + 86] = id;dx[0][y2 - 17][x2 + 87] = id;dx[0][y2 - 17][x2 + 88] = id;
	dx[0][y2 - 17][x2 + 89] = id;dx[0][y2 - 17][x2 + 90] = id;dx[0][y2 - 17][x2 + 91] = id;dx[0][y2 - 17][x2 + 94] = id;dx[0][y2 - 17][x2 + 100] = id;dx[0][y2 - 17][x2 + 102] = id;dx[0][y2 - 17][x2 + 103] = id;dx[0][y2 - 17][x2 + 104] = id;dx[0][y2 - 17][x2 + 105] = id;
	dx[0][y2 - 17][x2 + 106] = id;dx[0][y2 - 17][x2 + 107] = id;dx[0][y2 - 17][x2 + 108] = id;dx[0][y2 - 17][x2 + 109] = id;dx[0][y2 - 17][x2 + 110] = id;dx[0][y2 - 17][x2 + 111] = id;dx[0][y2 - 17][x2 + 114] = id;dx[0][y2 - 17][x2 + 115] = id;dx[0][y2 - 17][x2 + 116] = id;
	dx[0][y2 - 17][x2 + 117] = id;dx[0][y2 - 17][x2 + 135] = id;dx[0][y2 - 17][x2 + 136] = id;dx[0][y2 - 17][x2 + 137] = id;dx[0][y2 - 17][x2 + 138] = id;dx[0][y2 - 17][x2 + 139] = id;dx[0][y2 - 17][x2 + 141] = id;dx[0][y2 - 17][x2 + 142] = id;dx[0][y2 - 17][x2 + 143] = id;
	dx[0][y2 - 17][x2 + 144] = id;dx[0][y2 - 17][x2 + 145] = id;dx[0][y2 - 17][x2 + 146] = id;dx[0][y2 - 17][x2 + 147] = id;dx[0][y2 - 17][x2 + 148] = id;dx[0][y2 - 17][x2 + 154] = id;dx[0][y2 - 17][x2 + 155] = id;dx[0][y2 - 17][x2 + 156] = id;dx[0][y2 - 17][x2 + 157] = id;
	dx[0][y2 - 17][x2 + 208] = id;dx[0][y2 - 17][x2 + 209] = id;dx[0][y2 - 17][x2 + 210] = id;dx[0][y2 - 17][x2 + 211] = id;dx[0][y2 - 17][x2 + 212] = id;dx[0][y2 - 16][x2 + 0] = id;dx[0][y2 - 16][x2 + 14] = id;dx[0][y2 - 16][x2 + 15] = id;dx[0][y2 - 16][x2 + 30] = id;
	dx[0][y2 - 16][x2 + 31] = id;dx[0][y2 - 16][x2 + 35] = id;dx[0][y2 - 16][x2 + 41] = id;dx[0][y2 - 16][x2 + 47] = id;dx[0][y2 - 16][x2 + 53] = id;dx[0][y2 - 16][x2 + 56] = id;dx[0][y2 - 16][x2 + 62] = id;dx[0][y2 - 16][x2 + 63] = id;dx[0][y2 - 16][x2 + 64] = id;
	dx[0][y2 - 16][x2 + 65] = id;dx[0][y2 - 16][x2 + 66] = id;dx[0][y2 - 16][x2 + 67] = id;dx[0][y2 - 16][x2 + 68] = id;dx[0][y2 - 16][x2 + 69] = id;dx[0][y2 - 16][x2 + 70] = id;dx[0][y2 - 16][x2 + 79] = id;dx[0][y2 - 16][x2 + 82] = id;dx[0][y2 - 16][x2 + 86] = id;
	dx[0][y2 - 16][x2 + 87] = id;dx[0][y2 - 16][x2 + 91] = id;dx[0][y2 - 16][x2 + 94] = id;dx[0][y2 - 16][x2 + 100] = id;dx[0][y2 - 16][x2 + 111] = id;dx[0][y2 - 16][x2 + 112] = id;dx[0][y2 - 16][x2 + 113] = id;dx[0][y2 - 16][x2 + 140] = id;dx[0][y2 - 16][x2 + 141] = id;
	dx[0][y2 - 16][x2 + 142] = id;dx[0][y2 - 16][x2 + 143] = id;dx[0][y2 - 16][x2 + 154] = id;dx[0][y2 - 16][x2 + 212] = id;dx[0][y2 - 15][x2 + 0] = id;dx[0][y2 - 15][x2 + 1] = id;dx[0][y2 - 15][x2 + 2] = id;dx[0][y2 - 15][x2 + 3] = id;dx[0][y2 - 15][x2 + 4] = id;
	dx[0][y2 - 15][x2 + 5] = id;dx[0][y2 - 15][x2 + 6] = id;dx[0][y2 - 15][x2 + 7] = id;dx[0][y2 - 15][x2 + 8] = id;dx[0][y2 - 15][x2 + 14] = id;dx[0][y2 - 15][x2 + 15] = id;dx[0][y2 - 15][x2 + 16] = id;dx[0][y2 - 15][x2 + 17] = id;dx[0][y2 - 15][x2 + 18] = id;
	dx[0][y2 - 15][x2 + 19] = id;dx[0][y2 - 15][x2 + 21] = id;dx[0][y2 - 15][x2 + 22] = id;dx[0][y2 - 15][x2 + 23] = id;dx[0][y2 - 15][x2 + 24] = id;dx[0][y2 - 15][x2 + 25] = id;dx[0][y2 - 15][x2 + 26] = id;dx[0][y2 - 15][x2 + 27] = id;dx[0][y2 - 15][x2 + 28] = id;
	dx[0][y2 - 15][x2 + 29] = id;dx[0][y2 - 15][x2 + 30] = id;dx[0][y2 - 15][x2 + 31] = id;dx[0][y2 - 15][x2 + 35] = id;dx[0][y2 - 15][x2 + 37] = id;dx[0][y2 - 15][x2 + 38] = id;dx[0][y2 - 15][x2 + 39] = id;dx[0][y2 - 15][x2 + 40] = id;dx[0][y2 - 15][x2 + 41] = id;
	dx[0][y2 - 15][x2 + 42] = id;dx[0][y2 - 15][x2 + 43] = id;dx[0][y2 - 15][x2 + 44] = id;dx[0][y2 - 15][x2 + 45] = id;dx[0][y2 - 15][x2 + 46] = id;dx[0][y2 - 15][x2 + 47] = id;dx[0][y2 - 15][x2 + 48] = id;dx[0][y2 - 15][x2 + 52] = id;dx[0][y2 - 15][x2 + 53] = id;
	dx[0][y2 - 15][x2 + 54] = id;dx[0][y2 - 15][x2 + 55] = id;dx[0][y2 - 15][x2 + 56] = id;dx[0][y2 - 15][x2 + 57] = id;dx[0][y2 - 15][x2 + 62] = id;dx[0][y2 - 15][x2 + 63] = id;dx[0][y2 - 15][x2 + 69] = id;dx[0][y2 - 15][x2 + 70] = id;dx[0][y2 - 15][x2 + 79] = id;
	dx[0][y2 - 15][x2 + 82] = id;dx[0][y2 - 15][x2 + 86] = id;dx[0][y2 - 15][x2 + 87] = id;dx[0][y2 - 15][x2 + 91] = id;dx[0][y2 - 15][x2 + 94] = id;dx[0][y2 - 15][x2 + 100] = id;dx[0][y2 - 15][x2 + 110] = id;dx[0][y2 - 15][x2 + 143] = id;dx[0][y2 - 15][x2 + 144] = id;
	dx[0][y2 - 15][x2 + 154] = id;dx[0][y2 - 15][x2 + 155] = id;dx[0][y2 - 15][x2 + 156] = id;dx[0][y2 - 15][x2 + 157] = id;dx[0][y2 - 15][x2 + 163] = id;dx[0][y2 - 15][x2 + 164] = id;dx[0][y2 - 15][x2 + 165] = id;dx[0][y2 - 15][x2 + 166] = id;dx[0][y2 - 15][x2 + 167] = id;
	dx[0][y2 - 15][x2 + 168] = id;dx[0][y2 - 15][x2 + 169] = id;dx[0][y2 - 15][x2 + 170] = id;dx[0][y2 - 15][x2 + 171] = id;dx[0][y2 - 15][x2 + 172] = id;dx[0][y2 - 15][x2 + 173] = id;dx[0][y2 - 15][x2 + 174] = id;dx[0][y2 - 15][x2 + 175] = id;dx[0][y2 - 15][x2 + 207] = id;
	dx[0][y2 - 15][x2 + 208] = id;dx[0][y2 - 15][x2 + 209] = id;dx[0][y2 - 15][x2 + 210] = id;dx[0][y2 - 15][x2 + 211] = id;dx[0][y2 - 15][x2 + 212] = id;dx[0][y2 - 14][x2 + 0] = id;dx[0][y2 - 14][x2 + 1] = id;dx[0][y2 - 14][x2 + 2] = id;dx[0][y2 - 14][x2 + 3] = id;
	dx[0][y2 - 14][x2 + 4] = id;dx[0][y2 - 14][x2 + 5] = id;dx[0][y2 - 14][x2 + 6] = id;dx[0][y2 - 14][x2 + 7] = id;dx[0][y2 - 14][x2 + 8] = id;dx[0][y2 - 14][x2 + 9] = id;dx[0][y2 - 14][x2 + 15] = id;dx[0][y2 - 14][x2 + 30] = id;dx[0][y2 - 14][x2 + 31] = id;
	dx[0][y2 - 14][x2 + 35] = id;dx[0][y2 - 14][x2 + 41] = id;dx[0][y2 - 14][x2 + 47] = id;dx[0][y2 - 14][x2 + 53] = id;dx[0][y2 - 14][x2 + 56] = id;dx[0][y2 - 14][x2 + 62] = id;dx[0][y2 - 14][x2 + 63] = id;dx[0][y2 - 14][x2 + 64] = id;dx[0][y2 - 14][x2 + 65] = id;
	dx[0][y2 - 14][x2 + 66] = id;dx[0][y2 - 14][x2 + 67] = id;dx[0][y2 - 14][x2 + 68] = id;dx[0][y2 - 14][x2 + 69] = id;dx[0][y2 - 14][x2 + 70] = id;dx[0][y2 - 14][x2 + 79] = id;dx[0][y2 - 14][x2 + 82] = id;dx[0][y2 - 14][x2 + 83] = id;dx[0][y2 - 14][x2 + 84] = id;
	dx[0][y2 - 14][x2 + 85] = id;dx[0][y2 - 14][x2 + 86] = id;dx[0][y2 - 14][x2 + 87] = id;dx[0][y2 - 14][x2 + 88] = id;dx[0][y2 - 14][x2 + 89] = id;dx[0][y2 - 14][x2 + 90] = id;dx[0][y2 - 14][x2 + 91] = id;dx[0][y2 - 14][x2 + 94] = id;dx[0][y2 - 14][x2 + 100] = id;
	dx[0][y2 - 14][x2 + 108] = id;dx[0][y2 - 14][x2 + 109] = id;dx[0][y2 - 14][x2 + 144] = id;dx[0][y2 - 14][x2 + 154] = id;dx[0][y2 - 14][x2 + 155] = id;dx[0][y2 - 14][x2 + 156] = id;dx[0][y2 - 14][x2 + 157] = id;dx[0][y2 - 14][x2 + 158] = id;dx[0][y2 - 14][x2 + 165] = id;
	dx[0][y2 - 14][x2 + 167] = id;dx[0][y2 - 14][x2 + 168] = id;dx[0][y2 - 14][x2 + 169] = id;dx[0][y2 - 14][x2 + 170] = id;dx[0][y2 - 14][x2 + 171] = id;dx[0][y2 - 14][x2 + 173] = id;dx[0][y2 - 14][x2 + 207] = id;dx[0][y2 - 14][x2 + 208] = id;dx[0][y2 - 14][x2 + 209] = id;
	dx[0][y2 - 14][x2 + 210] = id;dx[0][y2 - 14][x2 + 211] = id;dx[0][y2 - 14][x2 + 212] = id;dx[0][y2 - 13][x2 + 0] = id;dx[0][y2 - 13][x2 + 1] = id;dx[0][y2 - 13][x2 + 2] = id;dx[0][y2 - 13][x2 + 3] = id;dx[0][y2 - 13][x2 + 4] = id;dx[0][y2 - 13][x2 + 5] = id;
	dx[0][y2 - 13][x2 + 6] = id;dx[0][y2 - 13][x2 + 7] = id;dx[0][y2 - 13][x2 + 8] = id;dx[0][y2 - 13][x2 + 9] = id;dx[0][y2 - 13][x2 + 15] = id;dx[0][y2 - 13][x2 + 16] = id;dx[0][y2 - 13][x2 + 17] = id;dx[0][y2 - 13][x2 + 28] = id;dx[0][y2 - 13][x2 + 29] = id;
	dx[0][y2 - 13][x2 + 30] = id;dx[0][y2 - 13][x2 + 35] = id;dx[0][y2 - 13][x2 + 41] = id;dx[0][y2 - 13][x2 + 47] = id;dx[0][y2 - 13][x2 + 52] = id;dx[0][y2 - 13][x2 + 53] = id;dx[0][y2 - 13][x2 + 54] = id;dx[0][y2 - 13][x2 + 55] = id;dx[0][y2 - 13][x2 + 56] = id;
	dx[0][y2 - 13][x2 + 57] = id;dx[0][y2 - 13][x2 + 58] = id;dx[0][y2 - 13][x2 + 62] = id;dx[0][y2 - 13][x2 + 63] = id;dx[0][y2 - 13][x2 + 64] = id;dx[0][y2 - 13][x2 + 65] = id;dx[0][y2 - 13][x2 + 66] = id;dx[0][y2 - 13][x2 + 67] = id;dx[0][y2 - 13][x2 + 68] = id;
	dx[0][y2 - 13][x2 + 69] = id;dx[0][y2 - 13][x2 + 70] = id;dx[0][y2 - 13][x2 + 79] = id;dx[0][y2 - 13][x2 + 82] = id;dx[0][y2 - 13][x2 + 86] = id;dx[0][y2 - 13][x2 + 87] = id;dx[0][y2 - 13][x2 + 91] = id;dx[0][y2 - 13][x2 + 94] = id;dx[0][y2 - 13][x2 + 100] = id;
	dx[0][y2 - 13][x2 + 108] = id;dx[0][y2 - 13][x2 + 109] = id;dx[0][y2 - 13][x2 + 144] = id;dx[0][y2 - 13][x2 + 154] = id;dx[0][y2 - 13][x2 + 165] = id;dx[0][y2 - 13][x2 + 167] = id;dx[0][y2 - 13][x2 + 168] = id;dx[0][y2 - 13][x2 + 169] = id;dx[0][y2 - 13][x2 + 170] = id;
	dx[0][y2 - 13][x2 + 171] = id;dx[0][y2 - 13][x2 + 173] = id;dx[0][y2 - 13][x2 + 212] = id;dx[0][y2 - 12][x2 + 0] = id;dx[0][y2 - 12][x2 + 17] = id;dx[0][y2 - 12][x2 + 18] = id;dx[0][y2 - 12][x2 + 19] = id;dx[0][y2 - 12][x2 + 20] = id;dx[0][y2 - 12][x2 + 21] = id;
	dx[0][y2 - 12][x2 + 22] = id;dx[0][y2 - 12][x2 + 23] = id;dx[0][y2 - 12][x2 + 24] = id;dx[0][y2 - 12][x2 + 25] = id;dx[0][y2 - 12][x2 + 26] = id;dx[0][y2 - 12][x2 + 27] = id;dx[0][y2 - 12][x2 + 28] = id;dx[0][y2 - 12][x2 + 35] = id;dx[0][y2 - 12][x2 + 41] = id;
	dx[0][y2 - 12][x2 + 47] = id;dx[0][y2 - 12][x2 + 53] = id;dx[0][y2 - 12][x2 + 54] = id;dx[0][y2 - 12][x2 + 55] = id;dx[0][y2 - 12][x2 + 56] = id;dx[0][y2 - 12][x2 + 57] = id;dx[0][y2 - 12][x2 + 58] = id;dx[0][y2 - 12][x2 + 59] = id;dx[0][y2 - 12][x2 + 79] = id;
	dx[0][y2 - 12][x2 + 82] = id;dx[0][y2 - 12][x2 + 86] = id;dx[0][y2 - 12][x2 + 87] = id;dx[0][y2 - 12][x2 + 91] = id;dx[0][y2 - 12][x2 + 94] = id;dx[0][y2 - 12][x2 + 100] = id;dx[0][y2 - 12][x2 + 108] = id;dx[0][y2 - 12][x2 + 145] = id;dx[0][y2 - 12][x2 + 154] = id;
	dx[0][y2 - 12][x2 + 155] = id;dx[0][y2 - 12][x2 + 165] = id;dx[0][y2 - 12][x2 + 173] = id;dx[0][y2 - 12][x2 + 183] = id;dx[0][y2 - 12][x2 + 184] = id;dx[0][y2 - 12][x2 + 185] = id;dx[0][y2 - 12][x2 + 186] = id;dx[0][y2 - 12][x2 + 187] = id;dx[0][y2 - 12][x2 + 188] = id;
	dx[0][y2 - 12][x2 + 189] = id;dx[0][y2 - 12][x2 + 190] = id;dx[0][y2 - 12][x2 + 191] = id;dx[0][y2 - 12][x2 + 192] = id;dx[0][y2 - 12][x2 + 193] = id;dx[0][y2 - 12][x2 + 194] = id;dx[0][y2 - 12][x2 + 195] = id;dx[0][y2 - 12][x2 + 196] = id;dx[0][y2 - 12][x2 + 197] = id;
	dx[0][y2 - 12][x2 + 198] = id;dx[0][y2 - 12][x2 + 199] = id;dx[0][y2 - 12][x2 + 200] = id;dx[0][y2 - 12][x2 + 201] = id;dx[0][y2 - 12][x2 + 202] = id;dx[0][y2 - 12][x2 + 203] = id;dx[0][y2 - 12][x2 + 204] = id;dx[0][y2 - 12][x2 + 205] = id;dx[0][y2 - 12][x2 + 206] = id;
	dx[0][y2 - 12][x2 + 207] = id;dx[0][y2 - 12][x2 + 208] = id;dx[0][y2 - 12][x2 + 209] = id;dx[0][y2 - 12][x2 + 210] = id;dx[0][y2 - 12][x2 + 211] = id;dx[0][y2 - 12][x2 + 212] = id;dx[0][y2 - 11][x2 + 0] = id;dx[0][y2 - 11][x2 + 1] = id;dx[0][y2 - 11][x2 + 2] = id;
	dx[0][y2 - 11][x2 + 3] = id;dx[0][y2 - 11][x2 + 4] = id;dx[0][y2 - 11][x2 + 5] = id;dx[0][y2 - 11][x2 + 35] = id;dx[0][y2 - 11][x2 + 41] = id;dx[0][y2 - 11][x2 + 47] = id;dx[0][y2 - 11][x2 + 50] = id;dx[0][y2 - 11][x2 + 51] = id;dx[0][y2 - 11][x2 + 52] = id;
	dx[0][y2 - 11][x2 + 53] = id;dx[0][y2 - 11][x2 + 56] = id;dx[0][y2 - 11][x2 + 79] = id;dx[0][y2 - 11][x2 + 82] = id;dx[0][y2 - 11][x2 + 83] = id;dx[0][y2 - 11][x2 + 84] = id;dx[0][y2 - 11][x2 + 85] = id;dx[0][y2 - 11][x2 + 86] = id;dx[0][y2 - 11][x2 + 87] = id;
	dx[0][y2 - 11][x2 + 88] = id;dx[0][y2 - 11][x2 + 89] = id;dx[0][y2 - 11][x2 + 90] = id;dx[0][y2 - 11][x2 + 91] = id;dx[0][y2 - 11][x2 + 94] = id;dx[0][y2 - 11][x2 + 100] = id;dx[0][y2 - 11][x2 + 107] = id;dx[0][y2 - 11][x2 + 108] = id;dx[0][y2 - 11][x2 + 145] = id;
	dx[0][y2 - 11][x2 + 154] = id;dx[0][y2 - 11][x2 + 155] = id;dx[0][y2 - 11][x2 + 156] = id;dx[0][y2 - 11][x2 + 165] = id;dx[0][y2 - 11][x2 + 167] = id;dx[0][y2 - 11][x2 + 168] = id;dx[0][y2 - 11][x2 + 169] = id;dx[0][y2 - 11][x2 + 170] = id;dx[0][y2 - 11][x2 + 171] = id;
	dx[0][y2 - 11][x2 + 173] = id;dx[0][y2 - 11][x2 + 183] = id;dx[0][y2 - 11][x2 + 191] = id;dx[0][y2 - 11][x2 + 192] = id;dx[0][y2 - 11][x2 + 193] = id;dx[0][y2 - 11][x2 + 194] = id;dx[0][y2 - 11][x2 + 195] = id;dx[0][y2 - 11][x2 + 196] = id;dx[0][y2 - 11][x2 + 197] = id;
	dx[0][y2 - 11][x2 + 198] = id;dx[0][y2 - 11][x2 + 199] = id;dx[0][y2 - 11][x2 + 200] = id;dx[0][y2 - 11][x2 + 201] = id;dx[0][y2 - 11][x2 + 202] = id;dx[0][y2 - 11][x2 + 203] = id;dx[0][y2 - 11][x2 + 206] = id;dx[0][y2 - 11][x2 + 207] = id;dx[0][y2 - 11][x2 + 208] = id;
	dx[0][y2 - 11][x2 + 209] = id;dx[0][y2 - 11][x2 + 210] = id;dx[0][y2 - 11][x2 + 211] = id;dx[0][y2 - 11][x2 + 212] = id;dx[0][y2 - 10][x2 + 0] = id;dx[0][y2 - 10][x2 + 1] = id;dx[0][y2 - 10][x2 + 2] = id;dx[0][y2 - 10][x2 + 3] = id;dx[0][y2 - 10][x2 + 4] = id;
	dx[0][y2 - 10][x2 + 5] = id;dx[0][y2 - 10][x2 + 35] = id;dx[0][y2 - 10][x2 + 36] = id;dx[0][y2 - 10][x2 + 37] = id;dx[0][y2 - 10][x2 + 38] = id;dx[0][y2 - 10][x2 + 39] = id;dx[0][y2 - 10][x2 + 40] = id;dx[0][y2 - 10][x2 + 41] = id;dx[0][y2 - 10][x2 + 42] = id;
	dx[0][y2 - 10][x2 + 43] = id;dx[0][y2 - 10][x2 + 44] = id;dx[0][y2 - 10][x2 + 45] = id;dx[0][y2 - 10][x2 + 46] = id;dx[0][y2 - 10][x2 + 47] = id;dx[0][y2 - 10][x2 + 51] = id;dx[0][y2 - 10][x2 + 52] = id;dx[0][y2 - 10][x2 + 53] = id;dx[0][y2 - 10][x2 + 54] = id;
	dx[0][y2 - 10][x2 + 55] = id;dx[0][y2 - 10][x2 + 56] = id;dx[0][y2 - 10][x2 + 57] = id;dx[0][y2 - 10][x2 + 58] = id;dx[0][y2 - 10][x2 + 79] = id;dx[0][y2 - 10][x2 + 94] = id;dx[0][y2 - 10][x2 + 100] = id;dx[0][y2 - 10][x2 + 107] = id;dx[0][y2 - 10][x2 + 108] = id;
	dx[0][y2 - 10][x2 + 146] = id;dx[0][y2 - 10][x2 + 154] = id;dx[0][y2 - 10][x2 + 163] = id;dx[0][y2 - 10][x2 + 164] = id;dx[0][y2 - 10][x2 + 165] = id;dx[0][y2 - 10][x2 + 167] = id;dx[0][y2 - 10][x2 + 168] = id;dx[0][y2 - 10][x2 + 169] = id;dx[0][y2 - 10][x2 + 170] = id;
	dx[0][y2 - 10][x2 + 171] = id;dx[0][y2 - 10][x2 + 173] = id;dx[0][y2 - 10][x2 + 174] = id;dx[0][y2 - 10][x2 + 175] = id;dx[0][y2 - 10][x2 + 183] = id;dx[0][y2 - 10][x2 + 189] = id;dx[0][y2 - 10][x2 + 190] = id;dx[0][y2 - 10][x2 + 191] = id;dx[0][y2 - 10][x2 + 192] = id;
	dx[0][y2 - 10][x2 + 193] = id;dx[0][y2 - 10][x2 + 194] = id;dx[0][y2 - 10][x2 + 195] = id;dx[0][y2 - 10][x2 + 196] = id;dx[0][y2 - 10][x2 + 197] = id;dx[0][y2 - 10][x2 + 198] = id;dx[0][y2 - 10][x2 + 199] = id;dx[0][y2 - 10][x2 + 200] = id;dx[0][y2 - 10][x2 + 201] = id;
	dx[0][y2 - 10][x2 + 203] = id;dx[0][y2 - 10][x2 + 204] = id;dx[0][y2 - 10][x2 + 205] = id;dx[0][y2 - 10][x2 + 212] = id;dx[0][y2 - 9][x2 + 0] = id;dx[0][y2 - 9][x2 + 1] = id;dx[0][y2 - 9][x2 + 2] = id;dx[0][y2 - 9][x2 + 3] = id;dx[0][y2 - 9][x2 + 4] = id;
	dx[0][y2 - 9][x2 + 5] = id;dx[0][y2 - 9][x2 + 35] = id;dx[0][y2 - 9][x2 + 41] = id;dx[0][y2 - 9][x2 + 47] = id;dx[0][y2 - 9][x2 + 53] = id;dx[0][y2 - 9][x2 + 54] = id;dx[0][y2 - 9][x2 + 55] = id;dx[0][y2 - 9][x2 + 56] = id;dx[0][y2 - 9][x2 + 57] = id;
	dx[0][y2 - 9][x2 + 58] = id;dx[0][y2 - 9][x2 + 78] = id;dx[0][y2 - 9][x2 + 79] = id;dx[0][y2 - 9][x2 + 80] = id;dx[0][y2 - 9][x2 + 81] = id;dx[0][y2 - 9][x2 + 82] = id;dx[0][y2 - 9][x2 + 83] = id;dx[0][y2 - 9][x2 + 84] = id;dx[0][y2 - 9][x2 + 85] = id;
	dx[0][y2 - 9][x2 + 86] = id;dx[0][y2 - 9][x2 + 87] = id;dx[0][y2 - 9][x2 + 88] = id;dx[0][y2 - 9][x2 + 89] = id;dx[0][y2 - 9][x2 + 90] = id;dx[0][y2 - 9][x2 + 91] = id;dx[0][y2 - 9][x2 + 92] = id;dx[0][y2 - 9][x2 + 93] = id;dx[0][y2 - 9][x2 + 94] = id;
	dx[0][y2 - 9][x2 + 95] = id;dx[0][y2 - 9][x2 + 100] = id;dx[0][y2 - 9][x2 + 107] = id;dx[0][y2 - 9][x2 + 146] = id;dx[0][y2 - 9][x2 + 154] = id;dx[0][y2 - 9][x2 + 155] = id;dx[0][y2 - 9][x2 + 156] = id;dx[0][y2 - 9][x2 + 157] = id;dx[0][y2 - 9][x2 + 158] = id;
	dx[0][y2 - 9][x2 + 163] = id;dx[0][y2 - 9][x2 + 164] = id;dx[0][y2 - 9][x2 + 165] = id;dx[0][y2 - 9][x2 + 166] = id;dx[0][y2 - 9][x2 + 167] = id;dx[0][y2 - 9][x2 + 168] = id;dx[0][y2 - 9][x2 + 169] = id;dx[0][y2 - 9][x2 + 170] = id;dx[0][y2 - 9][x2 + 171] = id;
	dx[0][y2 - 9][x2 + 172] = id;dx[0][y2 - 9][x2 + 173] = id;dx[0][y2 - 9][x2 + 174] = id;dx[0][y2 - 9][x2 + 175] = id;dx[0][y2 - 9][x2 + 183] = id;dx[0][y2 - 9][x2 + 188] = id;dx[0][y2 - 9][x2 + 189] = id;dx[0][y2 - 9][x2 + 190] = id;dx[0][y2 - 9][x2 + 191] = id;
	dx[0][y2 - 9][x2 + 201] = id;dx[0][y2 - 9][x2 + 202] = id;dx[0][y2 - 9][x2 + 205] = id;dx[0][y2 - 9][x2 + 206] = id;dx[0][y2 - 9][x2 + 208] = id;dx[0][y2 - 9][x2 + 209] = id;dx[0][y2 - 9][x2 + 210] = id;dx[0][y2 - 9][x2 + 211] = id;dx[0][y2 - 9][x2 + 212] = id;
	dx[0][y2 - 8][x2 + 0] = id;dx[0][y2 - 8][x2 + 35] = id;dx[0][y2 - 8][x2 + 41] = id;dx[0][y2 - 8][x2 + 47] = id;dx[0][y2 - 8][x2 + 49] = id;dx[0][y2 - 8][x2 + 50] = id;dx[0][y2 - 8][x2 + 51] = id;dx[0][y2 - 8][x2 + 52] = id;dx[0][y2 - 8][x2 + 53] = id;
	dx[0][y2 - 8][x2 + 56] = id;dx[0][y2 - 8][x2 + 78] = id;dx[0][y2 - 8][x2 + 79] = id;dx[0][y2 - 8][x2 + 80] = id;dx[0][y2 - 8][x2 + 81] = id;dx[0][y2 - 8][x2 + 82] = id;dx[0][y2 - 8][x2 + 83] = id;dx[0][y2 - 8][x2 + 84] = id;dx[0][y2 - 8][x2 + 85] = id;
	dx[0][y2 - 8][x2 + 86] = id;dx[0][y2 - 8][x2 + 87] = id;dx[0][y2 - 8][x2 + 88] = id;dx[0][y2 - 8][x2 + 89] = id;dx[0][y2 - 8][x2 + 90] = id;dx[0][y2 - 8][x2 + 91] = id;dx[0][y2 - 8][x2 + 92] = id;dx[0][y2 - 8][x2 + 93] = id;dx[0][y2 - 8][x2 + 94] = id;
	dx[0][y2 - 8][x2 + 95] = id;dx[0][y2 - 8][x2 + 100] = id;dx[0][y2 - 8][x2 + 106] = id;dx[0][y2 - 8][x2 + 107] = id;dx[0][y2 - 8][x2 + 147] = id;dx[0][y2 - 8][x2 + 154] = id;dx[0][y2 - 8][x2 + 155] = id;dx[0][y2 - 8][x2 + 156] = id;dx[0][y2 - 8][x2 + 157] = id;
	dx[0][y2 - 8][x2 + 183] = id;dx[0][y2 - 8][x2 + 187] = id;dx[0][y2 - 8][x2 + 188] = id;dx[0][y2 - 8][x2 + 189] = id;dx[0][y2 - 8][x2 + 190] = id;dx[0][y2 - 8][x2 + 202] = id;dx[0][y2 - 8][x2 + 203] = id;dx[0][y2 - 8][x2 + 206] = id;dx[0][y2 - 8][x2 + 209] = id;
	dx[0][y2 - 8][x2 + 210] = id;dx[0][y2 - 8][x2 + 211] = id;dx[0][y2 - 8][x2 + 212] = id;dx[0][y2 - 7][x2 + 0] = id;dx[0][y2 - 7][x2 + 1] = id;dx[0][y2 - 7][x2 + 2] = id;dx[0][y2 - 7][x2 + 3] = id;dx[0][y2 - 7][x2 + 4] = id;dx[0][y2 - 7][x2 + 5] = id;
	dx[0][y2 - 7][x2 + 6] = id;dx[0][y2 - 7][x2 + 35] = id;dx[0][y2 - 7][x2 + 36] = id;dx[0][y2 - 7][x2 + 37] = id;dx[0][y2 - 7][x2 + 38] = id;dx[0][y2 - 7][x2 + 39] = id;dx[0][y2 - 7][x2 + 40] = id;dx[0][y2 - 7][x2 + 41] = id;dx[0][y2 - 7][x2 + 42] = id;
	dx[0][y2 - 7][x2 + 43] = id;dx[0][y2 - 7][x2 + 44] = id;dx[0][y2 - 7][x2 + 45] = id;dx[0][y2 - 7][x2 + 46] = id;dx[0][y2 - 7][x2 + 47] = id;dx[0][y2 - 7][x2 + 50] = id;dx[0][y2 - 7][x2 + 51] = id;dx[0][y2 - 7][x2 + 52] = id;dx[0][y2 - 7][x2 + 53] = id;
	dx[0][y2 - 7][x2 + 56] = id;dx[0][y2 - 7][x2 + 100] = id;dx[0][y2 - 7][x2 + 106] = id;dx[0][y2 - 7][x2 + 147] = id;dx[0][y2 - 7][x2 + 154] = id;dx[0][y2 - 7][x2 + 183] = id;dx[0][y2 - 7][x2 + 187] = id;dx[0][y2 - 7][x2 + 189] = id;dx[0][y2 - 7][x2 + 203] = id;
	dx[0][y2 - 7][x2 + 212] = id;dx[0][y2 - 6][x2 + 0] = id;dx[0][y2 - 6][x2 + 1] = id;dx[0][y2 - 6][x2 + 2] = id;dx[0][y2 - 6][x2 + 3] = id;dx[0][y2 - 6][x2 + 4] = id;dx[0][y2 - 6][x2 + 5] = id;dx[0][y2 - 6][x2 + 37] = id;dx[0][y2 - 6][x2 + 41] = id;
	dx[0][y2 - 6][x2 + 45] = id;dx[0][y2 - 6][x2 + 53] = id;dx[0][y2 - 6][x2 + 54] = id;dx[0][y2 - 6][x2 + 55] = id;dx[0][y2 - 6][x2 + 56] = id;dx[0][y2 - 6][x2 + 100] = id;dx[0][y2 - 6][x2 + 106] = id;dx[0][y2 - 6][x2 + 147] = id;dx[0][y2 - 6][x2 + 148] = id;
	dx[0][y2 - 6][x2 + 154] = id;dx[0][y2 - 6][x2 + 183] = id;dx[0][y2 - 6][x2 + 187] = id;dx[0][y2 - 6][x2 + 189] = id;dx[0][y2 - 6][x2 + 203] = id;dx[0][y2 - 6][x2 + 206] = id;dx[0][y2 - 6][x2 + 207] = id;dx[0][y2 - 6][x2 + 208] = id;dx[0][y2 - 6][x2 + 209] = id;
	dx[0][y2 - 6][x2 + 210] = id;dx[0][y2 - 6][x2 + 211] = id;dx[0][y2 - 6][x2 + 212] = id;dx[0][y2 - 5][x2 + 0] = id;dx[0][y2 - 5][x2 + 39] = id;dx[0][y2 - 5][x2 + 41] = id;dx[0][y2 - 5][x2 + 43] = id;dx[0][y2 - 5][x2 + 53] = id;dx[0][y2 - 5][x2 + 54] = id;
	dx[0][y2 - 5][x2 + 55] = id;dx[0][y2 - 5][x2 + 56] = id;dx[0][y2 - 5][x2 + 100] = id;dx[0][y2 - 5][x2 + 105] = id;dx[0][y2 - 5][x2 + 106] = id;dx[0][y2 - 5][x2 + 147] = id;dx[0][y2 - 5][x2 + 148] = id;dx[0][y2 - 5][x2 + 154] = id;dx[0][y2 - 5][x2 + 155] = id;
	dx[0][y2 - 5][x2 + 156] = id;dx[0][y2 - 5][x2 + 157] = id;dx[0][y2 - 5][x2 + 158] = id;dx[0][y2 - 5][x2 + 183] = id;dx[0][y2 - 5][x2 + 187] = id;dx[0][y2 - 5][x2 + 189] = id;dx[0][y2 - 5][x2 + 203] = id;dx[0][y2 - 5][x2 + 206] = id;dx[0][y2 - 5][x2 + 207] = id;
	dx[0][y2 - 5][x2 + 208] = id;dx[0][y2 - 5][x2 + 209] = id;dx[0][y2 - 5][x2 + 210] = id;dx[0][y2 - 5][x2 + 211] = id;dx[0][y2 - 5][x2 + 212] = id;dx[0][y2 - 4][x2 + 0] = id;dx[0][y2 - 4][x2 + 41] = id;dx[0][y2 - 4][x2 + 48] = id;dx[0][y2 - 4][x2 + 49] = id;
	dx[0][y2 - 4][x2 + 50] = id;dx[0][y2 - 4][x2 + 51] = id;dx[0][y2 - 4][x2 + 52] = id;dx[0][y2 - 4][x2 + 53] = id;dx[0][y2 - 4][x2 + 56] = id;dx[0][y2 - 4][x2 + 71] = id;dx[0][y2 - 4][x2 + 72] = id;dx[0][y2 - 4][x2 + 73] = id;dx[0][y2 - 4][x2 + 74] = id;
	dx[0][y2 - 4][x2 + 75] = id;dx[0][y2 - 4][x2 + 76] = id;dx[0][y2 - 4][x2 + 77] = id;dx[0][y2 - 4][x2 + 78] = id;dx[0][y2 - 4][x2 + 79] = id;dx[0][y2 - 4][x2 + 80] = id;dx[0][y2 - 4][x2 + 81] = id;dx[0][y2 - 4][x2 + 82] = id;dx[0][y2 - 4][x2 + 100] = id;
	dx[0][y2 - 4][x2 + 105] = id;dx[0][y2 - 4][x2 + 106] = id;dx[0][y2 - 4][x2 + 148] = id;dx[0][y2 - 4][x2 + 149] = id;dx[0][y2 - 4][x2 + 154] = id;dx[0][y2 - 4][x2 + 155] = id;dx[0][y2 - 4][x2 + 156] = id;dx[0][y2 - 4][x2 + 183] = id;dx[0][y2 - 4][x2 + 187] = id;
	dx[0][y2 - 4][x2 + 189] = id;dx[0][y2 - 4][x2 + 203] = id;dx[0][y2 - 4][x2 + 212] = id;dx[0][y2 - 3][x2 + 0] = id;dx[0][y2 - 3][x2 + 1] = id;dx[0][y2 - 3][x2 + 2] = id;dx[0][y2 - 3][x2 + 3] = id;dx[0][y2 - 3][x2 + 4] = id;dx[0][y2 - 3][x2 + 5] = id;
	dx[0][y2 - 3][x2 + 48] = id;dx[0][y2 - 3][x2 + 49] = id;dx[0][y2 - 3][x2 + 50] = id;dx[0][y2 - 3][x2 + 51] = id;dx[0][y2 - 3][x2 + 52] = id;dx[0][y2 - 3][x2 + 53] = id;dx[0][y2 - 3][x2 + 56] = id;dx[0][y2 - 3][x2 + 66] = id;dx[0][y2 - 3][x2 + 67] = id;
	dx[0][y2 - 3][x2 + 68] = id;dx[0][y2 - 3][x2 + 69] = id;dx[0][y2 - 3][x2 + 70] = id;dx[0][y2 - 3][x2 + 83] = id;dx[0][y2 - 3][x2 + 84] = id;dx[0][y2 - 3][x2 + 85] = id;dx[0][y2 - 3][x2 + 86] = id;dx[0][y2 - 3][x2 + 87] = id;dx[0][y2 - 3][x2 + 100] = id;
	dx[0][y2 - 3][x2 + 105] = id;dx[0][y2 - 3][x2 + 106] = id;dx[0][y2 - 3][x2 + 148] = id;dx[0][y2 - 3][x2 + 149] = id;dx[0][y2 - 3][x2 + 154] = id;dx[0][y2 - 3][x2 + 183] = id;dx[0][y2 - 3][x2 + 187] = id;dx[0][y2 - 3][x2 + 189] = id;dx[0][y2 - 3][x2 + 203] = id;
	dx[0][y2 - 3][x2 + 206] = id;dx[0][y2 - 3][x2 + 207] = id;dx[0][y2 - 3][x2 + 208] = id;dx[0][y2 - 3][x2 + 210] = id;dx[0][y2 - 3][x2 + 211] = id;dx[0][y2 - 3][x2 + 212] = id;dx[0][y2 - 2][x2 + 0] = id;dx[0][y2 - 2][x2 + 1] = id;dx[0][y2 - 2][x2 + 2] = id;
	dx[0][y2 - 2][x2 + 3] = id;dx[0][y2 - 2][x2 + 4] = id;dx[0][y2 - 2][x2 + 5] = id;dx[0][y2 - 2][x2 + 53] = id;dx[0][y2 - 2][x2 + 56] = id;dx[0][y2 - 2][x2 + 61] = id;dx[0][y2 - 2][x2 + 62] = id;dx[0][y2 - 2][x2 + 63] = id;dx[0][y2 - 2][x2 + 64] = id;
	dx[0][y2 - 2][x2 + 65] = id;dx[0][y2 - 2][x2 + 68] = id;dx[0][y2 - 2][x2 + 69] = id;dx[0][y2 - 2][x2 + 70] = id;dx[0][y2 - 2][x2 + 71] = id;dx[0][y2 - 2][x2 + 72] = id;dx[0][y2 - 2][x2 + 73] = id;dx[0][y2 - 2][x2 + 74] = id;dx[0][y2 - 2][x2 + 75] = id;
	dx[0][y2 - 2][x2 + 76] = id;dx[0][y2 - 2][x2 + 77] = id;dx[0][y2 - 2][x2 + 78] = id;dx[0][y2 - 2][x2 + 79] = id;dx[0][y2 - 2][x2 + 80] = id;dx[0][y2 - 2][x2 + 81] = id;dx[0][y2 - 2][x2 + 82] = id;dx[0][y2 - 2][x2 + 83] = id;dx[0][y2 - 2][x2 + 84] = id;
	dx[0][y2 - 2][x2 + 85] = id;dx[0][y2 - 2][x2 + 88] = id;dx[0][y2 - 2][x2 + 89] = id;dx[0][y2 - 2][x2 + 90] = id;dx[0][y2 - 2][x2 + 91] = id;dx[0][y2 - 2][x2 + 92] = id;dx[0][y2 - 2][x2 + 100] = id;dx[0][y2 - 2][x2 + 104] = id;dx[0][y2 - 2][x2 + 105] = id;
	dx[0][y2 - 2][x2 + 149] = id;dx[0][y2 - 2][x2 + 150] = id;dx[0][y2 - 2][x2 + 154] = id;dx[0][y2 - 2][x2 + 182] = id;dx[0][y2 - 2][x2 + 183] = id;dx[0][y2 - 2][x2 + 184] = id;dx[0][y2 - 2][x2 + 185] = id;dx[0][y2 - 2][x2 + 186] = id;dx[0][y2 - 2][x2 + 187] = id;
	dx[0][y2 - 2][x2 + 188] = id;dx[0][y2 - 2][x2 + 189] = id;dx[0][y2 - 2][x2 + 203] = id;dx[0][y2 - 2][x2 + 204] = id;dx[0][y2 - 2][x2 + 205] = id;dx[0][y2 - 2][x2 + 206] = id;dx[0][y2 - 2][x2 + 207] = id;dx[0][y2 - 2][x2 + 208] = id;dx[0][y2 - 2][x2 + 209] = id;
	dx[0][y2 - 2][x2 + 210] = id;dx[0][y2 - 2][x2 + 211] = id;dx[0][y2 - 2][x2 + 212] = id;dx[0][y2 - 1][x2 + 0] = id;dx[0][y2 - 1][x2 + 1] = id;dx[0][y2 - 1][x2 + 2] = id;dx[0][y2 - 1][x2 + 3] = id;dx[0][y2 - 1][x2 + 4] = id;dx[0][y2 - 1][x2 + 53] = id;
	dx[0][y2 - 1][x2 + 56] = id;dx[0][y2 - 1][x2 + 57] = id;dx[0][y2 - 1][x2 + 58] = id;dx[0][y2 - 1][x2 + 59] = id;dx[0][y2 - 1][x2 + 60] = id;dx[0][y2 - 1][x2 + 61] = id;dx[0][y2 - 1][x2 + 62] = id;dx[0][y2 - 1][x2 + 63] = id;dx[0][y2 - 1][x2 + 64] = id;
	dx[0][y2 - 1][x2 + 65] = id;dx[0][y2 - 1][x2 + 66] = id;dx[0][y2 - 1][x2 + 67] = id;dx[0][y2 - 1][x2 + 76] = id;dx[0][y2 - 1][x2 + 77] = id;dx[0][y2 - 1][x2 + 78] = id;dx[0][y2 - 1][x2 + 86] = id;dx[0][y2 - 1][x2 + 87] = id;dx[0][y2 - 1][x2 + 88] = id;
	dx[0][y2 - 1][x2 + 89] = id;dx[0][y2 - 1][x2 + 90] = id;dx[0][y2 - 1][x2 + 91] = id;dx[0][y2 - 1][x2 + 92] = id;dx[0][y2 - 1][x2 + 93] = id;dx[0][y2 - 1][x2 + 94] = id;dx[0][y2 - 1][x2 + 95] = id;dx[0][y2 - 1][x2 + 96] = id;dx[0][y2 - 1][x2 + 97] = id;
	dx[0][y2 - 1][x2 + 100] = id;dx[0][y2 - 1][x2 + 104] = id;dx[0][y2 - 1][x2 + 105] = id;dx[0][y2 - 1][x2 + 149] = id;dx[0][y2 - 1][x2 + 150] = id;dx[0][y2 - 1][x2 + 154] = id;dx[0][y2 - 1][x2 + 155] = id;dx[0][y2 - 1][x2 + 156] = id;dx[0][y2 - 1][x2 + 157] = id;
	dx[0][y2 - 1][x2 + 181] = id;dx[0][y2 - 1][x2 + 182] = id;dx[0][y2 - 1][x2 + 183] = id;dx[0][y2 - 1][x2 + 184] = id;dx[0][y2 - 1][x2 + 185] = id;dx[0][y2 - 1][x2 + 186] = id;dx[0][y2 - 1][x2 + 187] = id;dx[0][y2 - 1][x2 + 188] = id;dx[0][y2 - 1][x2 + 189] = id;
	dx[0][y2 - 1][x2 + 203] = id;dx[0][y2 - 1][x2 + 204] = id;dx[0][y2 - 1][x2 + 205] = id;dx[0][y2 - 1][x2 + 206] = id;dx[0][y2 - 1][x2 + 207] = id;dx[0][y2 - 1][x2 + 208] = id;dx[0][y2 - 1][x2 + 209] = id;dx[0][y2 - 1][x2 + 212] = id;dx[0][y2 + 0][x2 + 0] = id;
	dx[0][y2 + 0][x2 + 1] = id;dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 0][x2 + 6] = id;dx[0][y2 + 0][x2 + 7] = id;dx[0][y2 + 0][x2 + 8] = id;dx[0][y2 + 0][x2 + 9] = id;
	dx[0][y2 + 0][x2 + 10] = id;dx[0][y2 + 0][x2 + 11] = id;dx[0][y2 + 0][x2 + 12] = id;dx[0][y2 + 0][x2 + 13] = id;dx[0][y2 + 0][x2 + 14] = id;dx[0][y2 + 0][x2 + 15] = id;dx[0][y2 + 0][x2 + 16] = id;dx[0][y2 + 0][x2 + 17] = id;dx[0][y2 + 0][x2 + 18] = id;
	dx[0][y2 + 0][x2 + 19] = id;dx[0][y2 + 0][x2 + 20] = id;dx[0][y2 + 0][x2 + 21] = id;dx[0][y2 + 0][x2 + 22] = id;dx[0][y2 + 0][x2 + 23] = id;dx[0][y2 + 0][x2 + 24] = id;dx[0][y2 + 0][x2 + 25] = id;dx[0][y2 + 0][x2 + 26] = id;dx[0][y2 + 0][x2 + 27] = id;
	dx[0][y2 + 0][x2 + 28] = id;dx[0][y2 + 0][x2 + 29] = id;dx[0][y2 + 0][x2 + 30] = id;dx[0][y2 + 0][x2 + 31] = id;dx[0][y2 + 0][x2 + 32] = id;dx[0][y2 + 0][x2 + 33] = id;dx[0][y2 + 0][x2 + 34] = id;dx[0][y2 + 0][x2 + 35] = id;dx[0][y2 + 0][x2 + 36] = id;
	dx[0][y2 + 0][x2 + 37] = id;dx[0][y2 + 0][x2 + 38] = id;dx[0][y2 + 0][x2 + 39] = id;dx[0][y2 + 0][x2 + 40] = id;dx[0][y2 + 0][x2 + 41] = id;dx[0][y2 + 0][x2 + 42] = id;dx[0][y2 + 0][x2 + 43] = id;dx[0][y2 + 0][x2 + 44] = id;dx[0][y2 + 0][x2 + 45] = id;
	dx[0][y2 + 0][x2 + 46] = id;dx[0][y2 + 0][x2 + 47] = id;dx[0][y2 + 0][x2 + 48] = id;dx[0][y2 + 0][x2 + 49] = id;dx[0][y2 + 0][x2 + 50] = id;dx[0][y2 + 0][x2 + 51] = id;dx[0][y2 + 0][x2 + 52] = id;dx[0][y2 + 0][x2 + 53] = id;dx[0][y2 + 0][x2 + 54] = id;
	dx[0][y2 + 0][x2 + 55] = id;dx[0][y2 + 0][x2 + 56] = id;dx[0][y2 + 0][x2 + 57] = id;dx[0][y2 + 0][x2 + 58] = id;dx[0][y2 + 0][x2 + 59] = id;dx[0][y2 + 0][x2 + 60] = id;dx[0][y2 + 0][x2 + 61] = id;dx[0][y2 + 0][x2 + 62] = id;dx[0][y2 + 0][x2 + 63] = id;
	dx[0][y2 + 0][x2 + 64] = id;dx[0][y2 + 0][x2 + 65] = id;dx[0][y2 + 0][x2 + 66] = id;dx[0][y2 + 0][x2 + 67] = id;dx[0][y2 + 0][x2 + 68] = id;dx[0][y2 + 0][x2 + 69] = id;dx[0][y2 + 0][x2 + 70] = id;dx[0][y2 + 0][x2 + 71] = id;dx[0][y2 + 0][x2 + 72] = id;
	dx[0][y2 + 0][x2 + 73] = id;dx[0][y2 + 0][x2 + 74] = id;dx[0][y2 + 0][x2 + 75] = id;dx[0][y2 + 0][x2 + 76] = id;dx[0][y2 + 0][x2 + 77] = id;dx[0][y2 + 0][x2 + 78] = id;dx[0][y2 + 0][x2 + 79] = id;dx[0][y2 + 0][x2 + 80] = id;dx[0][y2 + 0][x2 + 81] = id;
	dx[0][y2 + 0][x2 + 82] = id;dx[0][y2 + 0][x2 + 83] = id;dx[0][y2 + 0][x2 + 84] = id;dx[0][y2 + 0][x2 + 85] = id;dx[0][y2 + 0][x2 + 86] = id;dx[0][y2 + 0][x2 + 87] = id;dx[0][y2 + 0][x2 + 88] = id;dx[0][y2 + 0][x2 + 89] = id;dx[0][y2 + 0][x2 + 90] = id;
	dx[0][y2 + 0][x2 + 91] = id;dx[0][y2 + 0][x2 + 92] = id;dx[0][y2 + 0][x2 + 93] = id;dx[0][y2 + 0][x2 + 94] = id;dx[0][y2 + 0][x2 + 95] = id;dx[0][y2 + 0][x2 + 96] = id;dx[0][y2 + 0][x2 + 97] = id;dx[0][y2 + 0][x2 + 98] = id;dx[0][y2 + 0][x2 + 99] = id;
	dx[0][y2 + 0][x2 + 100] = id;dx[0][y2 + 0][x2 + 101] = id;dx[0][y2 + 0][x2 + 102] = id;dx[0][y2 + 0][x2 + 103] = id;dx[0][y2 + 0][x2 + 104] = id;dx[0][y2 + 0][x2 + 105] = id;dx[0][y2 + 0][x2 + 106] = id;dx[0][y2 + 0][x2 + 107] = id;dx[0][y2 + 0][x2 + 108] = id;
	dx[0][y2 + 0][x2 + 109] = id;dx[0][y2 + 0][x2 + 110] = id;dx[0][y2 + 0][x2 + 111] = id;dx[0][y2 + 0][x2 + 112] = id;dx[0][y2 + 0][x2 + 113] = id;dx[0][y2 + 0][x2 + 114] = id;dx[0][y2 + 0][x2 + 115] = id;dx[0][y2 + 0][x2 + 116] = id;dx[0][y2 + 0][x2 + 117] = id;
	dx[0][y2 + 0][x2 + 118] = id;dx[0][y2 + 0][x2 + 119] = id;dx[0][y2 + 0][x2 + 120] = id;dx[0][y2 + 0][x2 + 121] = id;dx[0][y2 + 0][x2 + 122] = id;dx[0][y2 + 0][x2 + 123] = id;dx[0][y2 + 0][x2 + 124] = id;dx[0][y2 + 0][x2 + 125] = id;dx[0][y2 + 0][x2 + 126] = id;
	dx[0][y2 + 0][x2 + 127] = id;dx[0][y2 + 0][x2 + 128] = id;dx[0][y2 + 0][x2 + 129] = id;dx[0][y2 + 0][x2 + 130] = id;dx[0][y2 + 0][x2 + 131] = id;dx[0][y2 + 0][x2 + 132] = id;dx[0][y2 + 0][x2 + 133] = id;dx[0][y2 + 0][x2 + 134] = id;dx[0][y2 + 0][x2 + 135] = id;
	dx[0][y2 + 0][x2 + 136] = id;dx[0][y2 + 0][x2 + 137] = id;dx[0][y2 + 0][x2 + 138] = id;dx[0][y2 + 0][x2 + 139] = id;dx[0][y2 + 0][x2 + 140] = id;dx[0][y2 + 0][x2 + 141] = id;dx[0][y2 + 0][x2 + 142] = id;dx[0][y2 + 0][x2 + 143] = id;dx[0][y2 + 0][x2 + 144] = id;
	dx[0][y2 + 0][x2 + 145] = id;dx[0][y2 + 0][x2 + 146] = id;dx[0][y2 + 0][x2 + 147] = id;dx[0][y2 + 0][x2 + 148] = id;dx[0][y2 + 0][x2 + 149] = id;dx[0][y2 + 0][x2 + 150] = id;dx[0][y2 + 0][x2 + 151] = id;dx[0][y2 + 0][x2 + 152] = id;dx[0][y2 + 0][x2 + 153] = id;
	dx[0][y2 + 0][x2 + 154] = id;dx[0][y2 + 0][x2 + 155] = id;dx[0][y2 + 0][x2 + 156] = id;dx[0][y2 + 0][x2 + 157] = id;dx[0][y2 + 0][x2 + 158] = id;dx[0][y2 + 0][x2 + 159] = id;dx[0][y2 + 0][x2 + 160] = id;dx[0][y2 + 0][x2 + 161] = id;dx[0][y2 + 0][x2 + 162] = id;
	dx[0][y2 + 0][x2 + 163] = id;dx[0][y2 + 0][x2 + 164] = id;dx[0][y2 + 0][x2 + 165] = id;dx[0][y2 + 0][x2 + 166] = id;dx[0][y2 + 0][x2 + 167] = id;dx[0][y2 + 0][x2 + 168] = id;dx[0][y2 + 0][x2 + 169] = id;dx[0][y2 + 0][x2 + 170] = id;dx[0][y2 + 0][x2 + 171] = id;
	dx[0][y2 + 0][x2 + 172] = id;dx[0][y2 + 0][x2 + 173] = id;dx[0][y2 + 0][x2 + 174] = id;dx[0][y2 + 0][x2 + 175] = id;dx[0][y2 + 0][x2 + 176] = id;dx[0][y2 + 0][x2 + 177] = id;dx[0][y2 + 0][x2 + 178] = id;dx[0][y2 + 0][x2 + 179] = id;dx[0][y2 + 0][x2 + 180] = id;
	dx[0][y2 + 0][x2 + 181] = id;dx[0][y2 + 0][x2 + 182] = id;dx[0][y2 + 0][x2 + 183] = id;dx[0][y2 + 0][x2 + 184] = id;dx[0][y2 + 0][x2 + 185] = id;dx[0][y2 + 0][x2 + 186] = id;dx[0][y2 + 0][x2 + 187] = id;dx[0][y2 + 0][x2 + 188] = id;dx[0][y2 + 0][x2 + 189] = id;
	dx[0][y2 + 0][x2 + 190] = id;dx[0][y2 + 0][x2 + 191] = id;dx[0][y2 + 0][x2 + 192] = id;dx[0][y2 + 0][x2 + 193] = id;dx[0][y2 + 0][x2 + 194] = id;dx[0][y2 + 0][x2 + 195] = id;dx[0][y2 + 0][x2 + 196] = id;dx[0][y2 + 0][x2 + 197] = id;dx[0][y2 + 0][x2 + 198] = id;
	dx[0][y2 + 0][x2 + 199] = id;dx[0][y2 + 0][x2 + 200] = id;dx[0][y2 + 0][x2 + 201] = id;dx[0][y2 + 0][x2 + 202] = id;dx[0][y2 + 0][x2 + 203] = id;dx[0][y2 + 0][x2 + 204] = id;dx[0][y2 + 0][x2 + 205] = id;dx[0][y2 + 0][x2 + 206] = id;dx[0][y2 + 0][x2 + 207] = id;
	dx[0][y2 + 0][x2 + 208] = id;dx[0][y2 + 0][x2 + 209] = id;dx[0][y2 + 0][x2 + 210] = id;dx[0][y2 + 0][x2 + 211] = id;dx[0][y2 + 0][x2 + 212] = id;dx[0][y2 + 1][x2 + 87] = id;dx[0][y2 + 1][x2 + 98] = id;dx[0][y2 + 1][x2 + 100] = id;
}

void mondt(int kind, int amount, int id, int ix, int iy) //怪物种族 本关卡第几个 怪物id 位置x,y 
{
	monst[kind][amount] = id;
	xmonst[id] = ix;
	ymonst[id] = iy;
	
}

void missionsector/*剧情触发器*/(int x1, int y1, int id, int e)
{
#define 探测半径 9
	if (e == 0)
	{
		int r=探测半径,sy,sx;
		x1 = x1 + 30 + 30;
		y1 = 600 - y1;
		sx = x1 - x;
		sy = y1 - y;
		if ((sx*sx) + (sy*sy) < r*r)
		{
			cgrah = id;mison = 0;
			
			

			
			


		}
		
	}

}

void computergraphics/*游戏cg剧情*/(int e)
{
	
	switch (e) //第几个剧情
	{
	case 1:
	{
		         if(cgend[e]==0)
	             {
	                         cartoon = 1;//第一个剧情
		                     switch (cgsave)//剧情第几个阶段 
		                     {
		                       case 0:
			                    if (j3[5] == 0)
			                    {
									mondt(12, 1, 29, 1585, 9);
									mondt(12, 2, 30, 1570, 9);
				                  j3[5]++;//已经触发标识
				                  j2 = 12;
				                  j4 = 17;//对话文本数
				                  cgsave++;

			                    }break;
		                       case 1:
			                    if (j4 == j2)//对话结束
			                    {
				                if ((xm[29] > x + 6) && (xm[29] - x - 6 < 4))xm[29]--;else if ((xm[29] > x + 6))xm[29] -= 2;
				                if ((xm[30] > x - 6) && (xm[30] - x + 6 < 4))xm[30]--;else if ((xm[30] > x - 6))xm[30] -= 2;
				                if ((xm[29] < x + 6) && (xm[29] - x - 6 > -4))xm[29]++;else if ((xm[29] < x + 6))xm[29] += 2;
				                if ((xm[30] < x - 6) && (xm[30] - x + 6 > -4))xm[30]++;else if ((xm[30] < x - 6))xm[30] += 2;
				                if ((xm[29] == x + 6) && (xm[30] == x - 6)) 
				                {
					            cgsave++;room = 70;
								
				                }
				
			                    }break;
		                       case 2: {
			
								 
			                   talkf(98, 103);
			                   if (meun == 0) { cgsave++; firepot = 1; x = 1638;
			                   }//54房间切换到71
		
		                       }break;
							   case 3: {  
								   mondt(12, 1, 32, 1585, 9);
								   mondt(12, 2, 31, 1570, 9);
								   if (cgx > 1500)
									   cgx--;
								   else{cgsave++;}
								  if (meun == 0) {cgsave++;}
		                       }break;
							   case 4: {
								   cgx = xm[33];
								   axmonst[33] =1;
								   if (V2monst[33] > 1) { V2monst[33] = 1;V1monst[33] = 1; }
								   if (xm[33] + 30 == x) {
									   cgsave++;V2monst[33] = 0;V1monst[33] = 0;axmonst[33] = 0;
								   }
								   room = 21;
							   }break;
								case 5: {
									talkf(104,106);
									if (meun == 0) {
										room = 21;
										cgsave++; firepot = 1;
									}
								}
									   break;
								case 6: { x = 2220;y = 625;
									cgx = x;
									cgy = y + 20;
									
									cgsave++;
									
								}break;
								case 7: {
									mondt(14, 1, 33, 1450, 14);
									mondt(12, 1, 32, 1585, 9);
									mondt(12, 2, 31, 1570, 9);
									xm[31] = 2220+30-70;
									xm[32] = 2220-30;
									ym[31] = 630;
									ym[32] = 630;
									cgsave++;
								}break;
								case 8: {talkf(107, 112);
									if (meun == 0) {
										cgsave++; 
									}
									
								}break;
								case 9: {if ((xm[31] > x + 6) && (xm[31] - x - 6 < 4))xm[31]--;else if ((xm[31] > x + 6))xm[31] -= 2;
									if ((xm[32] > x - 6) && (xm[32] - x + 6 < 4))xm[32]--;else if ((xm[32] > x - 6))xm[32] -= 2;
									if ((xm[31] < x + 6) && (xm[31] - x - 6 > -4))xm[31]++;else if ((xm[31] < x + 6))xm[31] += 2;
									if ((xm[32] < x - 6) && (xm[32] - x + 6 > -4))xm[32]++;else if ((xm[32] < x - 6))xm[32] += 2;
									if ((xm[31] == x + 6) && (xm[32] == x - 6))
									{
										cgsave++;
										xm[33] = 2180 - 40;
										ym[33] = 630;
									}
								}break;
								case 10: {
									if (xm[33] < x - 25) 
									{  axmonst[33] = 1; 
									  if (V2monst[33] > 1) { V2monst[33] = 1;V1monst[33] = 1; }
									}
									else { V2monst[33] = 0;axmonst[33] = 0;V1monst[33] = 0;cgsave++;}
									
								}break;
								case 11: 
										cgsave++;
									

								break;
								case 12: {talkf(113, 114);
									if (meun == 1) {
										cgsave++;
									}
								}break;
								case 13: {talkf(115, 116);
									if (meun == 4) {
										cgsave++;
									}
								}break;
								case 14: {talkf(117, 118);
									if (meun == 2) {
										cgsave++;
									}
								}break;
								case 15: {talkf(119, 120);
									if (meun == 6) {
										cgsave++;
									}
								}break;
								case 16: {
									talkf(121, 126);
									if (meun == 0) {
										cgsave++;
									}
								}break;
								case 17: {
									if (xm[33] > x - 120)
									{
										axmonst[33] = -1;
										if (V2monst[33] < -1) { V2monst[33] = -1;V1monst[33] = -1; }
									}
									else { V2monst[33] = 0;axmonst[33] = 0;V1monst[33] = 0;cgsave++;monst[14][1] = 0; }
								}break;
								case 18: {talkf(127, 128);
									if (meun == 0) {
										cgsave++;
									}
								}break;
								case 19: 
									{if (xm[31] > x - 120)xm[31]-=2;
									if ((xm[32] > x - 120))xm[32]-=2;

									if ((xm[31] <= x - 120) && (xm[32]<=x - 120))
									{
										cgsave++;
										monst[12][1] = 0;
										monst[12][2] = 0;
										cgy = y - 170;
									}
									}break;

								case 20: 
								{
									if (cgy > y - 30)cgy--;
									else {
										cgsave++;
										cgy = y - 170;
									}
								}break;
								case 21:
								{
									cgx = x;
									if(cgy >y -205)cgy--;
									else { cgsave++; 延迟(1000); }
									words(x-80,194,1);
								}break;
								case 22: 
								{
									if (cgy < y - 160)cgy++;
									else 
									{ cgsave++;
									cgy = y + 15;
									x = x - 150;
									cgx = x;
									}
								}break;
								case 23: 
								{
									if (j3[6] == 0)
									{
										j3[6]++;//已经触发标识
										j2 = 17;
										j4 = 21;//对话文本数
										cgsave++;
										

									}
								}break;
								default:cgsave = 0;cgend[e]++;cgrah = 0;cartoon = 0;break;

		                     }
                 }
		                     //cgrah = 0;
		                      
	}break;
	case 2:cartoon = 1;//第二个剧情
	{ if (cgend[e] == 0){
	
		                        switch (cgsave)
		                      {
								case 0:
									if (j3[7] == 0)
									{
										j3[7]++;//已经触发标识
										j2 = 21;
										j4 = 26;//对话文本数
										cgsave++;
										mondt(12, 1, 32, 1585, 9);
										mondt(12, 2, 31, 1570, 9);
										xm[32] = 1350+20;
										xm[31] = 1355+20;

									}
									break;
								case 1:
									if (j4 == j2) {
										xm[32] = 1355 + 20;
										xm[31] = 1350 + 20;
										cgsave++;
									}
									
									break;
								case 2:
									if (xm[32] < 1456)
										xm[32]++;
									if (xm[31] < x - 4)
										xm[31]++;
									if (xm[32] >= 1455 && xm[31] >= x - 4) { cgsave++; }
									break;
								case 3:
									talkf(129, 135);
									if (meun == 0) 
									{
										cgsave++;
									}
									break;
								case 4:
									if (x > 1350) { x--; }
									else { cgsave++; }
									xm[31] = x - 4;
									
									break;
									
								case 5:if (xm[32] > 1350) { xm[32]--; }
									   else { cgsave++;
									room = 150;
									firepot = 1; } break;
								case 6:
									cgsave++;
									y =585;
									视角归位
									break;
								case 7:

									break;
								case 8:
									break;
								case 9:
									break;
								default:cgsave = 0;cgrah = 0;cartoon = 0;cgend[e] = 1;break;

		                       }
                          }	
	
	
	
    }
		break;

	default:cgsave = 0;cgrah = 0;cartoon = 0;break;
	}
}

void watcb/*显示函数*/(char *sh,char creator,short int ep,short int en,char ch1,char ch2,char *ui) 
{
	register int 
		*c1, //静态像素（房屋 建筑 背景所在的层）
		*c2, //动态像素（主角与生物发生逻辑的层）
		*c3; //特效像素（会动并不影响游戏逻辑的层）
	int a, b;
	

	if (creator > 0)
		//开发者模式————————————————————————————————————————
	for ( b = en - 31;en >= b;b++)//10
	{
		//--------------------------------------------------------
		//a,b为发生层函数
		//screenx,screeny为投影层函数
		//--------------------------------------------------------
		for (a = ep - 120, c1 = &dx[0][b][a]/*静态像素*/, c2 = &dx[1][b][a]/*动态像素*/, c3 = &dx[2][b][a]/*特效像素*/;ep >= a;a++, sh++, c1++, c2++, c3++,ui++)
		{
			
			//c2 = c1+5000000;//动态像素dx[1][b][a]的偏差值为5*10^6
			

			//神tm逻辑门
			//1+0=1||0+1=1
			//1+1=0||0+0=1
			if (*c1 == 0) 
			{
				if (*c2 == 0) {
					if (*c3 == 0)*sh = ch1;
					else *sh = ch2;
				}
				else {
					if (*c3 == 0)*sh = ch2;
					else *sh = ch1;
				}
			}
			else 
			{
				if (*c2 == 0) {
					if (*c3 == 0)*sh = ch2;
					else *sh = ch1;
				}
				else {
					  if (*c3 == 0)*sh = ch1;
					  else *sh = ch2;
				}
			}
			//神tm逻辑门



			*c3 = 0;//清理特效像素
			
			switch (picture[b][a])
			{
			case 35:*sh = '#';break;
			case 42:*sh = '*';break;
				//default:;
			}


			//字符投影层
			if (*ui == 1);
			else
			{
				*sh = *ui, *ui = 1;
			}
			//字符投影层


		}
		sh += 79;//指针的跳位到下一行
		ui += 79;//指针的跳位到下一行
	}
	else
		//非开发者模式——————————————————————————————————————————
	for (b = en - 31;en >= b;b++)//10
	{
		//--------------------------------------------------------
		//a,b为发生层函数
		//screenx,screeny为投影层函数
		//--------------------------------------------------------
		for (a = ep - 120,c1 = &dx[0][b][a]/*静态像素*/,c2 = &dx[1][b][a]/*动态像素*/,c3 = &dx[2][b][a]/*特效像素*/;ep >= a;a++, sh++,c1++,c2++,c3++,ui++)
		{
			
			
			
			if (*c1 == 0)
				if (*c2 == 0) 
					if(*c3==0)*sh = ch1;//printf("%c", ch1);
					else *sh = ch2;
				else 
					if(*c3==0)*sh = ch2;
					else *sh = ch1;
			else		
				if (*c2 == 0)
					if(*c3==0)*sh = ch2;
					else *sh = ch1;
				else  
					if(*c3==0)*sh = ch1;
				    else *sh = ch2;
				//printf("%c", ch2);
			*c3 = 0;//清理特效像素
			if (*ui == 2);
			else
			{
				*sh = *ui, *ui = 2;
			}
		}
		sh += 79;//指针的补位
		ui += 79;//对话界面补位
	}
	for (register int ps = &dx[1][0][0] + 5000000, *s = &dx[1][0][0];s < ps;*(s++) = 0);//清理整个逻辑层的动态像素
	
	
}

void tablevise(char *txt, char*sh, int y, int x, int tim)
{
	if (y < 0 || x < 0 || x>32 || y>32) return 0;
	else
		sh += 32 * y + x;
	for (;*txt != '\0';txt++, sh++)
	{
		if (*sh == '\n' || *sh == '\0') break;
		else
			*sh = *txt;
	}

}

void tabledit/*编辑显示内容*/(char *txt, char*sh, int y, int x, int tim,...)
{
	if (y < 0 || x < 0 ) return 0;//防出界
	else
		sh += 100 * y + x;//确定文字插入起点
	char model[65] = { 0 };
	for (int times=0,*o=&tim;*txt != '\0';txt++, sh++)
	{
		if (*txt == '%')
		{
			switch (*(txt + 1))
			{
			case 'd':
			{times++;
				int model2[12] = {0};
				if (*o < 0) { *o = 0; }
				xxmathtoolxx(*(o+times), &model2);
				
				int b;
				for (int a = 0;a < 12;)
					if (model2[a++] == 0 && model2[a] == 0)
					{
						a -= 2;b = a;
						while(a >= 0)
							model[b - a] = model2[a--];
						
						break;
					}
				if (b)
				{
					txt += 2;
					for (int c = 0;c<=b;)
					{
						*sh++ = model[c++] ;
					}

				
				}
				else {
					txt += 1;
					for (int c = 0;c<b;)
					{
						*sh++ = model[c++];
					}
					


				}
				
				//*sh++;

			}
			
			break;
			}
		}
		if (*sh == '\n' || *sh == '\0') break;
		else
			
			*sh = *txt;
	}
}

//主屏幕编辑显示内容
void watce(char *txt,char*sh,int y, int x,int tim)
{
	if (y < 0 || x < 0 || x>200||y>32) return 0;
	else
	sh += 200 * y + x;
	for (;*txt != '\0';txt++,sh++)
	{
		if (*sh == '\n'|| *sh == '\0') break;
		else
			*sh=*txt;

	}
}

//xend为插入终地址,x为起始地址
void invboard(char*sh, int y, int x, int xend)
{

	short int numb = xend - x;
	if (numb>0)
	{
		sh += 200 * y + x;
		*sh++ = '|';
		for (int a = 1; a < numb;sh++, a++)
		{
			*sh = ' ';
		}

	}
}

void BOX(int x1, int y1, int e)
{
	if (box[room] == 0) {
		x1 = x1 + 30 + 30;
		int a = 0, b = 0;
		if (e == 0)
		{
			y1 = 600 - y1;

			dx[0][y1][x1] = 箱;
			dx[0][y1][x1 + 1] = 箱;
			dx[0][y1][x1 + 2] = 箱;
			dx[0][y1][x1 - 1] = 箱;
			dx[0][y1][x1 - 2] = 箱;
			dx[0][y1][x1 + 3] = 箱;
			dx[0][y1][x1 - 3] = 箱;
			y1--;
			dx[0][y1][x1] = 箱;

			dx[0][y1][x1 + 2] = 箱;

			dx[0][y1][x1 - 2] = 箱;
			dx[0][y1][x1 + 3] = 箱;
			dx[0][y1][x1 - 3] = 箱;
			y1--;
			dx[0][y1][x1] = 箱;
			dx[0][y1][x1 + 1] = 箱;
			dx[0][y1][x1 + 2] = 箱;
			dx[0][y1][x1 - 1] = 箱;
			dx[0][y1][x1 - 2] = 箱;
			dx[0][y1][x1 + 3] = 箱;
			dx[0][y1][x1 - 3] = 箱;
			y1--;
			dx[0][y1][x1] = 箱;
			dx[0][y1][x1 + 1] = 箱;
			dx[0][y1][x1 - 1] = 箱;
		}

		else {
			printf("\n\n\n\n\n\n");
			switch (room)
			{
			case 0: printf("\n\n\n                                                     获得 尚方EX龟速宝剑-----按住j键使用（按空格继续游戏）");break;
			case 1: printf("\n\n\n                                                     获得 100金币（按空格继续游戏）                       ");m1 += 50;break;
				/*case 1: printf("\n\n\n                                                     获得 %s（按回车继续游戏）");break;
				case 1: printf("\n\n\n                                                     获得 %s（按回车继续游戏）");break;
				case 1: printf("\n\n\n                                                     获得 %s（按回车继续游戏）");break;
				case 1: printf("\n\n\n                                                     获得 %s（按回车继续游戏）");break;
				case 1: printf("\n\n\n                                                     获得 %s（按回车继续游戏）");break;
				case 1: printf("\n\n\n                                                     获得 %s（按回车继续游戏）");break;
				*/
			}


			for (a = 5;a < 12;a++)
			{
				for (b = 0;b < 8;b++)
				{
					if (dx[0][y + a][x + b] == 箱)dx[0][y + a][x + b] = 空;//搜索箱子
				}
				for (;b > 0;b--)
				{
					if (dx[0][y + a][x - b] == 箱) { dx[0][y + a][x - b] = 空; }//将用过的箱子图形去除
				}
				box[room] = 已探索;
			}

			一直循环
			{
				延迟(40);
				if (GetKeyState(32) < 0) { break; }//a

			}system("cls");
		}
	}

}

void 人物操作(int ha)
{
	if (ha) { ax = 0;V1 = 0;V2 = 0; }
	else {
		A键按下{ ax = 0; ax = ax - 4;if (ax <= -12)ax = -12;if (V1 > 0)V1/=2;con = -1;if (act1 == 0)act1 = 1; }//a
		D键按下{ ax = 0;ax = ax + 4;if (ax >= 12)ax = 12;if (V1 < 0)V1/=2; con = 1;if (act1 == 0)act1 = 1; }//d
		W键按下{ if (keyhit[87] == 0 && f == 1 && room != 10000) { y = y - 2;Vy1 -= 4; keyhit[87] = 1; } }//w
			else { keyhit[87] = 0; }
		J键按下{ keyhit[74] = 1;if (act1 == 0)act1 = 1;if (act3 < 3)ax = 0;act3++;if (act3 > 190)act3 = 0; }//j
						else {
						if (act1 == 7)act1 = 1;
						if (keyhit[74] > 0)
						{


							/*蓄力剑伤害结算函数*/
							for (a = 20;a < 1000;a++)
							{
								if (dhurt[a] > 0)
								{
									switch (dhurt[a])
									{
									case 1:dhurt[a] = 0;
										for (c = 0;c < 2 * bladehurt;c++) //bladehurt蓄力剑攻击伤害
										{
											if (i[a] > 1) { i[a]--; nice[a] = -1; }
											else break;
										}break;
									}
								}
							}
							/*蓄力剑伤害结算函数*/



							keyhit[74] = 0;
							if (act3 < 5)
							{
								act3 = 150;

							}
						}
						else act3 = 0;
						}
						S键按下{ if (act1 == 0)act1 = 1;keyhit[83] = 1;V1 = 0;V2 = 0;ax = 0;
						}
						else { if (f == 1 && keyhit[83] == 1) { keyhit[83] = 0; sit = 1; } }//s
						K键按下{ keyhit[75] = 1;keyhit[75] = 0;shootgun = 1;ax = 0;ay = 0;V1 = 0;V2 = 0; }
						else if (keyhit[75] > 0) { keyhit[75] = 0;shootgun = 0; }//k

	}
	if (act1 == 7) { ax = 0;V1 = 0; }//当动作是蓄力斩时，主角无法移动
}

/*if (_kbhit()){
						act1 = 1;switch (_getch()) {
						case'a': {if (act2 == 0 && V2 > -2)x--;if (d[y + 4][x - 3] == 3 || d[y + 8][x - 3] == 3 || d[y + 8][x - 2] == 3)x++; ax = 0; ax = ax - 6;if (ax <= -12)ax = -12;con = -1;act3 = 0;break;}
						case'd': { if (act2 == 0 && V2 < 2)x++;if (d[y + 4][x + 3] == 3 || d[y + 8][x + 3] == 3 || d[y + 8][x + 2] == 3)x--;ax = 0;ax = ax + 6;if (ax >= 12)ax = 12; con = 1;act3 = 0;break;}
						case's':if (f == 1) { V1 = 0;V2 = 0;ax = 0;sit = 1;break; }
						case'w': { if (f == 1 && room != 10000)y = y - 8; }break;
						case'j': { ax = 0;act3++;break;}
						case'1': meun = 1;break;
						case'2':meun = 2;break;
						case'3':meun = 3;break;
						case'4':meun = 4;break;
						case'5':meun = 5;break;
						case'6':meun = 6;break;
						case'7':meun = 7;break;
						case'8':meun = 8;break;
						case'9':meun = 9;break;
						case'0':meun = 0;break;
						case'x':y = 0;break;
						case'\n':meun = '*';break;
						case'k':shootgun = 1;ax = 0;ay = 0;V1 = 0;V2 = 0;break;
						case 0x1b:table = 1;goto contable;break;

						}
					}
					else { act1 = 0;ax = 0;act3 = 0;sit = 0;meun = 168; }*/

void gamesave() {}

void 切图后重置 {
	mop[room] = 0;//每次返回任务重置数据点
			down = 0;//下屏刷新初始化
			talktime = 0;
			eit=0;
			trad = 0;
			hdso = 0;
			vill = 0;
			j2 = j4;
			//****************
			//*切图后重置怪物*
			//****************
			for (b = 1;b < 100;b++)
				for (a = 0;a < 100;a++)
				{
					if (monst[b][a] > 0)
					{
						monst[b][a] = 0;
					}
					if (die[a] == 1)die[a] = 2;
				}
			//****************
			//*切图后重置怪物*
			//****************
			for (b = 1;b < 50;b++)
				for (a = 0;a < 50;a++)
				{
					if (visual[b][a] > 0)
					{
						visual[b][a] = 0;
					}
					
				}
			//******
			//*清屏*
			//******
			for (a = 0;a < 1000;a++)
				for (b = 0;b < 5000;b++)
				{
					dx[0][a][b] = 0;
					dx[1][a][b] = 0;
					dx[2][a][b] = 0;
				}
			//******
			//*清屏*
			//******
			talktime = 0;
			dieword = 0;



			o2 = 0;//每次场景更换后对话刷新的标志
			talk = 0;//更换场景后面板刷新
			//任务，场景
}

void stcard(int xs, int ys, int large, int agree, int id)
{
	int a, b, magic, attack, live;

	switch (id)
	{
	case 1: magic = 4;live = 5;attack = 3;break;

	}

	if (agree == 0)
	{
		if (large == 0)
		{
			for (a = 0;a < 12;a++)
			{
				st[ys - 6][xs - 6 + a] = '+';
				st[ys + 6][xs - 6 + a] = '+';
				for (b = 0;b < 11;b++)
					st[ys - 5 + b][xs - 6 + a] = 0;
			}
			for (b = 0;b < 13;b++)
			{
				st[ys - 6 + b][xs + 6] = '+';
				st[ys - 6 + b][xs - 6] = '+';
			}
			st[ys - 4][xs - 4] = magic;
			st[ys + 4][xs + 4] = live;
			st[ys + 4][xs - 4] = attack;
		}
		else
		{
			for (a = 0;a < 20;a++)
			{
				st[ys - 8][xs - 10 + a] = '+';
				st[ys + 8][xs - 10 + a] = '+';
				for (b = 0;b < 14;b++)
					st[ys - 7 + b][xs - 10 + a] = 0;
			}
			for (b = 0;b < 16;b++)
			{
				st[ys - 8 + b][xs + 10] = '+';
				st[ys - 8 + b][xs - 10] = '+';
			}
			st[ys - 6][xs - 6] = magic;
			st[ys + 6][xs + 6] = live;
			st[ys + 6][xs - 6] = attack;
		}
	}
	else
	{
		if (large == 0)
		{
			for (a = 0;a < 12;a++)
			{
				st[ys - 6][xs - 6 + a] = '+';
				st[ys + 6][xs - 6 + a] = '+';
				for (b = 0;b < 11;b++)
					st[ys - 5 + b][xs - 6 + a] = '0';
			}
			for (b = 0;b < 13;b++)
			{
				st[ys - 6 + b][xs + 6] = '+';
				st[ys - 6 + b][xs - 6] = '+';
			}
		}
		else {}
	}
}

void instickword() {
	if (dieword > 0)
	{
		if (dieword == 24)
		{
			talktime++;
			printf("#######################################################################################################################################################################\n");

			if (talktime > 0)
			{
				printf("                                 年轻人。。。。。（大喘气）                                                           \n");
				nice[24] = 0;
			}//
			if (talktime > 5 * 12) {
				printf("                                 我承认你很厉害                                                           \n");
				nice[24] = 0;
			}//
			if (talktime > 10 * 12)printf("                                 做人留一线，事后好相见                                                           \n");//printf("\n");得饶人处且饶人啊
			if (talktime > 15 * 12)printf("                                 得饶人处且饶人啊                                                           \n");//printf("\n");
			printf("#######################################################################################################################################################################\n");
			if (talktime > 20 * 12) { talktime = 0;dieword = 0;system("cls"); }

		}
		if (dieword == 9000)
		{
			talktime++;
			printf("#######################################################################################################################################################################\n");

			if (talktime > 0)
			{
				printf("                                 md你打我干蛤？！                                                           \n");
				printf("#######################################################################################################################################################################\n");
			}//



			if (talktime > 20 * 12) { talktime = 0;dieword = 0;system("cls"); }

		}

	}
}

void tachi()
{
	int a, b;
	//结界
	if (tacx < 6)tacx = 7;
	if (tacx > 14)tacx = 13;
	if (tacy < 3)tacy = 4;
	if (tacy > 30)tacy = 29;
	//结界
		//建模
	switch (age)
	{
	case 0:
		tac[tacy][tacx] = '-';tac[tacy][tacx + 1] = '+';tac[tacy][tacx - 1] = '+';
		tac[tacy + 1][tacx] = '-';tac[tacy + 1][tacx + 1] = '+';tac[tacy + 1][tacx - 1] = '+';
		break;

	case 1:
		tac[tacy][tacx] = '^';tac[tacy][tacx + 1] = '~';
		tac[tacy][tacx - 1] = '~';tac[tacy][tacx + 2] = '/';tac[tacy][tacx - 2] = '\\';
		tac[tacy + 1][tacx + 1] = '^';tac[tacy + 1][tacx - 1] = '^';

		break;
	}

}

int talkf(int a, int b)//第一个数是起点第二个是终点 
{   
    #define ti 30
	unsigned int c, e = 0, page = 0;
	short x=0, y=2;
	if (talktime >= ((b - a)) * ti + 1) { talktime = ((b - a)) * ti + 1;eit=1; }
	else { talktime++;eit = 0; }

	c = talktime / ti;
	while (c >=6) { a += 6;c -= 6;page++; }//每五句话翻页
	if (b >= a + c) 
	{
		b = a + c;
		watce("_______________________________________________________________________",deliver,y,x,-1);
		int d = 0;
		for (;b >= a;a++, d++) {
			watce("|", deliver, y + 1 + d, x,-1);
			watce("|", deliver, y + 1 + d, x+71,-1);
			watce( talkmood[a],deliver,y+1+d,x+1,1);
			
			/*switch (70-strlen(talkmood[a]))
			{
			case 0:printf("|\n");break;
			case 1:printf(" |\n");break;
			case 2:printf("  |\n");break;
			case 3:printf("   |\n");break;
			case 4:printf("    |\n");break;
			case 5:printf("     |\n");break;
			case 6:printf("      |\n");break;
			case 7:printf("       |\n");break;
			case 8:printf("        |\n");break;
			case 9:printf("         |\n");break;
			case 10:printf("          |\n");break;
			case 11:printf("           |\n");break;
			case 12:printf("            |\n");break;
			case 13:printf("             |\n");break;
			case 14:printf("              |\n");break;
			case 15:printf("               |\n");break;
			case 16:printf("                |\n");break;
			case 17:printf("                 |\n");break;
			case 18:printf("                  |\n");break;
			case 19:printf("                   |\n");break;
			case 20:printf("                    |\n");break;
			case 21:printf("                     |\n");break;
			case 22:printf("                      |\n");break;
			case 23:printf("                       |\n");break;
			case 24:printf("                        |\n");break;
			case 25:printf("                         |\n");break;
			case 26:printf("                          |\n");break;
			case 27:printf("                           |\n");break;
			case 28:printf("                            |\n");break;
			case 29:printf("                             |\n");break;
			case 30:printf("                              |\n");break;
			case 31:printf("                               |\n");break;
			case 32:printf("                                |\n");break;
			case 33:printf("                                 |\n");break;
			case 34:printf("                                  |\n");break;
			case 35:printf("                                   |\n");break;
			case 36:printf("                                    |\n");break;
			case 37:printf("                                     |\n");break;
			case 38:printf("                                      |\n");break;
			case 39:printf("                                       |\n");break;
			case 40:printf("                                        |\n");break;
			case 41:printf("                                         |\n");break;
			case 42:printf("                                          |\n");break;
			case 43:printf("                                           |\n");break;
			case 44:printf("                                            |\n");break;
			case 45:printf("                                             |\n");break;
			case 46:printf("                                              |\n");break;
			case 47:printf("                                               |\n");break;
			case 48:printf("                                                |\n");break;
			case 49:printf("                                                 |\n");break;
			case 50:printf("                                                  |\n");break;
			case 51:printf("                                                   |\n");break;
			case 52:printf("                                                    |\n");break;
			case 53:printf("                                                     |\n");break;
			case 54:printf("                                                      |\n");break;
			case 55:printf("                                                       |\n");break;
			case 56:printf("                                                        |\n");break;
			case 57:printf("                                                         |\n");break;
			case 58:printf("                                                          |\n");break;
			case 59:printf("                                                           |\n");break;
			case 60:printf("                                                            |\n");break;
			case 61:printf("                                                             |\n");break;
			case 62:printf("                                                              |\n");break;
			case 63:printf("                                                               |\n");break;
			case 64:printf("                                                                |\n");break;
			case 65:printf("                                                                 |\n");break;
			case 66:printf("                                                                  |\n");break;
			case 67:printf("                                                                   |\n");break;
			case 68:printf("                                                                    |\n");break;
			case 69:printf("                                                                     |\n");break;
			case 70:printf("                                                                      |\n");break;
			}*/
			
		}
		//strlen(a);记录字符串a长度的函数
		
		for(int e=6-d;e>0;e--)
		watce("|                                                                      |", deliver, y + 2 + 5-e, x,-1);
		watce("|______________________________________________________________________|",deliver, y + 7, x,-1);
	}
	return eit;//对话结束的完成符
}

void pad(int x1, int y1, int xd2, int yd2, int xb3, int yb3, int e) {
	//************************
	//*x1,y1为按钮坐标       *
	//*xd2,yd2为可动门坐标   *
	//*xb3,yb3为箱子初始坐标 *
	//************************
	if (boxid[e] == 0) { xb3 += 60;yb3 = 600 - yb3;boxid[e] = 1;xbox[e] = xb3;ybox[e] = yb3; }
	unsigned int xb, yb, a, b, vb2;
	xb = xbox[e];yb = ybox[e];
	y1 = 600 - y1;x1 = x1 + 30 + 30;yd2 = 600 - yd2;xd2 += 60;
	if (dx[0][yb + 5][xb] != 2 && dx[0][yb + 5][xb + 1] != 2 && dx[0][yb + 5][xb - 1] != 2)
	{

		if (ab[e] <= 2) { ab[e] += 0.5; }
		if (vb[e] < 8)vb[e] = vb[e] + ab[e];
		vb2 = vb[e];

		for (a = 0;a < vb2;a++)//下落检测
		{
			ybox[e]++;
			if (dx[0][ybox[e] + 5][xb] == 2 || dx[0][ybox[e] + 5][xb + 1] == 2 || dx[0][ybox[e] + 5][xb - 1] == 3|| dx[0][ybox[e] + 5][xb] == 3 || dx[0][ybox[e] + 5][xb + 1] == 3 || dx[0][ybox[e] + 5][xb - 1] == 3)
			{
				ab[e] = 0;vb[e] = 0;vb2 = 0;break;
			}
		}





	}

	if ((y1 - ybox[e] == 4) && ((xbox[e] < x1 &&x1 - xbox[e] < 10) || (xbox[e] < x1 &&xbox[e] - x1 < 5)))ybox[e]--;
	//如果箱子碰到按钮


	if ((ybox[e] > y&& ybox[e] - y <= 8) || (y > ybox[e] && y - ybox[e] < 4))//如果人碰到箱子
	{
		if (dx[0][ybox[e]][xbox[e] - 1] == 3 || dx[0][ybox[e] + 4][xbox[e] - 1] == 3 || dx[0][ybox[e]][xbox[e] + 10] == 3 || dx[0][ybox[e] + 4][xbox[e] + 10] == 3)
		{
			if (dx[0][ybox[e] + 1][xbox[e] - 1] == 1 && dx[0][ybox[e] + 4][xbox[e] - 1] != 1 && ybox[e] - y > 4)xbox[e] += 2;
			if (dx[0][ybox[e] + 1][xbox[e] + 10] == 1 && dx[0][ybox[e] + 4][xbox[e] + 10] != 1 && ybox[e] - y > 4)xbox[e] -= 2;
		}//防止箱子出轨
		else
			if (x + 3 == xbox[e]) { if (con > 0)xbox[e]++; }
			else if (x - 12 == xbox[e]) { if (con < 0)xbox[e]--; }
			else if (x - 11 == xbox[e]) { if (con < 0)xbox[e] -= 2; }
			else if (x + 2 == xbox[e]) { if (con > 0)xbox[e] += 2; }
	}//如果人碰到箱子
	if(dx[1][yb+0][xb+0]==0)dx[1][yb+0][xb+0]=1;if(dx[1][yb+0][xb+1]==0)dx[1][yb+0][xb+1]=1;if(dx[1][yb+0][xb+2]==0)dx[1][yb+0][xb+2]=1;if(dx[1][yb+0][xb+3]==0)dx[1][yb+0][xb+3]=1;if(dx[1][yb+0][xb+4]==0)dx[1][yb+0][xb+4]=1;if(dx[1][yb+0][xb+5]==0)dx[1][yb+0][xb+5]=1;if(dx[1][yb+0][xb+6]==0)dx[1][yb+0][xb+6]=1;if(dx[1][yb+0][xb+7]==0)dx[1][yb+0][xb+7]=1;if(dx[1][yb+0][xb+8]==0)dx[1][yb+0][xb+8]=1;
    if(dx[1][yb+0][xb+9]==0)dx[1][yb+0][xb+9]=1;if(dx[1][yb+1][xb+0]==0)dx[1][yb+1][xb+0]=1;if(dx[1][yb+1][xb+1]==0)dx[1][yb+1][xb+1]=1;if(dx[1][yb+1][xb+2]==0)dx[1][yb+1][xb+2]=1;if(dx[1][yb+1][xb+4]==0)dx[1][yb+1][xb+4]=1;if(dx[1][yb+1][xb+5]==0)dx[1][yb+1][xb+5]=1;if(dx[1][yb+1][xb+7]==0)dx[1][yb+1][xb+7]=1;if(dx[1][yb+1][xb+8]==0)dx[1][yb+1][xb+8]=1;if(dx[1][yb+1][xb+9]==0)dx[1][yb+1][xb+9]=1;
    if(dx[1][yb+2][xb+0]==0)dx[1][yb+2][xb+0]=1;if(dx[1][yb+2][xb+1]==0)dx[1][yb+2][xb+1]=1;if(dx[1][yb+2][xb+2]==0)dx[1][yb+2][xb+2]=1;if(dx[1][yb+2][xb+4]==0)dx[1][yb+2][xb+4]=1;if(dx[1][yb+2][xb+5]==0)dx[1][yb+2][xb+5]=1;if(dx[1][yb+2][xb+7]==0)dx[1][yb+2][xb+7]=1;if(dx[1][yb+2][xb+8]==0)dx[1][yb+2][xb+8]=1;if(dx[1][yb+2][xb+9]==0)dx[1][yb+2][xb+9]=1;if(dx[1][yb+3][xb+0]==0)dx[1][yb+3][xb+0]=1;
    if(dx[1][yb+3][xb+1]==0)dx[1][yb+3][xb+1]=1;if(dx[1][yb+3][xb+2]==0)dx[1][yb+3][xb+2]=1;if(dx[1][yb+3][xb+4]==0)dx[1][yb+3][xb+4]=1;if(dx[1][yb+3][xb+5]==0)dx[1][yb+3][xb+5]=1;if(dx[1][yb+3][xb+7]==0)dx[1][yb+3][xb+7]=1;if(dx[1][yb+3][xb+8]==0)dx[1][yb+3][xb+8]=1;if(dx[1][yb+3][xb+9]==0)dx[1][yb+3][xb+9]=1;if(dx[1][yb+4][xb+0]==0)dx[1][yb+4][xb+0]=1;if(dx[1][yb+4][xb+1]==0)dx[1][yb+4][xb+1]=1;
    if(dx[1][yb+4][xb+2]==0)dx[1][yb+4][xb+2]=1;if(dx[1][yb+4][xb+3]==0)dx[1][yb+4][xb+3]=1;if(dx[1][yb+4][xb+4]==0)dx[1][yb+4][xb+4]=1;if(dx[1][yb+4][xb+5]==0)dx[1][yb+4][xb+5]=1;if(dx[1][yb+4][xb+6]==0)dx[1][yb+4][xb+6]=1;if(dx[1][yb+4][xb+7]==0)dx[1][yb+4][xb+7]=1;if(dx[1][yb+4][xb+8]==0)dx[1][yb+4][xb+8]=1;if(dx[1][yb+4][xb+9]==0)dx[1][yb+4][xb+9]=1;


	if ((dx[1][y1 - 2][x1] != 0) || (dx[1][y1 - 2][x1 + 2] != 0) || (dx[0][y1 - 2][x1 + 4] != 0) || (dx[0][y1 - 2][x1 + 1] != 0)|| (dx[0][y1 - 2][x1] != 0) || (dx[0][y1 - 2][x1 + 2] != 0) || (dx[0][y1 - 2][x1 + 4] != 0) || (dx[0][y1 - 2][x1 + 1] != 0)) //如果按钮上有东西，触发机关
	{
		for (a = 0;a < 5;a++) { if (dx[0][y1][x1 + a] == 0)dx[0][y1][x1 + a] = 2; }//按钮的图形显示
		for (a = 1;a < 4;a++) { if (dx[0][y1 - 1][x1 + a] == 2)dx[0][y1 - 1][x1 + a] = 0; }//按钮的图形被按下
		dx[0][yd2][xd2] = 0;
		dx[0][yd2 - 1][xd2] = 0;
		dx[0][yd2 - 2][xd2] = 0;dx[0][yd2 - 2][xd2 + 1] = 0;dx[0][yd2 - 2][xd2 - 1] = 0;
		dx[0][yd2 - 3][xd2] = 0;
		dx[0][yd2 - 4][xd2] = 0;dx[0][yd2 - 4][xd2 + 1] = 0;dx[0][yd2 - 4][xd2 - 1] = 0;
		dx[0][yd2 - 5][xd2] = 0;
		dx[0][yd2 - 6][xd2] = 0;dx[0][yd2 - 6][xd2 + 1] = 0;dx[0][yd2 - 6][xd2 - 1] = 0;
		dx[0][yd2 - 7][xd2] = 0;
		dx[0][yd2 - 8][xd2] = 0;dx[0][yd2 - 8][xd2 + 1] = 0;dx[0][yd2 - 8][xd2 - 1] = 0;
		dx[0][yd2 - 9][xd2] = 0;
	}
	else {
		dx[0][yd2][xd2] = 3;
		dx[0][yd2 - 1][xd2] = 3;
		dx[0][yd2 - 2][xd2] = 3;dx[0][yd2 - 2][xd2 + 1] = 3;dx[0][yd2 - 2][xd2 - 1] = 3;
		dx[0][yd2 - 3][xd2] = 3;
		dx[0][yd2 - 4][xd2] = 3;dx[0][yd2 - 4][xd2 + 1] = 3;dx[0][yd2 - 4][xd2 - 1] = 3;
		dx[0][yd2 - 5][xd2] = 3;
		dx[0][yd2 - 6][xd2] = 3;dx[0][yd2 - 6][xd2 + 1] = 3;dx[0][yd2 - 6][xd2 - 1] = 3;
		dx[0][yd2 - 7][xd2] = 3;
		dx[0][yd2 - 8][xd2] = 3;dx[0][yd2 - 8][xd2 + 1] = 3;dx[0][yd2 - 8][xd2 - 1] = 3;
		dx[0][yd2 - 9][xd2] = 3;
		for (a = 0;a < 5;a++) { if (dx[0][y1][x1 + a] == 0)dx[0][y1][x1 + a] = 2; }//按钮的图形显示
		for (a = 1;a < 4;a++) { if (dx[0][y1 - 1][x1 + a] == 0)dx[0][y1 - 1][x1 + a] = 2; }//按钮的图形显示
	}






}

void dicr(int x1, int y1)
{
	x1 = x1 + 30 + 30;
	int a, b;
	y1 = 600 - y1;

	for (a = 0;a < 2;a++) { dx[0][y1 - 3][x1 - a] = 背景; }
	for (a = 1;a < 5;a++) { dx[0][y1 - 3][x1 + a] = 背景; }
	for (a = 0;a < 6;a++) { dx[0][y1 - 4][x1 - a] = 背景; }
	for (a = 1;a < 6;a++) { dx[0][y1 - 4][x1 + a] = 背景; }
	for (a = 1;a < 7;a++) { dx[0][y1 - 5][x1 + a] = 背景; }
	for (a = 0;a < 6;a++) { dx[0][y1 - 6][x1 - a] = 背景; }
	for (a = 1;a < 6;a++) { dx[0][y1 - 6][x1 + a] = 背景; }
	for (a = 0;a < 2;a++) { dx[0][y1 - 7][x1 - a] = 背景; }
	for (a = 1;a < 5;a++) { dx[0][y1 - 7][x1 + a] = 背景; }
}

void chac(int l,int clear)
{
	int Ay;
	if (clear == 0) {
		if (act1 < 5)
		{
			Ay = 0;
			if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;
			if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;
			if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;
			Ay++;
			if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;
			if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;
			if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;
			Ay++;
			//2

			if (act1 == 1 || act1 == 0) { if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1; }

			else if (act1 == 3) { if (dx[1][y + Ay][x + 4] == 0) dx[1][y + Ay][x + 4] = 1;if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1; }

			else if (act1 == 4) {
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;
			}
			Ay++;//3        if(dx[1][y + Ay][x]==0)
			if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;
			if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;
			if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;
			if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;
			if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;

			if (act1 == 3)
			{
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;
			}
			else     if (act1 == 4)
			{
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;
			}
			Ay++;//4
			if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;
			if (act1 == 1 || act1 == 0) {
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;
			}
			Ay++;//5
			if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;
			if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;
			if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;
			Ay++;//6

			if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;
			if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;
			Ay++;//6

			if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;
			if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;
			Ay++;//7

			if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;
			if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//8
		}
		if (act3 > 0) {
			acttime[1] = 8;

			if (act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++)//15

			{

				if (l == 1) {
					Ay = 1;//
					Ay++;//

					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//-3
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//}
				}
				else {
					Ay = 1;//
					Ay++;//

					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//-3
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//-2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;
				}
			}
			if (act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++)//19
			{
				act1 = 7;
				if (l == 1) {
					Ay = 1;//
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;//

					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//-3
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//}
				}
				else {
					Ay = 1;//
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;//

					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//-3
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//-2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//}
				}
			}
			if (act3 == acttime[1]++)//20
			{

				if (l == 1) {





					Ay = 1;
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//-5
					if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-5
					if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//-6
					if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-6
					if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;//-7
					if (dx[1][y + Ay][x - 7] == 0)dx[1][y + Ay][x - 7] = 1;//
				}
				else {

					Ay = 1;//
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-5
					if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-5
					if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//-6
					if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-6
					if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;//-7
					if (dx[1][y + Ay][x + 7] == 0)dx[1][y + Ay][x + 7] = 1;//
				}
			}
			if (act3 == acttime[1]++ || act3 == acttime[1]++)//22
			{

				if (l == 1) {

					Ay = 0;
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//5
					if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//5
					if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//6
					if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//6
					if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;//7
					if (dx[1][y + Ay][x + 7] == 0)dx[1][y + Ay][x + 7] = 1;//8
					if (dx[1][y + Ay][x + 8] == 0)dx[1][y + Ay][x + 8] = 1;//9
					if (dx[1][y + Ay][x + 9] == 0)dx[1][y + Ay][x + 9] = 1;//10
					if (dx[1][y + Ay][x + 10] == 0)dx[1][y + Ay][x + 10] = 1;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//9
					if (dx[1][y + Ay][x + 9] == 0)dx[1][y + Ay][x + 9] = 1;//10
					if (dx[1][y + Ay][x + 10] == 0)dx[1][y + Ay][x + 10] = 1;//11
					if (dx[1][y + Ay][x + 11] == 0)dx[1][y + Ay][x + 11] = 1;//Ay++;
					Ay++;// -2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//12
					if (dx[1][y + Ay][x + 12] == 0)dx[1][y + Ay][x + 12] = 1;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//
				}
				else {

					Ay = 0;
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//5
					if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//5
					if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//6
					if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x - 2] = 1;//6
					if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;//7
					if (dx[1][y + Ay][x - 7] == 0)dx[1][y + Ay][x - 7] = 1;//8
					if (dx[1][y + Ay][x - 8] == 0)dx[1][y + Ay][x - 8] = 1;//9
					if (dx[1][y + Ay][x - 9] == 0)dx[1][y + Ay][x - 9] = 1;//10
					if (dx[1][y + Ay][x - 10] == 0)dx[1][y + Ay][x - 10] = 1;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//9
					if (dx[1][y + Ay][x - 9] == 0)dx[1][y + Ay][x - 9] = 1;//10
					if (dx[1][y + Ay][x - 10] == 0)dx[1][y + Ay][x - 10] = 1;//11
					if (dx[1][y + Ay][x - 11] == 0)dx[1][y + Ay][x - 11] = 1;//Ay++;
					Ay++;// -2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//12
					if (dx[1][y + Ay][x - 12] == 0)dx[1][y + Ay][x - 12] = 1;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//
				}
			}
			if (act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++)//25
			{

				if (l == 1) {

					Ay = 0;
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//9
					if (dx[1][y + Ay][x + 10] == 0)dx[1][y + Ay][x + 10] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//8
					if (dx[1][y + Ay][x + 8] == 0)dx[1][y + Ay][x + 8] = 1;//7
					if (dx[1][y + Ay][x + 7] == 0)dx[1][y + Ay][x + 7] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//7
					if (dx[1][y + Ay][x + 7] == 0)dx[1][y + Ay][x + 7] = 1;//6
					if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;//5
					if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
					if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//5
					if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
					if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//
				}
				else {

					Ay = 0;
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//9
					if (dx[1][y + Ay][x - 10] == 0)dx[1][y + Ay][x - 10] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//8
					if (dx[1][y + Ay][x - 8] == 0)dx[1][y + Ay][x - 8] = 1;//7
					if (dx[1][y + Ay][x - 7] == 0)dx[1][y + Ay][x - 7] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//7
					if (dx[1][y + Ay][x - 7] == 0)dx[1][y + Ay][x - 7] = 1;//6
					if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;//5
					if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//4
					if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//5
					if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
					if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
					if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
					if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//
				}

			}
		}
	}
	//——————————————————————————————————————————————————————————————————————————————
	else {
		if (act1 < 5)
		{
			Ay = 0;
			if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;
			if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;
			if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;
			Ay++;
			if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;
			if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;
			if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;
			Ay++;
			//2

			if (act1 == 1 || act1 == 0) { if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0; }

			else if (act1 == 3) { if (dx[1][y + Ay][x + 4] == 1) dx[1][y + Ay][x + 4] = 0;if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0; }

			else if (act1 == 4) {
				if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;
				if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;
			}
			Ay++;//3        if(dx[1][y + Ay][x]==0)
			if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;
			if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;
			if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;
			if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;
			if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;

			if (act1 == 3)
			{
				if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;
				if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;
				if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;
				if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;
			}
			else     if (act1 == 4)
			{
				if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;
				if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;
				if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;
				if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;
			}
			Ay++;//4
			if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;
			if (act1 == 1 || act1 == 0) {
				if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;
				if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;
			}
			Ay++;//5
			if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;
			if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;
			if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;
			Ay++;//6

			if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;
			if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;
			Ay++;//6

			if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;
			if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;
			Ay++;//7

			if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;
			if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//8
		}
		if (act3 > 0) {
			acttime[1] = 8;

			if (act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++)//15

			{

				if (l == 1) {
					Ay = 1;//
					Ay++;//

					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					if (dx[1][y + Ay][x - 5] == 1)dx[1][y + Ay][x - 5] = 0;//-3
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//-4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//-4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//}
				}
				else {
					Ay = 1;//
					Ay++;//

					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					if (dx[1][y + Ay][x + 5] == 1)dx[1][y + Ay][x + 5] = 0;//-3
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//-3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//-2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//-4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;
				}
			}
			if (act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++)//19
			{
				act1 = 7;
				if (l == 1) {
					Ay = 1;//
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;//

					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					if (dx[1][y + Ay][x - 5] == 1)dx[1][y + Ay][x - 5] = 0;//-3
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//-4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//-4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//}
				}
				else {
					Ay = 1;//
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;//

					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					if (dx[1][y + Ay][x + 5] == 1)dx[1][y + Ay][x + 5] = 0;//-3
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//-3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//-2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//-4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//}
				}
			}
			if (act3 == acttime[1]++)//20
			{
				if (l == 1) {
					Ay = 1;
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//-4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//-5
					if (dx[1][y + Ay][x - 5] == 1)dx[1][y + Ay][x - 5] = 0;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//-5
					if (dx[1][y + Ay][x - 5] == 1)dx[1][y + Ay][x - 5] = 0;//-6
					if (dx[1][y + Ay][x - 6] == 1)dx[1][y + Ay][x - 6] = 0;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//-6
					if (dx[1][y + Ay][x - 6] == 1)dx[1][y + Ay][x - 6] = 0;//-7
					if (dx[1][y + Ay][x - 7] == 1)dx[1][y + Ay][x - 7] = 0;//
				}
				else {
					Ay = 1;//
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//-2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//-3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//-5
					if (dx[1][y + Ay][x + 5] == 1)dx[1][y + Ay][x + 5] = 0;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//-5
					if (dx[1][y + Ay][x + 5] == 1)dx[1][y + Ay][x + 5] = 0;//-6
					if (dx[1][y + Ay][x + 6] == 1)dx[1][y + Ay][x + 6] = 0;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//-6
					if (dx[1][y + Ay][x + 6] == 1)dx[1][y + Ay][x + 6] = 0;//-7
					if (dx[1][y + Ay][x + 7] == 1)dx[1][y + Ay][x + 7] = 0;//
				}
			}
			if (act3 == acttime[1]++ || act3 == acttime[1]++)//22
			{
				if (l == 1) {
					Ay = 0;
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//5
					if (dx[1][y + Ay][x + 5] == 1)dx[1][y + Ay][x + 5] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//5
					if (dx[1][y + Ay][x + 5] == 1)dx[1][y + Ay][x + 5] = 0;//6
					if (dx[1][y + Ay][x + 6] == 1)dx[1][y + Ay][x + 6] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//6
					if (dx[1][y + Ay][x + 6] == 1)dx[1][y + Ay][x + 6] = 0;//7
					if (dx[1][y + Ay][x + 7] == 1)dx[1][y + Ay][x + 7] = 0;//8
					if (dx[1][y + Ay][x + 8] == 1)dx[1][y + Ay][x + 8] = 0;//9
					if (dx[1][y + Ay][x + 9] == 1)dx[1][y + Ay][x + 9] = 0;//10
					if (dx[1][y + Ay][x + 10] == 1)dx[1][y + Ay][x + 10] = 0;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//9
					if (dx[1][y + Ay][x + 9] == 1)dx[1][y + Ay][x + 9] = 0;//10
					if (dx[1][y + Ay][x + 10] == 1)dx[1][y + Ay][x + 10] = 0;//11
					if (dx[1][y + Ay][x + 11] == 1)dx[1][y + Ay][x + 11] = 0;//Ay++;
					Ay++;// -2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//12
					if (dx[1][y + Ay][x + 12] == 1)dx[1][y + Ay][x + 12] = 0;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//
				}
				else {
					Ay = 0;
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//5
					if (dx[1][y + Ay][x - 5] == 1)dx[1][y + Ay][x - 5] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//5
					if (dx[1][y + Ay][x - 5] == 1)dx[1][y + Ay][x - 5] = 0;//6
					if (dx[1][y + Ay][x - 6] == 1)dx[1][y + Ay][x - 6] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x - 2] = 0;//6
					if (dx[1][y + Ay][x - 6] == 1)dx[1][y + Ay][x - 6] = 0;//7
					if (dx[1][y + Ay][x - 7] == 1)dx[1][y + Ay][x - 7] = 0;//8
					if (dx[1][y + Ay][x - 8] == 1)dx[1][y + Ay][x - 8] = 0;//9
					if (dx[1][y + Ay][x - 9] == 1)dx[1][y + Ay][x - 9] = 0;//10
					if (dx[1][y + Ay][x - 10] == 1)dx[1][y + Ay][x - 10] = 0;//Ay++;
					Ay++;// -1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//9
					if (dx[1][y + Ay][x - 9] == 1)dx[1][y + Ay][x - 9] = 0;//10
					if (dx[1][y + Ay][x - 10] == 1)dx[1][y + Ay][x - 10] = 0;//11
					if (dx[1][y + Ay][x - 11] == 1)dx[1][y + Ay][x - 11] = 0;//Ay++;
					Ay++;// -2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//12
					if (dx[1][y + Ay][x - 12] == 1)dx[1][y + Ay][x - 12] = 0;//Ay++;
					Ay++;// 3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//-3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//
				}
			}
			if (act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++)//25
			{

				if (l == 1) {

					Ay = 0;
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//9
					if (dx[1][y + Ay][x + 10] == 1)dx[1][y + Ay][x + 10] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//8
					if (dx[1][y + Ay][x + 8] == 1)dx[1][y + Ay][x + 8] = 0;//7
					if (dx[1][y + Ay][x + 7] == 1)dx[1][y + Ay][x + 7] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//7
					if (dx[1][y + Ay][x + 7] == 1)dx[1][y + Ay][x + 7] = 0;//6
					if (dx[1][y + Ay][x + 6] == 1)dx[1][y + Ay][x + 6] = 0;//5
					if (dx[1][y + Ay][x + 5] == 1)dx[1][y + Ay][x + 5] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//4
					if (dx[1][y + Ay][x + 4] == 1)dx[1][y + Ay][x + 4] = 0;//5
					if (dx[1][y + Ay][x + 5] == 1)dx[1][y + Ay][x + 5] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//3
					if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//
				}
				else {

					Ay = 0;
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//9
					if (dx[1][y + Ay][x - 10] == 1)dx[1][y + Ay][x - 10] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//8
					if (dx[1][y + Ay][x - 8] == 1)dx[1][y + Ay][x - 8] = 0;//7
					if (dx[1][y + Ay][x - 7] == 1)dx[1][y + Ay][x - 7] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//7
					if (dx[1][y + Ay][x - 7] == 1)dx[1][y + Ay][x - 7] = 0;//6
					if (dx[1][y + Ay][x - 6] == 1)dx[1][y + Ay][x - 6] = 0;//5
					if (dx[1][y + Ay][x - 5] == 1)dx[1][y + Ay][x - 5] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//4
					if (dx[1][y + Ay][x - 4] == 1)dx[1][y + Ay][x - 4] = 0;//5
					if (dx[1][y + Ay][x - 5] == 1)dx[1][y + Ay][x - 5] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-2
					if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;//3
					if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 0;//Ay++;
					Ay++;// 0
					if (dx[1][y + Ay][x] == 1)dx[1][y + Ay][x] = 0;//1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x + 1] == 1)dx[1][y + Ay][x + 1] = 0;//-1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//Ay++;
					Ay++;// 1
					if (dx[1][y + Ay][x - 1] == 1)dx[1][y + Ay][x - 1] = 0;//-2
					if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;//
				}

			}
		}
	}
}

void blade(int l)
{
	if (room != 10000)
	{
		int a, b, c = 0, e = 0, f = 0;
		char Ay = 0;
		//l就是con的局部变量

		if (cooldown[0] > 0)act3 = 0;
		if (act3 == 2 || act3 == 1)
		{
			if (l == 1 && dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;
			if (l == -1 && dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;
		}
		Ay++;
		//2

		if (act3 == 2 || act3 == 1||act3 == 3  )
		{
			if (l == 1 && dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;
			if (l == -1 && dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;
		}
		if (act3 == 150)
		{
			if (l == 1)
			{
				if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;
				if (dx[1][y + Ay][x + 7] == 0)dx[1][y + Ay][x + 7] = 1;
				if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;
				if (dx[1][y + Ay][x + 8] == 0)dx[1][y + Ay][x + 8] = 1;
				if (dx[1][y + Ay][x + 9] == 0)dx[1][y + Ay][x + 9] = 1;
			}
			if (l == -1)
			{

				if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;
				if (dx[1][y + Ay][x - 7] == 0)dx[1][y + Ay][x - 7] = 1;
				if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;
				if (dx[1][y + Ay][x - 8] == 0)dx[1][y + Ay][x - 8] = 1;
				if (dx[1][y + Ay][x - 9] == 0)dx[1][y + Ay][x - 9] = 1;
			}
		}
		Ay++;
		//3        if(dx[1][y + Ay][x]==0)

		if (act3 == 2 || act3 == 1 || act3 == 3)
		{
			if (l == 1 && dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;
			if (l == -1 && dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;
		}
		if (act3 == 150)
		{
			if (l == 1)
			{
				for (a = 6;a < 15;a++)
					if (dx[1][y + Ay][x + a] == 0)dx[1][y + Ay][x + a] = 1;


			}
			if (l == -1)
			{
				for (a = 6;a < 15;a++)
					if (dx[1][y + Ay][x - a] == 0)dx[1][y + Ay][x - a] = 1;


			}
		}


		Ay++;//4

		if (act3 == 2 || act3 == 1 || act3 == 3)
		{

			if (l == 1 && dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;
			if (l == -1 && dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;
		}

		if (act3 == 150)
		{
			if (l == 1)
			{
				for (a = 8;a < 17;a++)
					if (dx[1][y + Ay][x + a] == 0)dx[1][y + Ay][x + a] = 1;
				//if (dx[1][y + Ay][x + 12] == 0)dx[1][y + Ay][x + 12] = 1;

			}
			if (l == -1)
			{
				for (a = 8;a < 17;a++)
					if (dx[1][y + Ay][x - a] == 0)dx[1][y + Ay][x - a] = 1;
				//if (dx[1][y + Ay][x - 12] == 0)dx[1][y + Ay][x - 12] = 1;

			}
		}

		Ay++;//5
		if (act3 == 2 || act3 == 1 || act3 == 3)
		{
			if (l == 1)
			{
				if (dx[1][y + Ay][x + 2] == 1)dx[1][y + Ay][x + 2] = 0;
				if (dx[1][y + Ay][x + 3] == 1)dx[1][y + Ay][x + 3] = 1;
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;
			}
			if (l == -1)
			{
				if (dx[1][y + Ay][x - 2] == 1)dx[1][y + Ay][x - 2] = 0;
				if (dx[1][y + Ay][x - 3] == 1)dx[1][y + Ay][x - 3] = 1;
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;
			}
		}
		else if (act3 == 150)
		{


			if (l == 1)
			{
				for (a = 6;a < 15;a++)
					if (dx[1][y + Ay][x + a] == 0)dx[1][y + Ay][x + a] = 1;


			}
			if (l == -1)
			{
				for (a = 6;a < 15;a++)
					if (dx[1][y + Ay][x - a] == 0)dx[1][y + Ay][x - a] = 1;


			}

			Ay++;//6
			if (l == 1)
			{
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;
				if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;
				if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;
				if (dx[1][y + Ay][x + 7] == 0)dx[1][y + Ay][x + 7] = 1;
			}
			if (l == -1)
			{

				if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;
				if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;
				if (dx[1][y + Ay][x - 7] == 0)dx[1][y + Ay][x - 7] = 1;

			}

		}
		if (act3 == 150)//伤害判定
		{
			延迟(200);
			if (l == 1)//向右攻击
			{
				for (b = 2;b < 8;b++)//纵向范围
				{
					for (a = 0;a < 16;a++)//横向范围
					{
						if (dx[1][y + b][x + a] > 19 && i[dx[1][y + b][x + a]] != 0)
						{
							e = dx[1][y + b][x + a];//判定只造成一次伤害
							for (c = 0;c < bladehurt;c++) //bladehurt蓄力剑攻击伤害
							{
								if (i[e] > 1) { i[e]--; nice[e] = -1; }
								else break;
							}goto stophurt;//造成伤害后跳出伤害判定
						}//伤害函数 i[dx[1][y + b][x + a]]

					}
				}
			}
			if (l == -1)//向左攻击
			{
				for (b = 2;b < 8;b++)//纵向范围
				{
					for (a = 0;a < 16;a++)//横向范围
					{
						if (dx[1][y + b][x - a] > 19 && i[dx[1][y + b][x - a]] != 0)
						{
							e = dx[1][y + b][x - a];//判定只造成一次伤害
							for (c = 0;c < bladehurt;c++)//bladehurt蓄力剑攻击伤害
							{
								if (i[e] > 1)
								{
									i[e]--;nice[e] = -1;
								}
								else break;
							}goto stophurt;//造成伤害后跳出伤害判定
						}
					}if (f != i[e])break;
				}//伤害函数 i[dx[1][y - b][x - a]]
			}
		stophurt:;//停止伤害标志
		}
		if (act3 == 150)
		{
			act3 = 0;cooldown[0] = 8;
		}
		//平a结束
		acttime[1] = 8;
		if (act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++)//15
		{
			act1 = 7;
			if (l == 1) {
				Ay = 1;//
				Ay++;//

				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//-3
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
				Ay++;// -1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//Ay++;
				Ay++;// 3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//}
			}
			else {
				Ay = 1;//
				Ay++;//

				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//-3
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
				Ay++;// -1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//-2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;
			}
		}
		if (act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++)//19
		{
			act1 = 7;
			if (l == 1) {
				Ay = 1;//
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;//

				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//-3
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
				Ay++;// -1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//Ay++;
				Ay++;// 3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//}
			}
			else {
				Ay = 1;//
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;//

				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//-3
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
				Ay++;// -1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//-2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//}
			}
		}
		if (act3 == acttime[1]++)//20
		{
			act1 = 7;
			if (l == 1) {

				for (b = 0;b < 19;b++)
				{
					if (dx[0][y][x + 3] == 3 || dx[0][y + 2][x + 3] == 3 || dx[0][y + 4][x + 3] == 3 || dx[0][y + 8][x + 3] == 3)break;x++;
					for (a = -1;a < 9;a++)
					{
						if (dx[1][y + a][x + 5] >= 20) { dhurt[dx[1][y + a][x + 5]] = 1;break; }
					}//伤害判定
				}



				Ay = 1;
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//Ay++;
				Ay++;// 1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//-5
				if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//Ay++;
				Ay++;// 3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-5
				if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//-6
				if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;//Ay++;
				Ay++;// 3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-6
				if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;//-7
				if (dx[1][y + Ay][x - 7] == 0)dx[1][y + Ay][x - 7] = 1;//
			}
			else {
				for (b = 0;b < 19;b++)
				{
					if (dx[0][y][x - 3] == 3 || dx[0][y + 2][x - 3] == 3 || dx[0][y + 4][x - 3] == 3 || dx[0][y + 8][x - 3] == 3)break;x--;
					for (a = -1;a < 9;a++)
					{
						if (dx[1][y + a][x - 5] >= 20) { dhurt[dx[1][y + a][x - 5]] = 1;break; }
					}//伤害判定
				}
				Ay = 1;//
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//Ay++;
				Ay++;// 1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//-5
				if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//Ay++;
				Ay++;// 3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-5
				if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//-6
				if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;//Ay++;
				Ay++;// 3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//-6
				if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;//-7
				if (dx[1][y + Ay][x + 7] == 0)dx[1][y + Ay][x + 7] = 1;//
			}
		}
		if (act3 == acttime[1]++ || act3 == acttime[1]++)//22
		{
			act1 = 7;
			if (l == 1) {
				for (b = 0;b < 8;b++)
				{
					if (dx[0][y][x + 3] == 3 || dx[0][y + 2][x + 3] == 3 || dx[0][y + 4][x + 3] == 3 || dx[0][y + 8][x + 3] == 3)break;x++;
					for (a = -1;a < 9;a++)
					{
						if (dx[1][y + a][x + 9] >= 20) { dhurt[dx[1][y + a][x + 9]] = 1;break; }
					}//伤害判定
				}
				Ay = 0;
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//5
				if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//5
				if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//6
				if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//6
				if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;//7
				if (dx[1][y + Ay][x + 7] == 0)dx[1][y + Ay][x + 7] = 1;//8
				if (dx[1][y + Ay][x + 8] == 0)dx[1][y + Ay][x + 8] = 1;//9
				if (dx[1][y + Ay][x + 9] == 0)dx[1][y + Ay][x + 9] = 1;//10
				if (dx[1][y + Ay][x + 10] == 0)dx[1][y + Ay][x + 10] = 1;//Ay++;
				Ay++;// -1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//9
				if (dx[1][y + Ay][x + 9] == 0)dx[1][y + Ay][x + 9] = 1;//10
				if (dx[1][y + Ay][x + 10] == 0)dx[1][y + Ay][x + 10] = 1;//11
				if (dx[1][y + Ay][x + 11] == 0)dx[1][y + Ay][x + 11] = 1;//Ay++;
				Ay++;// -2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//12
				if (dx[1][y + Ay][x + 12] == 0)dx[1][y + Ay][x + 12] = 1;//Ay++;
				Ay++;// 3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//
			}
			else {
				for (b = 0;b < 8;b++)
				{
					if (dx[0][y][x - 3] == 3 || dx[0][y + 2][x - 3] == 3 || dx[0][y + 4][x - 3] == 3 || dx[0][y + 8][x - 3] == 3)break;x--;
					for (a = -1;a < 9;a++)
					{
						if (dx[1][y + a][x - 9] >= 20) { dhurt[dx[1][y + a][x - 9]] = 1;break; }
					}//伤害判定
				}
				Ay = 0;
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//5
				if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//5
				if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//6
				if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x - 2] = 1;//6
				if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;//7
				if (dx[1][y + Ay][x - 7] == 0)dx[1][y + Ay][x - 7] = 1;//8
				if (dx[1][y + Ay][x - 8] == 0)dx[1][y + Ay][x - 8] = 1;//9
				if (dx[1][y + Ay][x - 9] == 0)dx[1][y + Ay][x - 9] = 1;//10
				if (dx[1][y + Ay][x - 10] == 0)dx[1][y + Ay][x - 10] = 1;//Ay++;
				Ay++;// -1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//9
				if (dx[1][y + Ay][x - 9] == 0)dx[1][y + Ay][x - 9] = 1;//10
				if (dx[1][y + Ay][x - 10] == 0)dx[1][y + Ay][x - 10] = 1;//11
				if (dx[1][y + Ay][x - 11] == 0)dx[1][y + Ay][x - 11] = 1;//Ay++;
				Ay++;// -2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//12
				if (dx[1][y + Ay][x - 12] == 0)dx[1][y + Ay][x - 12] = 1;//Ay++;
				Ay++;// 3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//-3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//
			}
		}
		if (act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++ || act3 == acttime[1]++)//25
		{
			act1 = 7;
			if (l == 1) {
				for (b = 0;b < 2;b++)
				{
					if (dx[0][y][x + 3] == 3 || dx[0][y + 2][x + 3] == 3 || dx[0][y + 4][x + 3] == 3 || dx[0][y + 8][x + 3] == 3)break;x++;
					for (a = -1;a < 9;a++)
					{
						if (dx[1][y + a][x + 8] >= 20) { dhurt[dx[1][y + a][x + 8]] = 1;break; }
					}//伤害判定
				}
				Ay = 0;
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//9
				if (dx[1][y + Ay][x + 10] == 0)dx[1][y + Ay][x + 10] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//8
				if (dx[1][y + Ay][x + 8] == 0)dx[1][y + Ay][x + 8] = 1;//7
				if (dx[1][y + Ay][x + 7] == 0)dx[1][y + Ay][x + 7] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//7
				if (dx[1][y + Ay][x + 7] == 0)dx[1][y + Ay][x + 7] = 1;//6
				if (dx[1][y + Ay][x + 6] == 0)dx[1][y + Ay][x + 6] = 1;//5
				if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//4
				if (dx[1][y + Ay][x + 4] == 0)dx[1][y + Ay][x + 4] = 1;//5
				if (dx[1][y + Ay][x + 5] == 0)dx[1][y + Ay][x + 5] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
				if (dx[1][y + Ay][x + 3] == 0)dx[1][y + Ay][x + 3] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//
			}
			else {
				for (b = 0;b < 2;b++)
				{
					if (dx[0][y][x - 3] == 3 || dx[0][y + 2][x - 3] == 3 || dx[0][y + 4][x - 3] == 3 || dx[0][y + 8][x - 3] == 3)break;x--;
					for (a = -1;a < 9;a++)
					{
						if (dx[1][y + a][x - 8] >= 20) { dhurt[dx[1][y + a][x - 8]] = 1;break; }
					}//伤害判定
				}
				Ay = 0;
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//9
				if (dx[1][y + Ay][x - 10] == 0)dx[1][y + Ay][x - 10] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//8
				if (dx[1][y + Ay][x - 8] == 0)dx[1][y + Ay][x - 8] = 1;//7
				if (dx[1][y + Ay][x - 7] == 0)dx[1][y + Ay][x - 7] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//7
				if (dx[1][y + Ay][x - 7] == 0)dx[1][y + Ay][x - 7] = 1;//6
				if (dx[1][y + Ay][x - 6] == 0)dx[1][y + Ay][x - 6] = 1;//5
				if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//4
				if (dx[1][y + Ay][x - 4] == 0)dx[1][y + Ay][x - 4] = 1;//5
				if (dx[1][y + Ay][x - 5] == 0)dx[1][y + Ay][x - 5] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
				if (dx[1][y + Ay][x - 2] == 0)dx[1][y + Ay][x - 2] = 1;//3
				if (dx[1][y + Ay][x - 3] == 0)dx[1][y + Ay][x - 3] = 1;//Ay++;
				Ay++;// 0
				if (dx[1][y + Ay][x] == 0)dx[1][y + Ay][x] = 1;//1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 1
				if (dx[1][y + Ay][x + 1] == 0)dx[1][y + Ay][x + 1] = 1;//-1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//Ay++;
				Ay++;// 1
				if (dx[1][y + Ay][x - 1] == 0)dx[1][y + Ay][x - 1] = 1;//-2
				if (dx[1][y + Ay][x + 2] == 0)dx[1][y + Ay][x + 2] = 1;//
			}

		}
		if (act3 >= 33) {
			act3 = 0; act1 = 0; cooldown[0] = 10;
		}//防止误判

	}
}

float sina(int x1, int y1)
{
	int b;
	float all, c, d, e, f, g;
	c = x1;
	d = y1;
	x1 *= x1;
	y1 *= y1;
	e = x1 + y1;
	f = c + d;
	if (c > d) { for (b = c;b < f;b++) { all = b * b;if (e - all < 0)break; } }
	else { for (b = d;b < f;b++) { all = b * b;if (e - all < 0)break; } }
	g = c / b;//g需要定义为全局变量
}

void physicsengine(int e, int cas)
{
	switch (e) {
	case 0:

	{
		//摩擦力系数
		if (f == 1 && (act1 == 0 || act3 > 0))
		{
			V1 = V1 / 1.2;;if (V1<0.1&&V1>-0.1) { V1 = 0; }
		}
		//物理引擎
		//猛汉跳楼模拟器
		if (secty(x, 8, y + 9, 2, 0, 0, 1) == 0)
		{
			if (ay < 2)ay += 0.5;if (Vy1 < 8)Vy1 = Vy1 + ay / 1.2;Vy2 = Vy1;
			if (Vy2 > 0)
				for (;0 < Vy2;Vy2--)//下落检测
				{
					y++;if (dx[0][y + 9][x] == 2 || dx[0][y + 9][x + 1] == 2 || dx[0][y + 9][x - 1] == 2 || dx[0][y + 9][x] == 3 || dx[0][y + 9][x + 1] == 3 || dx[0][y + 9][x - 1] == 3)
					{
						f = 1;ay = 0;Vy1 = 0;Vy2 = 0;break;
					}
				}
			else
			{
				for (;Vy2 < 0;Vy2++)
				{
					if (dx[0][y - 1][x] == 3 || dx[0][y - 1][x + 1] == 3 || dx[0][y - 1][x - 1] == 3)
					{
						Vy1 = -Vy1;break;
					}
					else y--;

				}

			}


			f = 0;
		}
		else { f = 1;ay = 0;Vy1 = 0;Vy2 = 0; }
		//猛汉跳楼模拟器

		if (ax != 0)
		{
			V1 = V1 + ax / 12;
			if (V1 <= -max) { V1 = -max;act1 = 3; }
			else if (V1 >= max) { V1 = max; act1 = 4; }
		}
		V2 = V1;
		if (V2 > 0)
		{
			{for (a = 0;a < V2;a++)
			{
				if (sectx(x, 4, y + 5, 4, V2, 0, 1))
				{
					act2 = 1;V1 = 0;V2 = 0;ax = 0;x = x - 2;break;
				}
				else act2 = 0;

				if ((dx[0][y + 8][x + 2] == 3 || dx[0][y + 7][x + 2] == 3) && dx[0][y + 6][x + 2] != 3 && (dx[0][y + 5][x + 2] != 3 && dx[0][y + 4][x + 3] != 3 && dx[0][y + 3][x + 3] != 3 && dx[0][y + 1][x + 2] != 3 && dx[0][y][x + 2] != 3))
				{
					y--;//便于上楼梯函数
				}
				x++;
			}
			}

		}
		if (V2 < 0)
		{
			{for (a = 0;a + V2;a++)
			{
				if (sectx(x, 4, y + 5, 4, V2, 0, 1))
				{
					act2 = 1;V1 = 0;V2 = 0;ax = 0;x = x + 2;break;
				}
				else act2 = 0;

				if ((dx[0][y + 8][x - 2] == 3 || dx[0][y + 7][x - 2] == 3) && (dx[0][y + 6][x - 2] != 3 && dx[0][y + 5][x - 2] != 3 && dx[0][y + 4][x - 3] != 3 && dx[0][y + 3][x - 3] != 3 && dx[0][y + 1][x - 2] != 3 && dx[0][y][x - 2] != 3))
				{
					y--;//便于上楼梯函数
				}
				x--;
			}
			}
		}
	}break;

	case 1:break;

	case 33: {
		if (dx[0][ym[e] + 10][xm[e]] != 2 && dx[0][ym[e] + 10][xm[e] + 1] != 2 && dx[0][ym[e] + 10][xm[e] - 1] != 2 && dx[0][ym[e] + 10][xm[e]] != 3 && dx[0][ym[e] + 10][xm[e] + 1] != 3 && dx[0][ym[e] + 10][xm[e] - 1] != 3)//重力函数
		{

			if (aY[e] <= 2) { aY[e] += 0.5; }
			if (vY[e] < 8)vY[e] = vY[e] + aY[e];
			Vy2 = vY[e];

			for (a = 0;a < Vy2;a++)//下落检测
			{
				ym[e]++;
				if (dx[0][ym[e] + 10][xm[e]] == 2 || dx[0][ym[e] + 10][xm[e] + 1] == 2 || dx[0][ym[e] + 10][xm[e] - 1] == 2 || dx[0][ym[e] + 10][xm[e]] == 3 || dx[0][ym[e] + 10][xm[e] + 1] == 3 || dx[0][ym[e] + 10][xm[e] - 1] == 3)
				{
					aY[e] = 0;vY[e] = 0;Vy2 = 0;fag[e][3]++;break;
				}
			}
		}break;
	}
	case 50:
	{
		if (axmonst[e] != 0)
		{
			V1monst[e] = V1monst[e] + axmonst[e] / 10;V2monst[e] = V1monst[e];
			if (V1monst[e] <= -2) {
				V1monst[e] = -0;
			}
			else if (V1monst[e] >= 2) {
				V1monst[e] = 0;
			}
		}
		if (V2monst[e] > 0)
		{

			{for (a = 0;a < V2monst[e];a++)
			{
				if (
					dx[0][ym[e] - 8][xm[e] + 2] == 3 || dx[0][ym[e] - 7][xm[e] + 2] == 3 || dx[0][ym[e] - 6][xm[e] + 2] == 3 || dx[0][ym[e] - 5][xm[e] - 2] == 3 || dx[0][ym[e] - 4][xm[e] + 3] == 3 || dx[0][ym[e] - 3][xm[e] - 3] == 3 || dx[0][ym[e] - 1][xm[e] - 2] == 3 || dx[0][ym[e]][xm[e] - 2] == 3
					)
				{
					V1monst[e] = 0;V2monst[e] = 0;axmonst[e] = 0;xm[e] = xm[e] - 3;break;
				}

				xm[e]++;
			}
			}

		}
		if (V2monst[e] < 0)
		{

			{for (a = 0;a + V2monst[e];a++)
			{
				if (
					dx[0][ym[e] - 8][xm[e] - 2] == 3 || dx[0][ym[e] - 7][xm[e] - 2] == 3 || dx[0][ym[e] - 6][xm[e] - 2] == 3 || dx[0][ym[e] - 5][xm[e] - 2] == 3 || dx[0][ym[e] - 4][xm[e] - 3] == 3 || dx[0][ym[e] - 3][xm[e] - 3] == 3 || dx[0][ym[e] - 1][xm[e] - 2] == 3 || dx[0][ym[e]][xm[e] - 2] == 3
					)
				{
					V1monst[e] = 0;V2monst[e] = 0;axmonst[e] = 0;xm[e] = xm[e] + 3;break;
				}

				xm[e]--;
			}
			}

		}
		//猛汉跳楼模拟器
		if (dx[0][ym[e] + 19][xm[e]] != 2 && dx[0][ym[e] + 19][xm[e] + 1] != 2 && dx[0][ym[e] + 19][xm[e] - 1] != 2)
		{

			if (aY[e] <= 2) { aY[e] += 0.5; }
			if (vY[e] < 8)vY[e] = vY[e] + aY[e] / 1.5;
			Vy2 = vY[e];

			for (a = 0;a < Vy2;a++)//下落检测
			{
				ym[e]++;
				if (dx[0][ym[e] + 19][xm[e]] == 2 || dx[0][ym[e] + 19][xm[e] + 1] == 2 || dx[0][ym[e] + 19][xm[e] - 1] == 2)
				{
					aY[e] = 0;vY[e] = 0;Vy2 = 0;fag[e][3] = 1;break;
				}
				else fag[e][3] = 0;
			}


		}}break;

	default:

		if (aY[e] <= 2) { aY[e] += 0.5; }
		if (vY[e] < 8)vY[e] = vY[e] + aY[e];
		Vy2 = vY[e];

		for (a = 0;a < Vy2;a++)//下落检测
		{
			ym[e]++;
			if (dx[0][ym[e] + 9][xm[e]] == 2 || dx[0][ym[e] + 9][xm[e] + 1] == 2 || dx[0][ym[e] + 9][xm[e] - 1] == 2 || dx[0][ym[e] + 9][xm[e]] == 3 || dx[0][ym[e] + 9][xm[e] + 1] == 3 || dx[0][ym[e] + 9][xm[e] - 1] == 3)
			{
				aY[e] = 0;vY[e] = 0;Vy2 = 0;fag[e][3]++;break;
			}
		}



	}
}

int sectx(int x1, int rx, int y1, int ry, int con,int cas, int id)
{
	switch (cas)
	{
	case 0:chac(con, 0);break;
	}
	
		
		if (con > 0)
			for (register short int a = y1 - (ry / 2), b = y1 + (ry / 2);a < b;a++)
			{
				for (register short int a1 = x1, b1 = x1 + rx;a1 < b1;a1++)
				{
					if (dx[0][a][a1] == 3 && dx[1][a][a1 - 1] == id) { goto bith; }
				}
			}
		else
			for (register short int a = y1 - (ry / 2), b = y1 + (ry / 2);a < b;a++)
			{
				for (register short int a1 = x1, b1 = x1 - rx;a1 > b1;b1++)
				{
					if (dx[0][a][b1] == 3 && dx[1][a][b1 + 1] == id) { goto bith; }
				}
			}
		switch (cas)
		{
		case 0:chac(con, 1);break;
		}
		return 0;

	bith:
		switch (cas)
		{
		case 0:chac(con, 1);break;
		}
		return 1;


	
}

int secty(int x1, int rx, int y1, int ry, int con, int cas, int id)
{
	switch (cas)
	{
	case 0:chac(con, 0);break;
	}
	for (register short int a = x1 - (rx / 2), b = x1 + (rx / 2);a < b;a++)
	{
		for (register short int a1 = y1, b1 = y1 + ry;a1 < b1;a1++)
		{
			if ((dx[0][a1][a] == 3 || dx[0][a1][a] == 2) && dx[1][a1 - 1][a] == id) { goto bith; }
		}
	}

	switch (cas)
	{
	case 0:chac(con, 1);break;
	}
	return 0;

bith:
	switch (cas)
	{
	case 0:chac(con, 1);break;
	}
	return 1;
}

void mondel(int x1,int y1,int xfork,int yfork,int cas,int id) 
{
	switch (cas) 
	{
	
	//韩德索模型
	case 10: 
	{
		


			if (dx[1][y1][x1] == 0)dx[1][y1][x1] = id;//1
			if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;
			if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			y1++;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;//2
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;

			y1++;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;//3
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			y1++;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;//4
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			if (dx[1][y1][x1] == 0)dx[1][y1][x1] = id;
			if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;
			if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			y1++;
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;//5
			if (dx[1][y1][x1 + 7] == 0)dx[1][y1][x1 + 7] = id;
			if (dx[1][y1][x1 + 8] == 0)dx[1][y1][x1 + 8] = id;
			if (dx[1][y1][x1 + 9] == 0)dx[1][y1][x1 + 9] = id;
			if (dx[1][y1][x1 + 10] == 0)dx[1][y1][x1 + 10] = id;
			if (dx[1][y1][x1 + 11] == 0)dx[1][y1][x1 + 11] = id;
			if (dx[1][y1][x1 + 12] == 0)dx[1][y1][x1 + 12] = id;
			if (dx[1][y1][x1 - 7] == 0)dx[1][y1][x1 - 7] = id;
			if (dx[1][y1][x1 - 8] == 0)dx[1][y1][x1 - 8] = id;
			if (dx[1][y1][x1 - 9] == 0)dx[1][y1][x1 - 9] = id;
			if (dx[1][y1][x1 - 10] == 0)dx[1][y1][x1 - 10] = id;
			if (dx[1][y1][x1 - 11] == 0)dx[1][y1][x1 - 11] = id;//5
			if (dx[1][y1][x1 - 12] == 0)dx[1][y1][x1 - 12] = id;
			y1++;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;//6
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			if (dx[1][y1][x1] == 0)dx[1][y1][x1] = id;
			if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;
			if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 + 4] == 0)dx[1][y1][x1 + 4] = id;
			if (dx[1][y1][x1 - 4] == 0)dx[1][y1][x1 - 4] = id;
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 + 6] == 0)dx[1][y1][x1 + 6] = id;
			if (dx[1][y1][x1 - 6] == 0)dx[1][y1][x1 - 6] = id;
			if (dx[1][y1][x1 + 5] == 0)dx[1][y1][x1 + 5] = id;
			if (dx[1][y1][x1 - 5] == 0)dx[1][y1][x1 - 5] = id;
			if (dx[1][y1][x1 - 7] == 0)dx[1][y1][x1 - 7] = id;
			if (dx[1][y1][x1 + 7] == 0)dx[1][y1][x1 + 7] = id;
			if (dx[1][y1][x1 - 13] == 0)dx[1][y1][x1 - 13] = id;
			if (dx[1][y1][x1 + 13] == 0)dx[1][y1][x1 + 13] = id;
			y1++;
			//七层
			if (dx[1][y1][x1] == 0)dx[1][y1][x1] = id;
			if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
			if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;
			if (dx[1][y1][x1 + 6] == 0)dx[1][y1][x1 + 6] = id;
			if (dx[1][y1][x1 - 6] == 0)dx[1][y1][x1 - 6] = id;
			if (dx[1][y1][x1 - 7] == 0)dx[1][y1][x1 - 7] = id;
			if (dx[1][y1][x1 + 7] == 0)dx[1][y1][x1 + 7] = id;
			if (dx[1][y1][x1 - 13] == 0)dx[1][y1][x1 - 13] = id;
			if (dx[1][y1][x1 + 13] == 0)dx[1][y1][x1 + 13] = id;


			y1++;//八层
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			if (dx[1][y1][x1] == 0)dx[1][y1][x1] = id;
			if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;
			if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 + 4] == 0)dx[1][y1][x1 + 4] = id;
			if (dx[1][y1][x1 - 4] == 0)dx[1][y1][x1 - 4] = id;
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 + 6] == 0)dx[1][y1][x1 + 6] = id;
			if (dx[1][y1][x1 - 6] == 0)dx[1][y1][x1 - 6] = id;
			if (dx[1][y1][x1 + 5] == 0)dx[1][y1][x1 + 5] = id;
			if (dx[1][y1][x1 - 5] == 0)dx[1][y1][x1 - 5] = id;
			if (dx[1][y1][x1 - 8] == 0)dx[1][y1][x1 - 8] = id;
			if (dx[1][y1][x1 - 9] == 0)dx[1][y1][x1 - 9] = id;
			if (dx[1][y1][x1 - 10] == 0)dx[1][y1][x1 - 10] = id;
			if (dx[1][y1][x1 - 11] == 0)dx[1][y1][x1 - 11] = id;
			if (dx[1][y1][x1 - 12] == 0)dx[1][y1][x1 - 12] = id;
			if (dx[1][y1][x1 + 8] == 0)dx[1][y1][x1 + 8] = id;
			if (dx[1][y1][x1 + 9] == 0)dx[1][y1][x1 + 9] = id;
			if (dx[1][y1][x1 + 10] == 0)dx[1][y1][x1 + 10] = id;
			if (dx[1][y1][x1 + 11] == 0)dx[1][y1][x1 + 11] = id;
			if (dx[1][y1][x1 + 12] == 0)dx[1][y1][x1 + 12] = id;
			if (dx[1][y1][x1 - 13] == 0)dx[1][y1][x1 - 13] = id;
			if (dx[1][y1][x1 + 13] == 0)dx[1][y1][x1 + 13] = id;
			y1++;//九层
			if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
			if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;
			if (dx[1][y1][x1 + 4] == 0)dx[1][y1][x1 + 4] = id;
			if (dx[1][y1][x1 - 4] == 0)dx[1][y1][x1 - 4] = id;
			if (dx[1][y1][x1 + 5] == 0)dx[1][y1][x1 + 5] = id;
			if (dx[1][y1][x1 - 5] == 0)dx[1][y1][x1 - 5] = id;
			if (dx[1][y1][x1 - 9] == 0)dx[1][y1][x1 - 9] = id;
			if (dx[1][y1][x1 + 9] == 0)dx[1][y1][x1 + 9] = id;
			if (dx[1][y1][x1 + 12] == 0)dx[1][y1][x1 + 12] = id;
			if (dx[1][y1][x1 - 12] == 0)dx[1][y1][x1 - 12] = id;

			if (conmonst[id] < 0)//左
			{
				if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4) { if (dx[1][y1][x1 - 20] == 0)dx[1][y1][x1 - 20] = id + 1; }
				else if (actmonst[id] == 1)
				{
					if (dx[1][y1][x1 - 12] == id)dx[1][y1][x1 - 12] = 0;
					if (dx[1][y1][x1 - 9] == id)dx[1][y1][x1 - 9] = 0;
				}

			}
			else//右
			{
				if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4) {
					if (dx[1][y1][x1 + 20] == 0)dx[1][y1][x1 + 20] = id + 1;
				}
				else if (actmonst[id] == 1)
				{
					if (dx[1][y1][x1 + 12] == id)dx[1][y1][x1 + 12] = 0;
					if (dx[1][y1][x1 + 9] == id)dx[1][y1][x1 + 9] = 0;
				}
			}
			y1++;//10
			if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
			if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;

			if (dx[1][y1][x1 + 4] == 0)dx[1][y1][x1 + 4] = id;
			if (dx[1][y1][x1 - 4] == 0)dx[1][y1][x1 - 4] = id;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			if (dx[1][y1][x1 - 8] == 0)dx[1][y1][x1 - 8] = id;
			if (dx[1][y1][x1 + 8] == 0)dx[1][y1][x1 + 8] = id;
			if (dx[1][y1][x1 - 9] == 0)dx[1][y1][x1 - 9] = id;
			if (dx[1][y1][x1 + 9] == 0)dx[1][y1][x1 + 9] = id;
			if (dx[1][y1][x1 + 12] == 0)dx[1][y1][x1 + 12] = id;
			if (dx[1][y1][x1 - 12] == 0)dx[1][y1][x1 - 12] = id;
			if (dx[1][y1][x1 - 13] == 0)dx[1][y1][x1 - 13] = id;
			if (dx[1][y1][x1 + 13] == 0)dx[1][y1][x1 + 13] = id;

			if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4)
			{
				if (conmonst[id] < 0)//左
				{
					if (dx[1][y1][x1 - 20] == 0)dx[1][y1][x1 - 20] = id + 1;
					if (dx[1][y1][x1 - 21] == 0)dx[1][y1][x1 - 21] = id + 1;

				}
				else//右
				{

					if (dx[1][y1][x1 + 20] == 0)dx[1][y1][x1 + 20] = id + 1;
					if (dx[1][y1][x1 + 21] == 0)dx[1][y1][x1 + 21] = id + 1;


				}
			}

			if (actmonst[id] == 1)
			{
				if (conmonst[id] < 0) {
					if (dx[1][y1][x1 - 12] == id)dx[1][y1][x1 - 12] = 0;
					if (dx[1][y1][x1 - 9] == id)dx[1][y1][x1 - 9] = 0;
					if (dx[1][y1][x1 - 13] == id)dx[1][y1][x1 - 13] = 0;
					if (dx[1][y1][x1 - 8] == id)dx[1][y1][x1 - 8] = 0;
				}
				else {

					if (dx[1][y1][x1 + 12] == id)dx[1][y1][x1 + 12] = 0;
					if (dx[1][y1][x1 + 9] == id)dx[1][y1][x1 + 9] = 0;
					if (dx[1][y1][x1 + 13] == id)dx[1][y1][x1 + 13] = 0;
					if (dx[1][y1][x1 + 8] == id)dx[1][y1][x1 + 8] = 0;
				}
			}
			y1++;//11
			if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
			if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;

			if (dx[1][y1][x1 - 7] == 0)dx[1][y1][x1 - 7] = id;
			if (dx[1][y1][x1 + 7] == 0)dx[1][y1][x1 + 7] = id;
			if (dx[1][y1][x1 - 8] == 0)dx[1][y1][x1 - 8] = id;
			if (dx[1][y1][x1 + 8] == 0)dx[1][y1][x1 + 8] = id;
			if (dx[1][y1][x1 - 9] == 0)dx[1][y1][x1 - 9] = id;
			if (dx[1][y1][x1 + 9] == 0)dx[1][y1][x1 + 9] = id;
			if (dx[1][y1][x1 + 10] == 0)dx[1][y1][x1 + 10] = id;
			if (dx[1][y1][x1 - 10] == 0)dx[1][y1][x1 - 10] = id;
			if (dx[1][y1][x1 + 11] == 0)dx[1][y1][x1 + 11] = id;
			if (dx[1][y1][x1 - 11] == 0)dx[1][y1][x1 - 11] = id;
			if (dx[1][y1][x1 + 12] == 0)dx[1][y1][x1 + 12] = id;
			if (dx[1][y1][x1 - 12] == 0)dx[1][y1][x1 - 12] = id;
			if (dx[1][y1][x1 - 13] == 0)dx[1][y1][x1 - 13] = id;
			if (dx[1][y1][x1 + 13] == 0)dx[1][y1][x1 + 13] = id;
			if (dx[1][y1][x1 - 14] == 0)dx[1][y1][x1 - 14] = id;
			if (dx[1][y1][x1 + 14] == 0)dx[1][y1][x1 + 14] = id;

			if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4) {


				if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
				if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
				if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;
				if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
				if (dx[1][y1][x1 + 4] == 0)dx[1][y1][x1 + 4] = id;
				if (dx[1][y1][x1 - 4] == 0)dx[1][y1][x1 - 4] = id;
				if (dx[1][y1][x1 + 5] == 0)dx[1][y1][x1 + 5] = id;
				if (dx[1][y1][x1 - 5] == 0)dx[1][y1][x1 - 5] = id;
				if (dx[1][y1][x1 + 6] == 0)dx[1][y1][x1 + 6] = id;
				if (dx[1][y1][x1 - 6] == 0)dx[1][y1][x1 - 6] = id;


				//右
				if (conmonst[id] < 0)
				{
					if (dx[1][y1][x1 - 15] == 0)dx[1][y1][x1 - 15] = id + 1;
					if (dx[1][y1][x1 - 16] == 0)dx[1][y1][x1 - 16] = id + 1;
					if (dx[1][y1][x1 - 17] == 0)dx[1][y1][x1 - 17] = id + 1;
					if (dx[1][y1][x1 - 18] == 0)dx[1][y1][x1 - 18] = id + 1;
					if (dx[1][y1][x1 - 19] == 0)dx[1][y1][x1 - 19] = id + 1;
					if (dx[1][y1][x1 - 20] == 0)dx[1][y1][x1 - 20] = id + 1;
					if (dx[1][y1][x1 - 21] == 0)dx[1][y1][x1 - 21] = id + 1;
					if (dx[1][y1][x1 - 22] == 0)dx[1][y1][x1 - 22] = id + 1;
					if (dx[1][y1][x1 - 23] == 0)dx[1][y1][x1 - 23] = id + 1;
					if (dx[1][y1][x1 - 24] == 0)dx[1][y1][x1 - 24] = id + 1;
					if (dx[1][y1][x1 - 25] == 0)dx[1][y1][x1 - 25] = id + 1;
					if (dx[1][y1][x1 - 26] == 0)dx[1][y1][x1 - 26] = id + 1;
					if (dx[1][y1][x1 - 27] == 0)dx[1][y1][x1 - 27] = id + 1;
					if (dx[1][y1][x1 - 28] == 0)dx[1][y1][x1 - 28] = id + 1;
					if (dx[1][y1][x1 - 29] == 0)dx[1][y1][x1 - 29] = id + 1;
					if (dx[1][y1][x1 - 30] == 0)dx[1][y1][x1 - 30] = id + 1;
					if (dx[1][y1][x1 - 31] == 0)dx[1][y1][x1 - 31] = id + 1;
					if (dx[1][y1][x1 - 32] == 0)dx[1][y1][x1 - 32] = id + 1;
					if (dx[1][y1][x1 - 33] == 0)dx[1][y1][x1 - 33] = id + 1;
					if (dx[1][y1][x1 - 34] == 0)dx[1][y1][x1 - 34] = id + 1;
					if (dx[1][y1][x1 - 35] == 0)dx[1][y1][x1 - 35] = id + 1;
				}
				else
				{



					if (dx[1][y1][x1 + 15] == 0)dx[1][y1][x1 + 15] = id + 1;
					if (dx[1][y1][x1 + 16] == 0)dx[1][y1][x1 + 16] = id + 1;
					if (dx[1][y1][x1 + 17] == 0)dx[1][y1][x1 + 17] = id + 1;
					if (dx[1][y1][x1 + 18] == 0)dx[1][y1][x1 + 18] = id + 1;
					if (dx[1][y1][x1 + 19] == 0)dx[1][y1][x1 + 19] = id + 1;
					if (dx[1][y1][x1 + 20] == 0)dx[1][y1][x1 + 20] = id + 1;
					if (dx[1][y1][x1 + 21] == 0)dx[1][y1][x1 + 21] = id + 1;
					if (dx[1][y1][x1 + 22] == 0)dx[1][y1][x1 + 22] = id + 1;
					if (dx[1][y1][x1 + 23] == 0)dx[1][y1][x1 + 23] = id + 1;
					if (dx[1][y1][x1 + 24] == 0)dx[1][y1][x1 + 24] = id + 1;
					if (dx[1][y1][x1 + 25] == 0)dx[1][y1][x1 + 25] = id + 1;
					if (dx[1][y1][x1 + 26] == 0)dx[1][y1][x1 + 26] = id + 1;
					if (dx[1][y1][x1 + 27] == 0)dx[1][y1][x1 + 27] = id + 1;
					if (dx[1][y1][x1 + 28] == 0)dx[1][y1][x1 + 28] = id + 1;
					if (dx[1][y1][x1 + 29] == 0)dx[1][y1][x1 + 29] = id + 1;
					if (dx[1][y1][x1 + 30] == 0)dx[1][y1][x1 + 30] = id + 1;
					if (dx[1][y1][x1 + 31] == 0)dx[1][y1][x1 + 31] = id + 1;
					if (dx[1][y1][x1 + 32] == 0)dx[1][y1][x1 + 32] = id + 1;
					if (dx[1][y1][x1 + 33] == 0)dx[1][y1][x1 + 33] = id + 1;
					if (dx[1][y1][x1 + 34] == 0)dx[1][y1][x1 + 34] = id + 1;
					if (dx[1][y1][x1 + 35] == 0)dx[1][y1][x1 + 35] = id + 1;
				}
			}

			if (actmonst[id] == 1)
			{
				if (conmonst[id] < 0) {
					if (dx[1][y1][x1 - 12] == id)dx[1][y1][x1 - 12] = 0;
					if (dx[1][y1][x1 - 9] == id)dx[1][y1][x1 - 9] = 0;
					if (dx[1][y1][x1 - 13] == id)dx[1][y1][x1 - 13] = 0;
					if (dx[1][y1][x1 - 8] == id)dx[1][y1][x1 - 8] = 0;
					if (dx[1][y1][x1 - 10] == id)dx[1][y1][x1 - 10] = 0;
					if (dx[1][y1][x1 - 11] == id)dx[1][y1][x1 - 11] = 0;
					if (dx[1][y1][x1 - 7] == id)dx[1][y1][x1 - 7] = 0;
					if (dx[1][y1][x1 - 14] == id)dx[1][y1][x1 - 14] = 0;
				}
				else {

					if (dx[1][y1][x1 + 12] == id)dx[1][y1][x1 + 12] = 0;
					if (dx[1][y1][x1 + 9] == id)dx[1][y1][x1 + 9] = 0;
					if (dx[1][y1][x1 + 13] == id)dx[1][y1][x1 + 13] = 0;
					if (dx[1][y1][x1 + 8] == id)dx[1][y1][x1 + 8] = 0;
					if (dx[1][y1][x1 + 10] == id)dx[1][y1][x1 + 10] = 0;
					if (dx[1][y1][x1 + 11] == id)dx[1][y1][x1 + 11] = 0;
					if (dx[1][y1][x1 + 7] == id)dx[1][y1][x1 + 7] = 0;
					if (dx[1][y1][x1 + 14] == id)dx[1][y1][x1 + 14] = 0;
				}
			}




			y1++;//12
			if (dx[1][y1][x1] == 0)dx[1][y1][x1] = id;
			if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
			if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 - 8] == 0)dx[1][y1][x1 - 8] = id;
			if (dx[1][y1][x1 + 8] == 0)dx[1][y1][x1 + 8] = id;
			if (dx[1][y1][x1 - 9] == 0)dx[1][y1][x1 - 9] = id;
			if (dx[1][y1][x1 + 9] == 0)dx[1][y1][x1 + 9] = id;
			if (dx[1][y1][x1 + 10] == 0)dx[1][y1][x1 + 10] = id;
			if (dx[1][y1][x1 - 10] == 0)dx[1][y1][x1 - 10] = id;
			if (dx[1][y1][x1 + 11] == 0)dx[1][y1][x1 + 11] = id;
			if (dx[1][y1][x1 - 11] == 0)dx[1][y1][x1 - 11] = id;
			if (dx[1][y1][x1 + 12] == 0)dx[1][y1][x1 + 12] = id;
			if (dx[1][y1][x1 - 12] == 0)dx[1][y1][x1 - 12] = id;
			if (dx[1][y1][x1 - 13] == 0)dx[1][y1][x1 - 13] = id;
			//右
			if (conmonst[id] < 0)
			{
				if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4)
				{
					if (dx[1][y1][x1 - 20] == 0)dx[1][y1][x1 - 20] = id + 1;
					if (dx[1][y1][x1 - 21] == 0)dx[1][y1][x1 - 21] = id + 1;
					if (dx[1][y1][x1 - 24] == 0)dx[1][y1][x1 - 24] = id + 1;
					if (dx[1][y1][x1 - 25] == 0)dx[1][y1][x1 - 25] = id + 1;
					if (dx[1][y1][x1 - 26] == 0)dx[1][y1][x1 - 26] = id + 1;
					if (dx[1][y1][x1 - 27] == 0)dx[1][y1][x1 - 27] = id + 1;
					if (dx[1][y1][x1 - 28] == 0)dx[1][y1][x1 - 28] = id + 1;
					if (dx[1][y1][x1 - 29] == 0)dx[1][y1][x1 - 29] = id + 1;
					if (dx[1][y1][x1 - 30] == 0)dx[1][y1][x1 - 30] = id + 1;
					if (dx[1][y1][x1 - 31] == 0)dx[1][y1][x1 - 31] = id + 1;
					if (dx[1][y1][x1 - 32] == 0)dx[1][y1][x1 - 32] = id + 1;
					if (dx[1][y1][x1 - 33] == 0)dx[1][y1][x1 - 33] = id + 1;
				}
			}
			else//左
			{
				if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4)
				{
					if (dx[1][y1][x1 + 20] == 0)dx[1][y1][x1 + 20] = id + 1;
					if (dx[1][y1][x1 + 21] == 0)dx[1][y1][x1 + 21] = id + 1;
					if (dx[1][y1][x1 + 24] == 0)dx[1][y1][x1 + 24] = id + 1;
					if (dx[1][y1][x1 + 25] == 0)dx[1][y1][x1 + 25] = id + 1;
					if (dx[1][y1][x1 + 26] == 0)dx[1][y1][x1 + 26] = id + 1;
					if (dx[1][y1][x1 + 27] == 0)dx[1][y1][x1 + 27] = id + 1;
					if (dx[1][y1][x1 + 28] == 0)dx[1][y1][x1 + 28] = id + 1;
					if (dx[1][y1][x1 + 29] == 0)dx[1][y1][x1 + 29] = id + 1;
					if (dx[1][y1][x1 + 30] == 0)dx[1][y1][x1 + 30] = id + 1;
					if (dx[1][y1][x1 + 31] == 0)dx[1][y1][x1 + 31] = id + 1;
					if (dx[1][y1][x1 + 32] == 0)dx[1][y1][x1 + 32] = id + 1;
					if (dx[1][y1][x1 + 33] == 0)dx[1][y1][x1 + 33] = id + 1;
				}
			}
			if (actmonst[id] == 1)
			{
				if (conmonst[id] < 0) {
					if (dx[1][y1][x1 - 12] == id)dx[1][y1][x1 - 12] = 0;
					if (dx[1][y1][x1 - 9] == id)dx[1][y1][x1 - 9] = 0;
					if (dx[1][y1][x1 - 13] == id)dx[1][y1][x1 - 13] = 0;
					if (dx[1][y1][x1 - 8] == id)dx[1][y1][x1 - 8] = 0;
					if (dx[1][y1][x1 - 10] == id)dx[1][y1][x1 - 10] = 0;
					if (dx[1][y1][x1 - 11] == id)dx[1][y1][x1 - 11] = 0;
				}
				else {

					if (dx[1][y1][x1 + 12] == id)dx[1][y1][x1 + 12] = 0;
					if (dx[1][y1][x1 + 9] == id)dx[1][y1][x1 + 9] = 0;
					if (dx[1][y1][x1 + 13] == id)dx[1][y1][x1 + 13] = 0;
					if (dx[1][y1][x1 + 8] == id)dx[1][y1][x1 + 8] = 0;
					if (dx[1][y1][x1 + 10] == id)dx[1][y1][x1 + 10] = 0;
					if (dx[1][y1][x1 + 11] == id)dx[1][y1][x1 + 11] = 0;
				}
			}
			y1++;//13
			if (dx[1][y1][x1] == 0)dx[1][y1][x1] = id;
			if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
			if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			//右
			if (conmonst[id] < 0)
			{
				if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4) {
					if (dx[1][y1][x1 - 20] == 0)dx[1][y1][x1 - 20] = id + 1;
					if (dx[1][y1][x1 - 24] == 0)dx[1][y1][x1 - 24] = id + 1;
					if (dx[1][y1][x1 - 25] == 0)dx[1][y1][x1 - 25] = id + 1;
					if (dx[1][y1][x1 - 26] == 0)dx[1][y1][x1 - 26] = id + 1;
					if (dx[1][y1][x1 - 27] == 0)dx[1][y1][x1 - 27] = id + 1;
					if (dx[1][y1][x1 - 28] == 0)dx[1][y1][x1 - 28] = id + 1;
					if (dx[1][y1][x1 - 29] == 0)dx[1][y1][x1 - 29] = id + 1;
				}
			}
			else//左
			{
				if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4)
				{
					if (dx[1][y1][x1 + 20] == 0)dx[1][y1][x1 + 20] = id + 1;
					if (dx[1][y1][x1 + 24] == 0)dx[1][y1][x1 + 24] = id + 1;
					if (dx[1][y1][x1 + 25] == 0)dx[1][y1][x1 + 25] = id + 1;
					if (dx[1][y1][x1 + 26] == 0)dx[1][y1][x1 + 26] = id + 1;
					if (dx[1][y1][x1 + 27] == 0)dx[1][y1][x1 + 27] = id + 1;
					if (dx[1][y1][x1 + 28] == 0)dx[1][y1][x1 + 28] = id + 1;
					if (dx[1][y1][x1 + 29] == 0)dx[1][y1][x1 + 29] = id + 1;
				}
			}
			y1++;//14
			if (dx[1][y1][x1] == 0)dx[1][y1][x1] = id;
			if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
			if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			if (dx[1][y1][x1 + 4] == 0)dx[1][y1][x1 + 4] = id;
			if (dx[1][y1][x1 - 4] == 0)dx[1][y1][x1 - 4] = id;
			y1++;//15
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			if (dx[1][y1][x1 + 4] == 0)dx[1][y1][x1 + 4] = id;
			if (dx[1][y1][x1 - 4] == 0)dx[1][y1][x1 - 4] = id;
			y1++;//16
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			if (dx[1][y1][x1 + 4] == 0)dx[1][y1][x1 + 4] = id;
			if (dx[1][y1][x1 - 4] == 0)dx[1][y1][x1 - 4] = id;
			y1++;//17
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			if (dx[1][y1][x1 + 4] == 0)dx[1][y1][x1 + 4] = id;
			if (dx[1][y1][x1 - 4] == 0)dx[1][y1][x1 - 4] = id;
			y1++;//18
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			if (dx[1][y1][x1 + 4] == 0)dx[1][y1][x1 + 4] = id;
			if (dx[1][y1][x1 - 4] == 0)dx[1][y1][x1 - 4] = id;
			//右
			if (conmonst[id] < 0)
			{
				if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;
				if (dx[1][y1][x1 - 5] == 0)dx[1][y1][x1 - 5] = id;
			}
			else//左 
			{
				if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
				if (dx[1][y1][x1 + 5] == 0)dx[1][y1][x1 + 5] = id;
			}
			y1++;//19
			if (dx[1][y1][x1 + 2] == 0)dx[1][y1][x1 + 2] = id;
			if (dx[1][y1][x1 - 2] == 0)dx[1][y1][x1 - 2] = id;
			if (dx[1][y1][x1 + 3] == 0)dx[1][y1][x1 + 3] = id;
			if (dx[1][y1][x1 - 3] == 0)dx[1][y1][x1 - 3] = id;
			if (dx[1][y1][x1 + 4] == 0)dx[1][y1][x1 + 4] = id;
			if (dx[1][y1][x1 - 4] == 0)dx[1][y1][x1 - 4] = id;
			//右
			if (conmonst[id] < 0)
			{
				if (dx[1][y1][x1 + 1] == 0)dx[1][y1][x1 + 1] = id;
				if (dx[1][y1][x1 - 5] == 0)dx[1][y1][x1 - 5] = id;
			}
			else//左 
			{
				if (dx[1][y1][x1 - 1] == 0)dx[1][y1][x1 - 1] = id;
				if (dx[1][y1][x1 + 5] == 0)dx[1][y1][x1 + 5] = id;
			}
		
		if (actmonst[id] == 1)//持有的武器
		{
			yfork = ym[id];
			xfork = xm[id];
			yfork -= 2;
			if (conmonst[id] > 0)
			{
				//右

				if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;
				if (dx[1][yfork][xfork + 33] == 0)dx[1][yfork][xfork + 33] = id + 1;
				if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;
				if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;
				yfork++;
				//右
				if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;
				if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;
				if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;
				if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;
				if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;
				if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;
				yfork++;
				if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;//33
				if (dx[1][yfork][xfork + 33] == 0)dx[1][yfork][xfork + 33] = id + 1;//32
				if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;//31
				if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//30
				if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//29
				if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//28
				if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//27
				if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//26
				if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//25
				if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 33] == 0)dx[1][yfork][xfork + 33] = id + 1;//32
				if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;//31
				if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//30
				if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//29
				if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//28
				if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//27
				if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//26
				if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//24
				if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//23
				if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//22
				if (dx[1][yfork][xfork + 22] == 0)dx[1][yfork][xfork + 22] = id + 1;//21
				if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//30
				if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//29
				if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//28
				if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//27
				if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//26
				if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//25
				if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//24
				if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//23
				if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//22
				if (dx[1][yfork][xfork + 22] == 0)dx[1][yfork][xfork + 22] = id + 1;//21
				if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//20
				if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//19
				if (dx[1][yfork][xfork + 19] == 0)dx[1][yfork][xfork + 19] = id + 1;//18
				if (dx[1][yfork][xfork + 18] == 0)dx[1][yfork][xfork + 18] = id + 1;//17
				if (dx[1][yfork][xfork + 17] == 0)dx[1][yfork][xfork + 17] = id + 1;//16
				if (dx[1][yfork][xfork + 16] == 0)dx[1][yfork][xfork + 16] = id + 1;//15
				if (dx[1][yfork][xfork + 15] == 0)dx[1][yfork][xfork + 15] = id + 1;//14
				if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//13
				if (dx[1][yfork][xfork + 13] == 0)dx[1][yfork][xfork + 13] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//25
				if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//24
				if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//23
				if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//21
				if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//20
				if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//19
				if (dx[1][yfork][xfork + 19] == 0)dx[1][yfork][xfork + 19] = id + 1;//18
				if (dx[1][yfork][xfork + 18] == 0)dx[1][yfork][xfork + 18] = id + 1;//17
				if (dx[1][yfork][xfork + 17] == 0)dx[1][yfork][xfork + 17] = id + 1;//16
				if (dx[1][yfork][xfork + 16] == 0)dx[1][yfork][xfork + 16] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//15
				if (dx[1][yfork][xfork + 15] == 0)dx[1][yfork][xfork + 15] = id + 1;//16
				if (dx[1][yfork][xfork + 16] == 0)dx[1][yfork][xfork + 16] = id + 1;//18
				if (dx[1][yfork][xfork + 18] == 0)dx[1][yfork][xfork + 18] = id + 1;//19
				if (dx[1][yfork][xfork + 19] == 0)dx[1][yfork][xfork + 19] = id + 1;//20
				if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//21
				if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//11
				if (dx[1][yfork][xfork + 11] == 0)dx[1][yfork][xfork + 11] = id + 1;//12
				if (dx[1][yfork][xfork + 12] == 0)dx[1][yfork][xfork + 12] = id + 1;//20
				if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//21
				if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//22
				if (dx[1][yfork][xfork + 22] == 0)dx[1][yfork][xfork + 22] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 8] == 0)dx[1][yfork][xfork + 8] = id + 1;//9
				if (dx[1][yfork][xfork + 9] == 0)dx[1][yfork][xfork + 9] = id + 1;//10
				if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//22
				if (dx[1][yfork][xfork + 22] == 0)dx[1][yfork][xfork + 22] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 7] == 0)dx[1][yfork][xfork + 7] = id + 1;//
				yfork++;

			}
			else
			{
				//左

				if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;
				if (dx[1][yfork][xfork - 33] == 0)dx[1][yfork][xfork - 33] = id + 1;
				if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;
				if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;
				yfork++;
				//右
				if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;
				if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;
				if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;
				if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;
				if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;
				if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;
				yfork++;
				if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;//33
				if (dx[1][yfork][xfork - 33] == 0)dx[1][yfork][xfork - 33] = id + 1;//32
				if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;//31
				if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//30
				if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//29
				if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//28
				if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//27
				if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//26
				if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//25
				if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 33] == 0)dx[1][yfork][xfork - 33] = id + 1;//32
				if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;//31
				if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//30
				if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//29
				if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//28
				if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//27
				if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//26
				if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//24
				if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//23
				if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//22
				if (dx[1][yfork][xfork - 22] == 0)dx[1][yfork][xfork - 22] = id + 1;//21
				if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//30
				if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//29
				if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//28
				if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//27
				if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//26
				if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//25
				if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//24
				if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//23
				if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//22
				if (dx[1][yfork][xfork - 22] == 0)dx[1][yfork][xfork - 22] = id + 1;//21
				if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//20
				if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//19
				if (dx[1][yfork][xfork - 19] == 0)dx[1][yfork][xfork - 19] = id + 1;//18
				if (dx[1][yfork][xfork - 18] == 0)dx[1][yfork][xfork - 18] = id + 1;//17
				if (dx[1][yfork][xfork - 17] == 0)dx[1][yfork][xfork - 17] = id + 1;//16
				if (dx[1][yfork][xfork - 16] == 0)dx[1][yfork][xfork - 16] = id + 1;//15
				if (dx[1][yfork][xfork - 15] == 0)dx[1][yfork][xfork - 15] = id + 1;//14
				if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//13
				if (dx[1][yfork][xfork - 13] == 0)dx[1][yfork][xfork - 13] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//25
				if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//24
				if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//23
				if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//21
				if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//20
				if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//19
				if (dx[1][yfork][xfork - 19] == 0)dx[1][yfork][xfork - 19] = id + 1;//18
				if (dx[1][yfork][xfork - 18] == 0)dx[1][yfork][xfork - 18] = id + 1;//17
				if (dx[1][yfork][xfork - 17] == 0)dx[1][yfork][xfork - 17] = id + 1;//16
				if (dx[1][yfork][xfork - 16] == 0)dx[1][yfork][xfork - 16] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//15
				if (dx[1][yfork][xfork - 15] == 0)dx[1][yfork][xfork - 15] = id + 1;//16
				if (dx[1][yfork][xfork - 16] == 0)dx[1][yfork][xfork - 16] = id + 1;//18
				if (dx[1][yfork][xfork - 18] == 0)dx[1][yfork][xfork - 18] = id + 1;//19
				if (dx[1][yfork][xfork - 19] == 0)dx[1][yfork][xfork - 19] = id + 1;//20
				if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//21
				if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//11
				if (dx[1][yfork][xfork - 11] == 0)dx[1][yfork][xfork - 11] = id + 1;//12
				if (dx[1][yfork][xfork - 12] == 0)dx[1][yfork][xfork - 12] = id + 1;//20
				if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//21
				if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//22
				if (dx[1][yfork][xfork - 22] == 0)dx[1][yfork][xfork - 22] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 8] == 0)dx[1][yfork][xfork - 8] = id + 1;//9
				if (dx[1][yfork][xfork - 9] == 0)dx[1][yfork][xfork - 9] = id + 1;//10
				if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//22
				if (dx[1][yfork][xfork - 22] == 0)dx[1][yfork][xfork - 22] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 7] == 0)dx[1][yfork][xfork - 7] = id + 1;//
				yfork++;
			}
		}
		if (actmonst[id] == 3)//持有的武器
		{
			yfork = ym[id] + 8;
			xfork = xm[id];

			if (conmonst[id] > 0)
			{
				if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//15
				if (dx[1][yfork][xfork - 15] == 0)dx[1][yfork][xfork - 15] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 11] == 0)dx[1][yfork][xfork - 11] = id + 1;//10
				if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//14
				if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 3] == 0)dx[1][yfork][xfork - 3] = id + 1;//4
				if (dx[1][yfork][xfork - 4] == 0)dx[1][yfork][xfork - 4] = id + 1;//5
				if (dx[1][yfork][xfork - 5] == 0)dx[1][yfork][xfork - 5] = id + 1;//6
				if (dx[1][yfork][xfork - 6] == 0)dx[1][yfork][xfork - 6] = id + 1;//7
				if (dx[1][yfork][xfork - 7] == 0)dx[1][yfork][xfork - 7] = id + 1;//8
				if (dx[1][yfork][xfork - 8] == 0)dx[1][yfork][xfork - 8] = id + 1;//9
				if (dx[1][yfork][xfork - 9] == 0)dx[1][yfork][xfork - 9] = id + 1;//10
				if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//11
				if (dx[1][yfork][xfork - 11] == 0)dx[1][yfork][xfork - 11] = id + 1;//12
				if (dx[1][yfork][xfork - 12] == 0)dx[1][yfork][xfork - 12] = id + 1;//13
				if (dx[1][yfork][xfork - 13] == 0)dx[1][yfork][xfork - 13] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 3] == 0)dx[1][yfork][xfork - 3] = id + 1;//
				if (dx[1][yfork][xfork + 3] == 0)dx[1][yfork][xfork + 3] = id + 1;//-3
				if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//
				yfork++;

				if (dx[1][yfork][xfork + 5] == 0)dx[1][yfork][xfork + 5] = id + 1;//7
				if (dx[1][yfork][xfork + 7] == 0)dx[1][yfork][xfork + 7] = id + 1;//8
				if (dx[1][yfork][xfork + 8] == 0)dx[1][yfork][xfork + 8] = id + 1;//9
				if (dx[1][yfork][xfork + 9] == 0)dx[1][yfork][xfork + 9] = id + 1;//10
				if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//11
				if (dx[1][yfork][xfork + 11] == 0)dx[1][yfork][xfork + 11] = id + 1;//12
				if (dx[1][yfork][xfork + 12] == 0)dx[1][yfork][xfork + 12] = id + 1;//13
				if (dx[1][yfork][xfork + 13] == 0)dx[1][yfork][xfork + 13] = id + 1;//14
				if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//
				if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//25
				if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 9] == 0)dx[1][yfork][xfork + 9] = id + 1;//10
				if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//11
				if (dx[1][yfork][xfork + 11] == 0)dx[1][yfork][xfork + 11] = id + 1;//12
				if (dx[1][yfork][xfork + 12] == 0)dx[1][yfork][xfork + 12] = id + 1;//13
				if (dx[1][yfork][xfork + 13] == 0)dx[1][yfork][xfork + 13] = id + 1;//14
				if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//15
				if (dx[1][yfork][xfork + 15] == 0)dx[1][yfork][xfork + 15] = id + 1;//16

				if (dx[1][yfork][xfork + 16] == 0)dx[1][yfork][xfork + 16] = id + 1;//17
				if (dx[1][yfork][xfork + 17] == 0)dx[1][yfork][xfork + 17] = id + 1;//18
				if (dx[1][yfork][xfork + 18] == 0)dx[1][yfork][xfork + 18] = id + 1;//19
				if (dx[1][yfork][xfork + 19] == 0)dx[1][yfork][xfork + 19] = id + 1;//20
				if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//21
				if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//
				if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//24
				if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//21
				if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//22
				if (dx[1][yfork][xfork + 22] == 0)dx[1][yfork][xfork + 22] = id + 1;//23
				if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//24
				if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//25
				if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//26
				if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//27
				if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//28
				if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//21
				if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//
				if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//24
				if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//25
				if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//26
				if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//27
				if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//28
				if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//29
				if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//30
				if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//31
				if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//32
				if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;//33
				if (dx[1][yfork][xfork + 33] == 0)dx[1][yfork][xfork + 33] = id + 1;//34
				if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 18] == 0)dx[1][yfork][xfork + 18] = id + 1;//19
				if (dx[1][yfork][xfork + 19] == 0)dx[1][yfork][xfork + 19] = id + 1;//20
				if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//
				if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//26
				if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//27
				if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//28
				if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//29
				if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//30
				if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//31
				if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//32
				if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;//
				if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;//35
				if (dx[1][yfork][xfork + 35] == 0)dx[1][yfork][xfork + 35] = id + 1;//36
				if (dx[1][yfork][xfork + 36] == 0)dx[1][yfork][xfork + 36] = id + 1;//37
				if (dx[1][yfork][xfork + 37] == 0)dx[1][yfork][xfork + 37] = id + 1;//38
				if (dx[1][yfork][xfork + 38] == 0)dx[1][yfork][xfork + 38] = id + 1;//39
				if (dx[1][yfork][xfork + 39] == 0)dx[1][yfork][xfork + 39] = id + 1;//40
				if (dx[1][yfork][xfork + 40] == 0)dx[1][yfork][xfork + 40] = id + 1;//41
				if (dx[1][yfork][xfork + 41] == 0)dx[1][yfork][xfork + 41] = id + 1;//42
				if (dx[1][yfork][xfork + 42] == 0)dx[1][yfork][xfork + 42] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//29
				if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//30
				if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//31
				if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//32
				if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;//33
				if (dx[1][yfork][xfork + 33] == 0)dx[1][yfork][xfork + 33] = id + 1;//34
				if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;//35
				if (dx[1][yfork][xfork + 35] == 0)dx[1][yfork][xfork + 35] = id + 1;//36
				if (dx[1][yfork][xfork + 36] == 0)dx[1][yfork][xfork + 36] = id + 1;//37
				if (dx[1][yfork][xfork + 37] == 0)dx[1][yfork][xfork + 37] = id + 1;//38
				if (dx[1][yfork][xfork + 38] == 0)dx[1][yfork][xfork + 38] = id + 1;//39
				if (dx[1][yfork][xfork + 39] == 0)dx[1][yfork][xfork + 39] = id + 1;//40
				if (dx[1][yfork][xfork + 40] == 0)dx[1][yfork][xfork + 40] = id + 1;//41
				if (dx[1][yfork][xfork + 41] == 0)dx[1][yfork][xfork + 41] = id + 1;//42
				if (dx[1][yfork][xfork + 42] == 0)dx[1][yfork][xfork + 42] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 35] == 0)dx[1][yfork][xfork + 35] = id + 1;//36
				if (dx[1][yfork][xfork + 36] == 0)dx[1][yfork][xfork + 36] = id + 1;//37
				if (dx[1][yfork][xfork + 37] == 0)dx[1][yfork][xfork + 37] = id + 1;//38
				if (dx[1][yfork][xfork + 38] == 0)dx[1][yfork][xfork + 38] = id + 1;//

			}
			else
			{
				if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//15
				if (dx[1][yfork][xfork + 15] == 0)dx[1][yfork][xfork + 15] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 11] == 0)dx[1][yfork][xfork + 11] = id + 1;//10
				if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//14
				if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 3] == 0)dx[1][yfork][xfork + 3] = id + 1;//4
				if (dx[1][yfork][xfork + 4] == 0)dx[1][yfork][xfork + 4] = id + 1;//5
				if (dx[1][yfork][xfork + 5] == 0)dx[1][yfork][xfork + 5] = id + 1;//6
				if (dx[1][yfork][xfork + 6] == 0)dx[1][yfork][xfork + 6] = id + 1;//7
				if (dx[1][yfork][xfork + 7] == 0)dx[1][yfork][xfork + 7] = id + 1;//8
				if (dx[1][yfork][xfork + 8] == 0)dx[1][yfork][xfork + 8] = id + 1;//9
				if (dx[1][yfork][xfork + 9] == 0)dx[1][yfork][xfork + 9] = id + 1;//10
				if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//11
				if (dx[1][yfork][xfork + 11] == 0)dx[1][yfork][xfork + 11] = id + 1;//12
				if (dx[1][yfork][xfork + 12] == 0)dx[1][yfork][xfork + 12] = id + 1;//13
				if (dx[1][yfork][xfork + 13] == 0)dx[1][yfork][xfork + 13] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork + 3] == 0)dx[1][yfork][xfork + 3] = id + 1;//
				if (dx[1][yfork][xfork - 3] == 0)dx[1][yfork][xfork - 3] = id + 1;//-3
				if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//
				yfork++;

				if (dx[1][yfork][xfork - 5] == 0)dx[1][yfork][xfork - 5] = id + 1;//7
				if (dx[1][yfork][xfork - 7] == 0)dx[1][yfork][xfork - 7] = id + 1;//8
				if (dx[1][yfork][xfork - 8] == 0)dx[1][yfork][xfork - 8] = id + 1;//9
				if (dx[1][yfork][xfork - 9] == 0)dx[1][yfork][xfork - 9] = id + 1;//10
				if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//11
				if (dx[1][yfork][xfork - 11] == 0)dx[1][yfork][xfork - 11] = id + 1;//12
				if (dx[1][yfork][xfork - 12] == 0)dx[1][yfork][xfork - 12] = id + 1;//13
				if (dx[1][yfork][xfork - 13] == 0)dx[1][yfork][xfork - 13] = id + 1;//14
				if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//
				if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//25
				if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 9] == 0)dx[1][yfork][xfork - 9] = id + 1;//10
				if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//11
				if (dx[1][yfork][xfork - 11] == 0)dx[1][yfork][xfork - 11] = id + 1;//12
				if (dx[1][yfork][xfork - 12] == 0)dx[1][yfork][xfork - 12] = id + 1;//13
				if (dx[1][yfork][xfork - 13] == 0)dx[1][yfork][xfork - 13] = id + 1;//14
				if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//15
				if (dx[1][yfork][xfork - 15] == 0)dx[1][yfork][xfork - 15] = id + 1;//16
				if (dx[1][yfork][xfork - 16] == 0)dx[1][yfork][xfork - 16] = id + 1;//17
				if (dx[1][yfork][xfork - 17] == 0)dx[1][yfork][xfork - 17] = id + 1;//18
				if (dx[1][yfork][xfork - 18] == 0)dx[1][yfork][xfork - 18] = id + 1;//19
				if (dx[1][yfork][xfork - 19] == 0)dx[1][yfork][xfork - 19] = id + 1;//20
				if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//21
				if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//
				if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//24
				if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//21
				if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//22
				if (dx[1][yfork][xfork - 22] == 0)dx[1][yfork][xfork - 22] = id + 1;//23
				if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//24
				if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//25
				if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//26
				if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//27
				if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//28
				if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//21
				if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//
				if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//24
				if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//25
				if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//26
				if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//27
				if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//28
				if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//29
				if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//30
				if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//31
				if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//32
				if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;//33
				if (dx[1][yfork][xfork - 33] == 0)dx[1][yfork][xfork - 33] = id + 1;//34
				if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 18] == 0)dx[1][yfork][xfork - 18] = id + 1;//19
				if (dx[1][yfork][xfork - 19] == 0)dx[1][yfork][xfork - 19] = id + 1;//20
				if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//
				if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//26
				if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//27
				if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//28
				if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//29
				if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//30
				if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//31
				if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//32
				if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;//
				if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;//35
				if (dx[1][yfork][xfork - 35] == 0)dx[1][yfork][xfork - 35] = id + 1;//36
				if (dx[1][yfork][xfork - 36] == 0)dx[1][yfork][xfork - 36] = id + 1;//37
				if (dx[1][yfork][xfork - 37] == 0)dx[1][yfork][xfork - 37] = id + 1;//38
				if (dx[1][yfork][xfork - 38] == 0)dx[1][yfork][xfork - 38] = id + 1;//39
				if (dx[1][yfork][xfork - 39] == 0)dx[1][yfork][xfork - 39] = id + 1;//40
				if (dx[1][yfork][xfork - 40] == 0)dx[1][yfork][xfork - 40] = id + 1;//41
				if (dx[1][yfork][xfork - 41] == 0)dx[1][yfork][xfork - 41] = id + 1;//42
				if (dx[1][yfork][xfork - 42] == 0)dx[1][yfork][xfork - 42] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//29
				if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//30
				if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//31
				if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//32
				if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;//33
				if (dx[1][yfork][xfork - 33] == 0)dx[1][yfork][xfork - 33] = id + 1;//34
				if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;//35
				if (dx[1][yfork][xfork - 35] == 0)dx[1][yfork][xfork - 35] = id + 1;//36
				if (dx[1][yfork][xfork - 36] == 0)dx[1][yfork][xfork - 36] = id + 1;//37
				if (dx[1][yfork][xfork - 37] == 0)dx[1][yfork][xfork - 37] = id + 1;//38
				if (dx[1][yfork][xfork - 38] == 0)dx[1][yfork][xfork - 38] = id + 1;//39
				if (dx[1][yfork][xfork - 39] == 0)dx[1][yfork][xfork - 39] = id + 1;//40
				if (dx[1][yfork][xfork - 40] == 0)dx[1][yfork][xfork - 40] = id + 1;//41
				if (dx[1][yfork][xfork - 41] == 0)dx[1][yfork][xfork - 41] = id + 1;//42
				if (dx[1][yfork][xfork - 42] == 0)dx[1][yfork][xfork - 42] = id + 1;//
				yfork++;
				if (dx[1][yfork][xfork - 35] == 0)dx[1][yfork][xfork - 35] = id + 1;//36
				if (dx[1][yfork][xfork - 36] == 0)dx[1][yfork][xfork - 36] = id + 1;//37
				if (dx[1][yfork][xfork - 37] == 0)dx[1][yfork][xfork - 37] = id + 1;//38
				if (dx[1][yfork][xfork - 38] == 0)dx[1][yfork][xfork - 38] = id + 1;//

			}
		
        }
		}
		break;
	}
}

void gametable()
{
	int a, b;
	//for (b = 0;b < 15;b++) 
	for (a = 0;a < 120;a++) { st[15][a] = '+'; }
	for (a = 0;a < 120;a++) { st[28][a] = '+'; }
	for (a = 0;a < 120;a++) { st[32][a] = '+'; }
	for (a = 0;a < 120;a++) { st[45][a] = '+'; }


}

void trader(int x1, int y1, char e) {
	if (e == 0) {
		char Ay = 0;
		y1 = 600 - y1;x1 = x1 + 60;
		if (dx[0][y1][x1] == 0)dx[0][y1][x1] = 19;
		if (dx[0][y1][x1 + 1] == 0)dx[0][y1][x1 + 1] = 19;
		if (dx[0][y1][x1 - 1] == 0)dx[0][y1][x1 - 1] = 19;
		y1++;
		if (dx[0][y1][x1 + 2] == 0)dx[0][y1][x1 + 2] = 19;
		if (dx[0][y1][x1 - 2] == 0)dx[0][y1][x1 - 2] = 19;
		if (dx[0][y1][x1] == 0)dx[0][y1][x1] = 19;
		y1++;
		if (dx[0][y1][x1] == 0)dx[0][y1][x1] = 19;//三层
		if (dx[0][y1][x1 + 1] == 0)dx[0][y1][x1 + 1] = 19;
		if (dx[0][y1][x1 + 2] == 0)dx[0][y1][x1 + 2] = 19;
		if (dx[0][y1][x1 + 3] == 0)dx[0][y1][x1 + 3] = 19;
		if (dx[0][y1][x1 + 4] == 0)dx[0][y1][x1 + 4] = 19;
		if (dx[0][y1][x1 + 5] == 0)dx[0][y1][x1 + 5] = 19;
		if (dx[0][y1][x1 - 1] == 0)dx[0][y1][x1 - 1] = 19;
		if (dx[0][y1][x1 - 2] == 0)dx[0][y1][x1 - 2] = 19;
		y1++;
		if (dx[0][y1][x1] == 0)dx[0][y1][x1] = 19;//四层
		if (dx[0][y1][x1 - 2] == 0)dx[0][y1][x1 - 2] = 19;
		if (dx[0][y1][x1 + 2] == 0)dx[0][y1][x1 + 2] = 19;
		if (dx[0][y1][x1 + 3] == 0)dx[0][y1][x1 + 3] = 19;
		if (dx[0][y1][x1 - 3] == 0)dx[0][y1][x1 - 3] = 19;
		if (dx[0][y1][x1 + 5] == 0)dx[0][y1][x1 + 5] = 19;
		y1++;
		if (dx[0][y1][x1] == 0)dx[0][y1][x1] = 19;//五层
		if (dx[0][y1][x1 + 1] == 0)dx[0][y1][x1 + 1] = 19;
		if (dx[0][y1][x1 - 1] == 0)dx[0][y1][x1 - 1] = 19;
		if (dx[0][y1][x1 - 2] == 0)dx[0][y1][x1 - 2] = 19;
		if (dx[0][y1][x1 + 2] == 0)dx[0][y1][x1 + 2] = 19;
		if (dx[0][y1][x1 + 3] == 0)dx[0][y1][x1 + 3] = 19;
		if (dx[0][y1][x1 - 3] == 0)dx[0][y1][x1 - 3] = 19;
		if (dx[0][y1][x1 + 5] == 0)dx[0][y1][x1 + 5] = 19;
		y1++;
		if (dx[0][y1][x1] == 0)dx[0][y1][x1] = 19;//六层
		if (dx[0][y1][x1 - 2] == 0)dx[0][y1][x1 - 2] = 19;
		if (dx[0][y1][x1 + 2] == 0)dx[0][y1][x1 + 2] = 19;
		if (dx[0][y1][x1 + 3] == 0)dx[0][y1][x1 + 3] = 19;
		if (dx[0][y1][x1 - 3] == 0)dx[0][y1][x1 - 3] = 19;
		if (dx[0][y1][x1 + 4] == 0)dx[0][y1][x1 + 4] = 19;
		if (dx[0][y1][x1 + 5] == 0)dx[0][y1][x1 + 5] = 19;
		y1++;
		//七层
		if (dx[0][y1][x1 - 1] == 0)dx[0][y1][x1 - 1] = 19;
		if (dx[0][y1][x1 + 1] == 0)dx[0][y1][x1 + 1] = 19;
		if (dx[0][y1][x1 + 3] == 0)dx[0][y1][x1 + 3] = 19;
		if (dx[0][y1][x1 - 3] == 0)dx[0][y1][x1 - 3] = 19;

		y1++;//八层
		if (dx[0][y1][x1 - 1] == 0)dx[0][y1][x1 - 1] = 19;
		if (dx[0][y1][x1 + 1] == 0)dx[0][y1][x1 + 1] = 19;
		if (dx[0][y1][x1 + 3] == 0)dx[0][y1][x1 + 3] = 19;
		if (dx[0][y1][x1 - 2] == 0)dx[0][y1][x1 - 2] = 19;
		if (dx[0][y1][x1 + 2] == 0)dx[0][y1][x1 + 2] = 19;
		y1++;//九层
		if (dx[0][y1][x1 - 1] == 0)dx[0][y1][x1 - 1] = 19;
		if (dx[0][y1][x1 + 1] == 0)dx[0][y1][x1 + 1] = 19;
		if (dx[0][y1][x1 + 3] == 0)dx[0][y1][x1 + 3] = 19;
		if (dx[0][y1][x1 - 2] == 0)dx[0][y1][x1 - 2] = 19;
		if (dx[0][y1][x1 + 2] == 0)dx[0][y1][x1 + 2] = 19;
		if (dx[0][y1][x1 - 3] == 0)dx[0][y1][x1 - 3] = 19;
	}
	else //商人对话
	{
		int oo = 15,cc=oo,id=15 ;
		int x2 = x - 18,y2=y-17;
		//商人立绘
		dx[2][y2 + 0][x2 - 5] = id;dx[2][y2 + 0][x2 - 4] = id;dx[2][y2 + 0][x2 - 3] = id;dx[2][y2 + 0][x2 - 2] = id;dx[2][y2 + 0][x2 - 1] = id;dx[2][y2 + 0][x2 + 0] = id;dx[2][y2 + 0][x2 + 1] = id;dx[2][y2 + 0][x2 + 2] = id;dx[2][y2 + 0][x2 + 3] = id;
		dx[2][y2 + 0][x2 + 4] = id;dx[2][y2 + 0][x2 + 5] = id;dx[2][y2 + 0][x2 + 6] = id;dx[2][y2 + 0][x2 + 7] = id;dx[2][y2 + 1][x2 - 7] = id;dx[2][y2 + 1][x2 - 6] = id;dx[2][y2 + 1][x2 - 5] = id;dx[2][y2 + 1][x2 + 7] = id;dx[2][y2 + 1][x2 + 8] = id;
		dx[2][y2 + 1][x2 + 9] = id;dx[2][y2 + 2][x2 - 8] = id;dx[2][y2 + 2][x2 + 8] = id;dx[2][y2 + 2][x2 + 9] = id;dx[2][y2 + 2][x2 + 10] = id;dx[2][y2 + 2][x2 + 11] = id;dx[2][y2 + 3][x2 - 10] = id;dx[2][y2 + 3][x2 - 9] = id;dx[2][y2 + 3][x2 - 7] = id;
		dx[2][y2 + 3][x2 - 6] = id;dx[2][y2 + 3][x2 - 5] = id;dx[2][y2 + 3][x2 - 4] = id;dx[2][y2 + 3][x2 - 3] = id;dx[2][y2 + 3][x2 - 2] = id;dx[2][y2 + 3][x2 - 1] = id;dx[2][y2 + 3][x2 + 0] = id;dx[2][y2 + 3][x2 + 1] = id;dx[2][y2 + 3][x2 + 2] = id;
		dx[2][y2 + 3][x2 + 3] = id;dx[2][y2 + 3][x2 + 4] = id;dx[2][y2 + 3][x2 + 5] = id;dx[2][y2 + 3][x2 + 6] = id;dx[2][y2 + 3][x2 + 7] = id;dx[2][y2 + 3][x2 + 8] = id;dx[2][y2 + 3][x2 + 10] = id;dx[2][y2 + 3][x2 + 11] = id;dx[2][y2 + 4][x2 - 11] = id;
		dx[2][y2 + 4][x2 - 10] = id;dx[2][y2 + 4][x2 - 7] = id;dx[2][y2 + 4][x2 - 6] = id;dx[2][y2 + 4][x2 - 5] = id;dx[2][y2 + 4][x2 - 4] = id;dx[2][y2 + 4][x2 - 3] = id;dx[2][y2 + 4][x2 + 3] = id;dx[2][y2 + 4][x2 + 4] = id;dx[2][y2 + 4][x2 + 5] = id;
		dx[2][y2 + 4][x2 + 8] = id;dx[2][y2 + 4][x2 + 11] = id;dx[2][y2 + 4][x2 + 12] = id;dx[2][y2 + 5][x2 - 12] = id;dx[2][y2 + 5][x2 - 11] = id;dx[2][y2 + 5][x2 - 10] = id;dx[2][y2 + 5][x2 - 6] = id;dx[2][y2 + 5][x2 - 3] = id;dx[2][y2 + 5][x2 - 2] = id;
		dx[2][y2 + 5][x2 - 1] = id;dx[2][y2 + 5][x2 + 0] = id;dx[2][y2 + 5][x2 + 1] = id;dx[2][y2 + 5][x2 + 2] = id;dx[2][y2 + 5][x2 + 8] = id;dx[2][y2 + 5][x2 + 12] = id;dx[2][y2 + 6][x2 - 12] = id;dx[2][y2 + 6][x2 - 11] = id;dx[2][y2 + 6][x2 - 6] = id;
		dx[2][y2 + 6][x2 - 5] = id;dx[2][y2 + 6][x2 - 4] = id;dx[2][y2 + 6][x2 - 3] = id;dx[2][y2 + 6][x2 - 2] = id;dx[2][y2 + 6][x2 - 1] = id;dx[2][y2 + 6][x2 + 1] = id;dx[2][y2 + 6][x2 + 2] = id;dx[2][y2 + 6][x2 + 3] = id;dx[2][y2 + 6][x2 + 4] = id;
		dx[2][y2 + 6][x2 + 5] = id;dx[2][y2 + 6][x2 + 6] = id;dx[2][y2 + 6][x2 + 7] = id;dx[2][y2 + 6][x2 + 8] = id;dx[2][y2 + 6][x2 + 12] = id;dx[2][y2 + 7][x2 - 11] = id;dx[2][y2 + 7][x2 - 5] = id;dx[2][y2 + 7][x2 - 4] = id;dx[2][y2 + 7][x2 - 1] = id;
		dx[2][y2 + 7][x2 + 0] = id;dx[2][y2 + 7][x2 + 1] = id;dx[2][y2 + 7][x2 + 2] = id;dx[2][y2 + 7][x2 + 6] = id;dx[2][y2 + 7][x2 + 7] = id;dx[2][y2 + 7][x2 + 12] = id;dx[2][y2 + 8][x2 - 11] = id;dx[2][y2 + 8][x2 - 10] = id;dx[2][y2 + 8][x2 - 4] = id;
		dx[2][y2 + 8][x2 - 3] = id;dx[2][y2 + 8][x2 + 0] = id;dx[2][y2 + 8][x2 + 1] = id;dx[2][y2 + 8][x2 + 2] = id;dx[2][y2 + 8][x2 + 3] = id;dx[2][y2 + 8][x2 + 4] = id;dx[2][y2 + 8][x2 + 5] = id;dx[2][y2 + 8][x2 + 6] = id;dx[2][y2 + 8][x2 + 11] = id;
		dx[2][y2 + 8][x2 + 12] = id;dx[2][y2 + 9][x2 - 10] = id;dx[2][y2 + 9][x2 - 9] = id;dx[2][y2 + 9][x2 - 3] = id;dx[2][y2 + 9][x2 - 2] = id;dx[2][y2 + 9][x2 - 1] = id;dx[2][y2 + 9][x2 + 4] = id;dx[2][y2 + 9][x2 + 5] = id;dx[2][y2 + 9][x2 + 10] = id;
		dx[2][y2 + 9][x2 + 11] = id;dx[2][y2 + 9][x2 + 12] = id;dx[2][y2 + 10][x2 - 10] = id;dx[2][y2 + 10][x2 - 9] = id;dx[2][y2 + 10][x2 - 8] = id;dx[2][y2 + 10][x2 - 7] = id;dx[2][y2 + 10][x2 - 6] = id;dx[2][y2 + 10][x2 + 3] = id;dx[2][y2 + 10][x2 + 4] = id;
		dx[2][y2 + 10][x2 + 9] = id;dx[2][y2 + 10][x2 + 10] = id;dx[2][y2 + 10][x2 + 13] = id;dx[2][y2 + 10][x2 + 14] = id;dx[2][y2 + 10][x2 + 15] = id;dx[2][y2 + 11][x2 - 14] = id;dx[2][y2 + 11][x2 - 13] = id;dx[2][y2 + 11][x2 - 12] = id;dx[2][y2 + 11][x2 - 11] = id;
		dx[2][y2 + 11][x2 - 9] = id;dx[2][y2 + 11][x2 - 8] = id;dx[2][y2 + 11][x2 - 6] = id;dx[2][y2 + 11][x2 - 5] = id;dx[2][y2 + 11][x2 - 4] = id;dx[2][y2 + 11][x2 - 3] = id;dx[2][y2 + 11][x2 - 2] = id;dx[2][y2 + 11][x2 + 5] = id;dx[2][y2 + 11][x2 + 6] = id;
		dx[2][y2 + 11][x2 + 7] = id;dx[2][y2 + 11][x2 + 9] = id;dx[2][y2 + 11][x2 + 14] = id;dx[2][y2 + 11][x2 + 15] = id;dx[2][y2 + 11][x2 + 16] = id;dx[2][y2 + 11][x2 + 17] = id;dx[2][y2 + 11][x2 + 18] = id;dx[2][y2 + 11][x2 + 19] = id;dx[2][y2 + 12][x2 - 18] = id;
		dx[2][y2 + 12][x2 - 17] = id;dx[2][y2 + 12][x2 - 16] = id;dx[2][y2 + 12][x2 - 15] = id;dx[2][y2 + 12][x2 - 14] = id;dx[2][y2 + 12][x2 - 11] = id;dx[2][y2 + 12][x2 - 9] = id;dx[2][y2 + 12][x2 - 8] = id;dx[2][y2 + 12][x2 - 7] = id;dx[2][y2 + 12][x2 - 6] = id;
		dx[2][y2 + 12][x2 - 2] = id;dx[2][y2 + 12][x2 - 1] = id;dx[2][y2 + 12][x2 + 4] = id;dx[2][y2 + 12][x2 + 5] = id;dx[2][y2 + 12][x2 + 9] = id;dx[2][y2 + 12][x2 + 10] = id;dx[2][y2 + 12][x2 + 11] = id;dx[2][y2 + 12][x2 + 14] = id;dx[2][y2 + 12][x2 + 19] = id;
		dx[2][y2 + 12][x2 + 20] = id;dx[2][y2 + 12][x2 + 21] = id;dx[2][y2 + 12][x2 + 22] = id;dx[2][y2 + 13][x2 - 23] = id;dx[2][y2 + 13][x2 - 22] = id;dx[2][y2 + 13][x2 - 21] = id;dx[2][y2 + 13][x2 - 20] = id;dx[2][y2 + 13][x2 - 19] = id;dx[2][y2 + 13][x2 - 18] = id;
		dx[2][y2 + 13][x2 - 14] = id;dx[2][y2 + 13][x2 - 11] = id;dx[2][y2 + 13][x2 - 10] = id;dx[2][y2 + 13][x2 - 8] = id;dx[2][y2 + 13][x2 - 6] = id;dx[2][y2 + 13][x2 - 5] = id;dx[2][y2 + 13][x2 - 4] = id;dx[2][y2 + 13][x2 - 3] = id;dx[2][y2 + 13][x2 - 2] = id;
		dx[2][y2 + 13][x2 + 4] = id;dx[2][y2 + 13][x2 + 5] = id;dx[2][y2 + 13][x2 + 6] = id;dx[2][y2 + 13][x2 + 7] = id;dx[2][y2 + 13][x2 + 8] = id;dx[2][y2 + 13][x2 + 9] = id;dx[2][y2 + 13][x2 + 10] = id;dx[2][y2 + 13][x2 + 14] = id;dx[2][y2 + 13][x2 + 21] = id;
		dx[2][y2 + 13][x2 + 22] = id;dx[2][y2 + 13][x2 + 23] = id;dx[2][y2 + 13][x2 + 24] = id;dx[2][y2 + 13][x2 + 25] = id;dx[2][y2 + 14][x2 - 24] = id;dx[2][y2 + 14][x2 - 20] = id;dx[2][y2 + 14][x2 - 19] = id;dx[2][y2 + 14][x2 - 14] = id;dx[2][y2 + 14][x2 - 10] = id;
		dx[2][y2 + 14][x2 - 8] = id;dx[2][y2 + 14][x2 - 7] = id;dx[2][y2 + 14][x2 - 2] = id;dx[2][y2 + 14][x2 + 3] = id;dx[2][y2 + 14][x2 + 4] = id;dx[2][y2 + 14][x2 + 7] = id;dx[2][y2 + 14][x2 + 8] = id;dx[2][y2 + 14][x2 + 10] = id;dx[2][y2 + 14][x2 + 14] = id;
		dx[2][y2 + 14][x2 + 22] = id;dx[2][y2 + 14][x2 + 23] = id;dx[2][y2 + 14][x2 + 26] = id;dx[2][y2 + 14][x2 + 27] = id;dx[2][y2 + 15][x2 - 25] = id;dx[2][y2 + 15][x2 - 21] = id;dx[2][y2 + 15][x2 - 20] = id;dx[2][y2 + 15][x2 - 14] = id;dx[2][y2 + 15][x2 - 10] = id;
		dx[2][y2 + 15][x2 - 6] = id;dx[2][y2 + 15][x2 - 5] = id;dx[2][y2 + 15][x2 - 2] = id;dx[2][y2 + 15][x2 - 1] = id;dx[2][y2 + 15][x2 + 2] = id;dx[2][y2 + 15][x2 + 3] = id;dx[2][y2 + 15][x2 + 6] = id;dx[2][y2 + 15][x2 + 7] = id;dx[2][y2 + 15][x2 + 10] = id;
		dx[2][y2 + 15][x2 + 11] = id;dx[2][y2 + 15][x2 + 14] = id;dx[2][y2 + 15][x2 + 15] = id;dx[2][y2 + 15][x2 + 23] = id;dx[2][y2 + 15][x2 + 24] = id;dx[2][y2 + 15][x2 + 27] = id;

		//手臂
		if (trad == 1 || shopper >0)
		{
			dx[2][y2 + 0][x2 + 0] = id;dx[2][y2 + 1][x2 + 39] = id;dx[2][y2 + 1][x2 + 40] = id;dx[2][y2 + 1][x2 + 41] = id;dx[2][y2 + 1][x2 + 42] = id;dx[2][y2 + 1][x2 + 43] = id;dx[2][y2 + 1][x2 + 44] = id;dx[2][y2 + 1][x2 + 45] = id;dx[2][y2 + 2][x2 + 39] = id;
			dx[2][y2 + 2][x2 + 43] = id;dx[2][y2 + 2][x2 + 45] = id;dx[2][y2 + 3][x2 + 37] = id;dx[2][y2 + 3][x2 + 38] = id;dx[2][y2 + 3][x2 + 39] = id;dx[2][y2 + 3][x2 + 44] = id;dx[2][y2 + 3][x2 + 45] = id;dx[2][y2 + 3][x2 + 46] = id;dx[2][y2 + 4][x2 + 37] = id;
			dx[2][y2 + 4][x2 + 38] = id;dx[2][y2 + 4][x2 + 39] = id;dx[2][y2 + 4][x2 + 46] = id;dx[2][y2 + 4][x2 + 47] = id;dx[2][y2 + 5][x2 + 39] = id;dx[2][y2 + 5][x2 + 47] = id;dx[2][y2 + 6][x2 + 39] = id;dx[2][y2 + 6][x2 + 47] = id;dx[2][y2 + 7][x2 + 38] = id;
			dx[2][y2 + 7][x2 + 39] = id;dx[2][y2 + 7][x2 + 47] = id;dx[2][y2 + 8][x2 + 38] = id;dx[2][y2 + 8][x2 + 47] = id;dx[2][y2 + 9][x2 + 38] = id;dx[2][y2 + 9][x2 + 47] = id;dx[2][y2 + 10][x2 + 38] = id;dx[2][y2 + 10][x2 + 47] = id;dx[2][y2 + 11][x2 + 38] = id;
			dx[2][y2 + 11][x2 + 47] = id;dx[2][y2 + 12][x2 + 37] = id;dx[2][y2 + 12][x2 + 38] = id;dx[2][y2 + 12][x2 + 47] = id;dx[2][y2 + 13][x2 + 36] = id;dx[2][y2 + 13][x2 + 47] = id;
		}
		//手臂
		watce("________________________________________________________________________________________", deliver, oo++, 1, 0);
		if (trad == 1)
		{
			if (2 == room)
				watce("md终于遇到活人了，这年头生意真不好做，我是这里的商人，请问有什么事吗？",deliver, oo++,3,0);
			else
				watce("welcome！ 啊哈是你啊，咱又见面了。", deliver, oo++,3,0 );
			
			watce("我需要购买物品吗？（按1进入物品购买）", deliver, oo++,3,0 );
			//房间2特有剧情
			if (2 == room)
			{
				
				watce("该如何离开这里？（按3询问）", deliver, oo++,3,0 );
			}
			//房间2特有剧情
			
			watce("溜了溜了~~~（按0退出）", deliver, oo++,3,0 );
			if (meun == 1) { trad++;system("cls");meun = '?'; }
			if (meun == 0) { trad--;talk = 0;system("cls");exit; }//如果talk=0则将不显示与商人对话
			if (meun == 3) { trad = 3;system("cls");meun = '?'; }
		}
		if (trad == 2)
		{
			watce("按对应数字键选中后即可购买", deliver, oo++,6,0 );
			watce("1云南白药膏", deliver, oo++,3,0 );
			watce("2万能剑油", deliver, oo++, 3, 0);
			watce("3手gun", deliver, oo++, 3, 0);
			watce("4中华大补丸", deliver, oo++, 3, 0);
	
			
			watce("不想买了~~~（按0退出）", deliver, oo++,3,0 );
			switch (shopper)
			{
			case 0:
			{
				switch (meun)
				{
				case 0:trad--;system("cls");meun = '?';               break;
				case 1:shopper = 1;meun = '?';        break;
				case 2:shopper = 2;meun = '?';        break;
				case 3:shopper = 3;meun = '?';        break;
				case 4:shopper = 4;meun = '?';        break;
				default:break;
				}
			}break;
			
			case 1:
			{   watce("$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$", deliver, oo++, 0, 0);
				watce("云南白药膏：回复10体力，有了它妈妈再也不用担心我作死了，购买后直接使用。",deliver, oo++, 3, 0);
				watce("现在不需要998，不需要888，只要8元",deliver, oo++, 3, 0);
				
				watce(" 是否购买            1确定                                    2取消 ",deliver, oo++, 3, 0);
				if (meun == 1) {
					shopper = 0;meun = '?';
					if (m1 >= 8)
					{
						m1 -= 8;//交钱;
						heart1 += 10;//加血
						if (heart1 > heart2)heart1 = heart2;//如果生命超了 
						watce("大爷您收好！(按任意键继续)",deliver, oo++, 3, 0);
						_getch();//停顿一下
					}
					else {
						watce("没钱你买个毛！(按任意键继续)",deliver, oo++, 3, 0);
						_getch();//停顿一下
					}
					system("cls");

				}//确定交易
				if (meun == 2) { shopper = 0;system("cls");meun = '?'; }//取消交易
			}break;
			case 2:
			{
				watce("$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$", deliver, oo++, 0, 0);
				watce(" 万能剑油：利维亚网红裂膜人gay洛特的御用剑油，使你的剑增加永久锋利，购买后直接使用",deliver, oo++, 3, 0);
				watce(" 用完你不会吃亏，不会上当，只要30元",deliver, oo++, 3, 0);
				
				watce("是否购买            1确定                                    2取消",deliver, oo++, 3, 0);
				if (meun == 1) {
					shopper = 0;meun = '?';
					if (m1 >= 30)
					{
						m1 -= 30;//交钱;
						bladehurt += 2;//加攻击 
						watce("大爷您涂好！(按任意键继续)\n",deliver, oo++, 3, 0);
						_getch();//停顿一下
					}
					else {
						watce("没钱你买个毛！(按任意键继续)\n",deliver, oo++, 3, 0);
						_getch();//停顿一下
					}
					system("cls");

				}//确定交易
				if (meun == 2) { shopper = 0;system("cls");meun = '?'; }//取消交易
			}break;
			case 3: {
				watce("$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$", deliver, oo++, 0, 0);
				watce("没货，下一个             ",deliver, oo++, 3, 0);}
					watce("是否购买                                                   2取消                                   ", deliver, oo++, 3, 0);
					if (meun == 2) { shopper = 0;system("cls");meun = '?'; }
					break;
			case 4:
			{
				watce("$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$", deliver, oo++, 0, 0);
				watce("中华大补丸：雄氏老方鼎力推荐，让透支的补起来，永久增加体力，购买后直接使用。",deliver, oo++, 3, 0);
				watce("他好，我也好~~，只要40元",deliver, oo++, 3, 0);
				
				watce("是否购买            1确定                                    2取消                                   ",deliver, oo++, 3, 0);
				if (meun == 1) {
					shopper = 0;meun = '?';
					if (m1 >= 40)
					{
						m1 -= 40;//交钱;
						heart2 += 10;//加血上限 
						watce("大爷您肾好！(按任意键继续)",deliver, oo++, 3, 0);
						_getch();//停顿一下
					}
					else {
						watce("没钱你买个毛！(按任意键继续)",deliver, oo++, 3, 0);
						_getch();//停顿一下
					}
					system("cls");

				}//确定交易
				if (meun == 2) { shopper = 0;system("cls");meun = '?'; }//取消交易
			}break;








			default:break;

			}


		}

		if (room == 2 && trad == 3)
		{
			talkf(91, 97);
			if (meun == 0) {
				trad = 1;talktime = 0;system("cls");meun = '?';
			}




		}





		watce("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~", deliver, oo, 1, 0);
		for (cc++;cc < oo;cc++) 
		{
			watce("{", deliver, cc, 0, 0);
			watce("}", deliver, cc, 0 + 89, 0);
		}
	}

}

void slim(int x2, int y2, int h1, int id, int r)
{/*
  ---------------------------------------------------------------------------------------------------------------------------------------------
                           函数分为逻辑区与对话区
   常用参数 a,b，Ay
   x2					初始化横坐标													y2					初始化纵坐标 
   h1					初始化生命														id					怪物逻辑编号 
   r					怪物寻敌半径													e					是否为逻辑/对话
   die[id]				怪物死亡不在运行标志											i[id]				怪物的实际生命值+1
   x1					怪物横坐标														y1					怪物纵坐标 
   xm[id]				怪物实际横坐标											    	ym[id]				怪物实际纵坐标
   Vy2					怪物当前速度（整型）											max					最大速度 
   yfork				武器横坐标														xfork				武器纵坐标
   nice[id]				怪物善恶值													    ato[id]				怪物当前状态为巡逻/发现敌人
   fag[0]				是前往目标的标志												fag[1]				是第一个目标坐标 
   fag[2]				是第二个目标坐标												fag[3]				是怪物是否落地  
   aY[id]				怪物纵向加速度													axmonst[id]			怪物横向加速度
   actmonst[id]			怪物当前动作模型                                                dx[0][][]=id            怪物在游戏中逻辑层的模型
   vY[id]               怪物当前纵向速度(浮点数)										Vy2[id]				怪物当前纵向速度（整型）
   hurteen[id]          怪物受伤标志                                                    diewordx[0][id]         当怪物战斗中途触发的对话
   axmonst[id]          怪物横向加速度                                                  conmonst[id]        怪物左右朝向
   V1monst[id]          怪物横向速度（浮点数）                                          V2monst[id]         怪物横向速度整型数
   meun                 怪物对话深度（层次）                                            acttime[id]         当前动作持续的帧数（时间）
  ----------------------------------------------------------------------------------------------------------------------------------------------
  */
	x2 = x2 + 30 + 30;
	
	if (die[id] < 1) {
		int x1 = 0, y1 = 0, a = 0, b = 0, Vy2 = 0;
		if (i[id] == 0)//怪物数据函数初始化 
		{
			xm[id] = x2;ym[id] = y2;i[id] = h1 + 1;ym[id] = 600 - ym[id];fag[id][1] = xm[id] + r;fag[id][2] = xm[id] - r;ato[id] = 1;aY[id] = 0;hurteen[id] = i[id];
			actmonst[id] = 0;
		}
		y1 = ym[id];
		//寻敌
		if (y1 - y >= 0 && y1 - y < 15)
		{

			if ((x >= xm[id] && x - xm[id] < 30) || (x < xm[id] && xm[id] - x < 30)) { if (fag[id][3] == 1)ato[id] = 0; }
			else { if (fag[id][3] == 1)ato[id] = 1; }
		}
		else { if (fag[id][3] == 1)ato[id] = 1; }


		actmonst[id]++;
		if (actmonst[id] > 32)actmonst[id] = 0;

		if (ato[id] == 1)//巡航，巡逻
		{
			if (fag[id][0] == 1|| fag[id][0] == 2)
				if ((actmonst[id] == 0&& fag[id][3] == 1) || (actmonst[id] == 10 && fag[id][3] == 1 )|| (actmonst[id] == 20 && fag[id][3] == 1) ||
				actmonst[id] == 1 || actmonst[id] == 11  || actmonst[id] == 21  ||
				actmonst[id] == 2 || actmonst[id] == 12  || actmonst[id] == 22 ) {
					ym[id] -= 2; vY[id] = 0;aY[id] = 0;
			}
			//蹦蹦跳

			//*************************
			//*fag[0]是前往目标的标志 *
			//*fag[1]是第一个目标坐标 *
			//*fag[2]是第二个目标坐标 *
			//*fag[3]是怪物是否落地   *
			//*************************
			if (fag[id][0] == 0) { fag[id][0]=1; }
			
				if (fag[id][0] == 1)
				{
					if (fag[id][1] != xm[id])
					{
						if (fag[id][1] > xm[id])  if (actmonst[id] == 0 || actmonst[id] == 10  || actmonst[id] == 20  ||
							actmonst[id] == 1 || actmonst[id] == 11  || actmonst[id] == 21  ||
							actmonst[id] == 2 || actmonst[id] == 12  || actmonst[id] == 22 ) { xm[id]++; }
						if (fag[id][1] < xm[id]) if (actmonst[id] == 0 || actmonst[id] == 10  || actmonst[id] == 20 ||
							actmonst[id] == 1 || actmonst[id] == 11  || actmonst[id] == 21  ||
							actmonst[id] == 2 || actmonst[id] == 12  || actmonst[id] == 22 ) { xm[id]--; }
					}
					else { fag[id][0]++; }
				}
			
			if (fag[id][0] == 2)
			{
				if (fag[id][2] != xm[id])
				{
					if (fag[id][2] > xm[id])  if (actmonst[id] == 0 || actmonst[id] == 10 || actmonst[id] == 20 ||
						actmonst[id] == 1 || actmonst[id] == 11 || actmonst[id] == 21 ||
						actmonst[id] == 2 || actmonst[id] == 12 || actmonst[id] == 22) {
						xm[id]++;
					}
					if (fag[id][2] < xm[id]) if (actmonst[id] == 0 || actmonst[id] == 10 || actmonst[id] == 20 ||
						actmonst[id] == 1 || actmonst[id] == 11 || actmonst[id] == 21 ||
						actmonst[id] == 2 || actmonst[id] == 12 || actmonst[id] == 22) {
						xm[id]--;
					}
				}
				else { fag[id][0] = 0; }
			}

		}
		else
		{
			if (x > xm[id])xm[id]++;else xm[id]--;
			if (fag[id][3] == 1)ym[id] -= 4;//蹦蹦跳
			
		}



		//猛汉跳楼模拟器
		if (dx[0][ym[id] + 1][xm[id]] != 2 && dx[0][ym[id] + 1][xm[id] + 1] != 2 && dx[0][ym[id] + 1][xm[id] - 1] != 2
			&& dx[0][ym[id] + 1][xm[id]] != 3 && dx[0][ym[id] + 1][xm[id] + 1] != 3 && dx[0][ym[id] + 1][xm[id] - 1] != 3)
		{

			if (aY[id] <= 2) { aY[id] += 0.5; }
			if (vY[id] < 8)vY[id] = vY[id] + aY[id]/1.5;
			Vy2 = vY[id];

			for (a = 0;a < Vy2;a++)//下落检测
			{
				ym[id]++;
				if (dx[0][ym[id] + 1][xm[id]] == 2 || dx[0][ym[id] + 1][xm[id] + 1] == 2 || dx[0][ym[id] + 1][xm[id] - 1] == 2
					||dx[0][ym[id] + 1][xm[id]] == 3 || dx[0][ym[id] + 1][xm[id] + 1] == 3 || dx[0][ym[id] + 1][xm[id] - 1] == 3)
				{
					aY[id] = 0;vY[id] = 0;Vy2 = 0;fag[id][3]=1;break;
				}
				else fag[id][3] = 0;
			}


		}
		if (hurteen[id] != i[id])
		{
			hurteen[id] = i[id];
			延迟(300);
		}

		if (i[id] > 1)
		{//生命等于0时
			if (i[id] < 10000) {

				int *p1;
				
				p1 = &xm[id];
				if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;
				if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
				if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
				if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
				if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
				y1--;
				if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;

				if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;

				if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
				y1--;
				if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;
				if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
				if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
				if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
				if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
				y1--;
				if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;
				if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
				if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;

			}
			else {
				if (i[id] < 10001) { i[id]++;die[id]++; }
			}
		}
		else
		{
			if (dx[1][y1][xm[id]] == id)dx[1][y1][xm[id]] = 0;
			if (dx[1][y1][xm[id] + 1] == id)dx[1][y1][xm[id] + 1] = 0;
			if (dx[1][y1][xm[id] + 2] == id)dx[1][y1][xm[id] + 2] = 0;
			if (dx[1][y1][xm[id] - 1] == id)dx[1][y1][xm[id] - 1] = 0;
			if (dx[1][y1][xm[id] - 2] == id)dx[1][y1][xm[id] - 2] = 0;
			y1--;
			if (dx[1][y1][xm[id]] == id)dx[1][y1][xm[id]] = 0;

			if (dx[1][y1][xm[id] + 2] == id)dx[1][y1][xm[id] + 2] = 0;

			if (dx[1][y1][xm[id] - 2] == id)dx[1][y1][xm[id] - 2] = 0;
			y1--;
			if (dx[1][y1][xm[id]] == id)dx[1][y1][xm[id]] = 0;
			if (dx[1][y1][xm[id] + 1] == id)dx[1][y1][xm[id] + 1] = 0;
			if (dx[1][y1][xm[id] + 2] == id)dx[1][y1][xm[id] + 2] = 0;
			if (dx[1][y1][xm[id] - 1] == id)dx[1][y1][xm[id] - 1] = 0;
			if (dx[1][y1][xm[id] - 2] == id)dx[1][y1][xm[id] - 2] = 0;
			y1--;
			if (dx[1][y1][xm[id]] == id)dx[1][y1][xm[id]] = 0;
			if (dx[1][y1][xm[id] + 1] == id)dx[1][y1][xm[id] + 1] = 0;
			if (dx[1][y1][xm[id] - 1] == id)dx[1][y1][xm[id] - 1] = 0;
			i[id] = 10000;
			mop[room]++;//怪物死亡对关卡的回馈

		}
		
	}
}

void manbat(int x2, int y2, int h1, int id, int r)
{/*
  ---------------------------------------------------------------------------------------------------------------------------------------------
                           函数分为逻辑区与对话区
   常用参数 a,b，Ay
   x2					初始化横坐标													y2					初始化纵坐标 
   h1					初始化生命														id					怪物逻辑编号 
   r					怪物寻敌半径													e					是否为逻辑/对话
   die[id]				怪物死亡不在运行标志											i[id]				怪物的实际生命值+1
   x1					怪物横坐标														y1					怪物纵坐标 
   xm[id]				怪物实际横坐标											    	ym[id]				怪物实际纵坐标
   Vy2					怪物当前速度（整型）											max					最大速度 
   yfork				武器横坐标														xfork				武器纵坐标
   nice[id]				怪物善恶值													    ato[id]				怪物当前状态为巡逻/发现敌人
   fag[0]				是前往目标的标志												fag[1]				是第一个目标坐标 
   fag[2]				是第二个目标坐标												fag[3]				是怪物是否落地  
   aY[id]				怪物纵向加速度													axmonst[id]			怪物横向加速度
   actmonst[id]			怪物当前动作模型                                                dx[0][][]=id            怪物在游戏中逻辑层的模型
   vY[id]               怪物当前纵向速度(浮点数)										Vy2[id]				怪物当前纵向速度（整型）
   hurteen[id]          怪物受伤标志                                                    diewordx[0][id]         当怪物战斗中途触发的对话
   axmonst[id]          怪物横向加速度                                                  conmonst[id]        怪物左右朝向
   V1monst[id]          怪物横向速度（浮点数）                                          V2monst[id]         怪物横向速度整型数
   meun                 怪物对话深度（层次）                                            acttime[id]         当前动作持续的帧数（时间）
  ----------------------------------------------------------------------------------------------------------------------------------------------
  */
	
	if (die[id] < 1) {
		int x1 = 0, y1 = 0, a = 0, b = 0, Vy2 = 0, max = 3, atk = 3;
		if (i[id] == 0)//怪物数据函数初始化 
		{
			x2 = x2 + 30 + 30;
			xm[id] = x2;ym[id] = y2;i[id] = h1 + 1;ym[id] = 600 - ym[id];fag[id][1] = xm[id] + r;fag[id][2] = xm[id] - r;ato[id] = 1;aY[id] = 0;
		}

		//寻敌


		if ((x >= xm[id] && x - xm[id] < 80) || (x < xm[id] && xm[id] - x < 80)) { ato[id] = 0; }
		else { ato[id] = 1; }





		if (ato[id] == 1)//巡航，巡逻
		{
			axmonst[id] = 0;V2monst[id] = 0;V1monst[id] = 0;

		}
		else
		{
			if (x > xm[id]) { if (axmonst[id] < 0)axmonst[id] = 0;axmonst[id]++; }
			else { if (axmonst[id] > 0)axmonst[id] = 0;axmonst[id]--; }
			if (y + 4 > ym[id]) { if (ayfly[id] < 0)ayfly[id] = 0;ayfly[id]++; }
			else { if (ayfly[id] > 0)ayfly[id] = 0;ayfly[id]--; }
			if ((y + 5 - ym[id]<5 && y + 5>ym[id]) || (ym[id] - y - 5 - ym[id]<5 && ym[id]>y + 5))
				if ((x - xm[id]<5 && x > xm[id]) || (xm[id] - x < 5 && x < xm[id])) { heart1 = heart1 - atk; }

		}






		if (axmonst[id] != 0)
		{
			V1monst[id] = V1monst[id] + axmonst[id] / 10;V2monst[id] = V1monst[id];
			if (V1monst[id] <= -max) { V1monst[id] = -max; }
			else if (V1monst[id] >= max) { V1monst[id] = max; }
		}
		if (V2monst[id] > 0)
		{
			{for (a = 0;a < V2monst[id];a++)
			{
				if (
					dx[0][y - 8][x + 2] == 4 || dx[0][y - 7][x + 2] == 4 || dx[0][y - 6][x + 2] == 4 || dx[0][y - 5][x - 2] == 4 || dx[0][y - 4][x + 3] == 4 || dx[0][y - 3][x - 3] == 4 || dx[0][y - 1][x - 2] == 4 || dx[0][y][x - 2] == 4
					)
				{
					V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] - 3;break;
				}

				xm[id]++;
			}
			}

		}
		if (V2monst[id] < 0)
		{
			{for (a = 0;a + V2monst[id];a++)
			{
				if (
					dx[0][y - 8][x - 2] == 4 || dx[0][y - 7][x - 2] == 4 || dx[0][y - 6][x - 2] == 4 || dx[0][y - 5][x - 2] == 4 || dx[0][y - 4][x - 3] == 4 || dx[0][y - 3][x - 3] == 4 || dx[0][y - 1][x - 2] == 4 || dx[0][y][x - 2] == 4
					)
				{
					V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] + 3;break;
				}

				xm[id]--;
			}
			}

		}



		if (ayfly[id] != 0)
		{
			Vy1monst[id] = Vy1monst[id] + ayfly[id] / 10;Vy2monst[id] = Vy1monst[id];
			if (Vy1monst[id] <= -max) { Vy1monst[id] = -max; }
			else if (Vy1monst[id] >= max) { Vy1monst[id] = max; }
		}
		if (Vy2monst[id] > 0)
		{
			{for (a = 0;a < Vy2monst[id];a++)
			{

				if (ym[id] > y + 10) { Vy2monst[id] = 0; Vy1monst[id] = 0;ayfly[id] = 0;ym[id] = ym[id] - 1;break; }
				ym[id]++;
			}
			}

		}
		if (Vy2monst[id] < 0)
		{
			{for (a = 0;a + Vy2monst[id];a++)
			{
				if (ym[id] < y - 20) { Vy2monst[id] = 0;Vy1monst[id] = 0;ayfly[id] = 0;ym[id] = ym[id] + 1;break; }

				ym[id]--;
			}
			}

		}







		y1 = ym[id];
		if (hurteen[id] != i[id])//伤害动画
		{
			hurteen[id] = i[id];
			延迟(300);
		}
		if (i[id] > 1)
		{//生命等于0时
			if (i[id] < 10000) {
				if (dx[1][y1][xm[id]] == 0)dx[1][y1][xm[id]] = 0;
				if (dx[1][y1][xm[id] + 1] == 0)dx[1][y1][xm[id] + 1] = id;
				if (dx[1][y1][xm[id] + 2] == 0)dx[1][y1][xm[id] + 2] = id;
				if (dx[1][y1][xm[id] - 1] == 0)dx[1][y1][xm[id] - 1] = id;
				y1--;
				if (dx[1][y1][xm[id] + 3] == 0)dx[1][y1][xm[id] + 3] = id;
				if (dx[1][y1][xm[id] - 2] == 0)dx[1][y1][xm[id] - 2] = id;
				y1--;
				if (dx[1][y1][xm[id]] == 0)dx[1][y1][xm[id]] = id;//三层
				if (dx[1][y1][xm[id] + 1] == 0)dx[1][y1][xm[id] + 1] = id;
				if (dx[1][y1][xm[id] + 2] == 0)dx[1][y1][xm[id] + 2] = id;
				if (dx[1][y1][xm[id] + 3] == 0)dx[1][y1][xm[id] + 3] = id;
				if (dx[1][y1][xm[id] + 4] == 0)dx[1][y1][xm[id] + 4] = id;
				if (dx[1][y1][xm[id] + 5] == 0)dx[1][y1][xm[id] + 5] = id;
				if (dx[1][y1][xm[id] + 6] == 0)dx[1][y1][xm[id] + 6] = id;
				if (dx[1][y1][xm[id] + 7] == 0)dx[1][y1][xm[id] + 7] = id;
				if (dx[1][y1][xm[id] + 8] == 0)dx[1][y1][xm[id] + 8] = id;
				if (dx[1][y1][xm[id] + 9] == 0)dx[1][y1][xm[id] + 9] = id;
				if (dx[1][y1][xm[id] - 1] == 0)dx[1][y1][xm[id] - 1] = id;
				if (dx[1][y1][xm[id] - 2] == 0)dx[1][y1][xm[id] - 2] = id;
				if (dx[1][y1][xm[id] - 3] == 0)dx[1][y1][xm[id] - 3] = id;
				if (dx[1][y1][xm[id] - 4] == 0)dx[1][y1][xm[id] - 4] = id;
				if (dx[1][y1][xm[id] - 5] == 0)dx[1][y1][xm[id] - 5] = id;
				if (dx[1][y1][xm[id] - 6] == 0)dx[1][y1][xm[id] - 6] = id;
				if (dx[1][y1][xm[id] - 7] == 0)dx[1][y1][xm[id] - 7] = id;
				if (dx[1][y1][xm[id] - 8] == 0)dx[1][y1][xm[id] - 8] = id;
				y1--;
				if (dx[1][y1][xm[id]] == 0)dx[1][y1][xm[id]] = id;//四层
				if (dx[1][y1][xm[id] + 1] == 0)dx[1][y1][xm[id] + 1] = id;
				if (dx[1][y1][xm[id] - 8] == 0)dx[1][y1][xm[id] - 8] = id;
				if (dx[1][y1][xm[id] + 9] == 0)dx[1][y1][xm[id] + 9] = id;
				y1--;
				if (dx[1][y1][xm[id]] == 0)dx[1][y1][xm[id]] = id;//五层
				if (dx[1][y1][xm[id] + 1] == 0)dx[1][y1][xm[id] + 1] = id;
				if (dx[1][y1][xm[id] - 1] == 0)dx[1][y1][xm[id] - 1] = id;
				if (dx[1][y1][xm[id] - 2] == 0)dx[1][y1][xm[id] - 2] = id;
				if (dx[1][y1][xm[id] - 3] == 0)dx[1][y1][xm[id] - 3] = id;
				if (dx[1][y1][xm[id] + 2] == 0)dx[1][y1][xm[id] + 2] = id;
				if (dx[1][y1][xm[id] + 3] == 0)dx[1][y1][xm[id] + 3] = id;
				if (dx[1][y1][xm[id] + 4] == 0)dx[1][y1][xm[id] + 4] = id;
				if (dx[1][y1][xm[id] - 8] == 0)dx[1][y1][xm[id] - 8] = id;
				if (dx[1][y1][xm[id] + 9] == 0)dx[1][y1][xm[id] + 9] = id;
				y1--;
				if (dx[1][y1][xm[id]] == 0)dx[1][y1][xm[id]] = id;
				if (dx[1][y1][xm[id] + 1] == 0)dx[1][y1][xm[id] + 1] = id;//六层
				if (dx[1][y1][xm[id] - 1] == 0)dx[1][y1][xm[id] - 1] = id;
				if (dx[1][y1][xm[id] - 2] == 0)dx[1][y1][xm[id] - 2] = id;
				if (dx[1][y1][xm[id] - 4] == 0)dx[1][y1][xm[id] - 4] = id;
				if (dx[1][y1][xm[id] + 2] == 0)dx[1][y1][xm[id] + 2] = id;
				if (dx[1][y1][xm[id] + 3] == 0)dx[1][y1][xm[id] + 3] = id;
				if (dx[1][y1][xm[id] + 5] == 0)dx[1][y1][xm[id] + 5] = id;
				if (dx[1][y1][xm[id] - 7] == 0)dx[1][y1][xm[id] - 7] = id;
				if (dx[1][y1][xm[id] + 8] == 0)dx[1][y1][xm[id] + 8] = id;
				y1--;
				if (dx[1][y1][xm[id] - 1] == 0)dx[1][y1][xm[id] - 1] = id;
				if (dx[1][y1][xm[id] - 2] == 0)dx[1][y1][xm[id] - 2] = id;
				if (dx[1][y1][xm[id] + 2] == 0)dx[1][y1][xm[id] + 2] = id;
				if (dx[1][y1][xm[id] + 3] == 0)dx[1][y1][xm[id] + 3] = id;
				if (dx[1][y1][xm[id] - 6] == 0)dx[1][y1][xm[id] - 6] = id;
				if (dx[1][y1][xm[id] - 5] == 0)dx[1][y1][xm[id] - 5] = id;
				if (dx[1][y1][xm[id] + 6] == 0)dx[1][y1][xm[id] + 6] = id;
				if (dx[1][y1][xm[id] + 7] == 0)dx[1][y1][xm[id] + 7] = id;
				y1--;
				if (dx[1][y1][xm[id] - 2] == 0)dx[1][y1][xm[id] - 2] = id;
				if (dx[1][y1][xm[id] + 3] == 0)dx[1][y1][xm[id] + 3] = id;
			}
			else {
				if (i[id] < 10001) { i[id]++;die[id]++; }
			}
		}
		else
		{
			
			i[id] = 10000;
			mop[room]++;//怪物死亡对关卡的回馈

		}
		if (fag[id][3] > 1)fag[id][3] = 0;
	}
}

void hardso(int x2, int y2, int h1, int id, int r, int e)
{/*
  ---------------------------------------------------------------------------------------------------------------------------------------------
                           函数分为逻辑区与对话区
   常用参数 a,b，Ay
   x2					初始化横坐标													y2					初始化纵坐标 
   h1					初始化生命														id					怪物逻辑编号 
   r					怪物寻敌半径													e					是否为逻辑/对话
   die[id]				怪物死亡不在运行标志											i[id]				怪物的实际生命值+1
   x1					怪物横坐标														y1					怪物纵坐标 
   xm[id]				怪物实际横坐标											    	ym[id]				怪物实际纵坐标
   Vy2					怪物当前速度（整型）											max					最大速度 
   yfork				武器横坐标														xfork				武器纵坐标
   nice[id]				怪物善恶值													    ato[id]				怪物当前状态为巡逻/发现敌人
   fag[0]				是前往目标的标志												fag[1]				是第一个目标坐标 
   fag[2]				是第二个目标坐标												fag[3]				是怪物是否落地  
   aY[id]				怪物纵向加速度													axmonst[id]			怪物横向加速度
   actmonst[id]			怪物当前动作模型                                                dx[0][][]=id            怪物在游戏中逻辑层的模型
   vY[id]               怪物当前纵向速度(浮点数)										Vy2[id]				怪物当前纵向速度（整型）
   hurteen[id]          怪物受伤标志                                                    diewordx[0][id]         当怪物战斗中途触发的对话
   axmonst[id]          怪物横向加速度                                                  conmonst[id]        怪物左右朝向
   V1monst[id]          怪物横向速度（浮点数）                                          V2monst[id]         怪物横向速度整型数
   meun                 怪物对话深度（层次）                                            acttime[id]         当前动作持续的帧数（时间）
  ----------------------------------------------------------------------------------------------------------------------------------------------
  */
	
	if (die[id] < 1)
	{
		int x1 = 0, y1 = 0, a = 0, b = 0, Vy2 = 0, c = 0, max = 3, atk = 3, yfork = 0, xfork = 0, cas = 10;
		if (e == 0)
		{
			if (i[id] == 0)//怪物数据函数初始化 
			{
				x2 = x2 + 30 + 30;
				xm[id] = x2;ym[id] = y2;i[id] = h1 + 1;ym[id] = 600 - ym[id];fag[id][1] = xm[id] + r;fag[id][2] = xm[id] - r;ato[id] = 1;aY[id] = 0;ni[id] = -1;
			}

			//寻敌

			if (nice[id] < 0)
			{
				if ((x >= xm[id] && x - xm[id] < 600) || (x < xm[id] && xm[id] - x < 600)) { ato[id] = 0;hdso = 0;talk = 0; }
				else { ato[id] = 1; }
			}
			else { ato[id] = 1; }





			if (ato[id] == 1)//巡航，巡逻,待命
			{
				axmonst[id] = 0;V2monst[id] = 0;V1monst[id] = 0;actmonst[id] = 0;

			}
			else
			{
				if (actmonst[id] != 3)if (x >= xm[id]) { conmonst[id] = 1; }
				else { conmonst[id] = -1; }//自身朝向位置
				if (x > xm[id])//对敌人位置的判断
				{
					if (x > xm[id] + 33)
					{
						if (actmonst[id] == 1 || actmonst[id] == 0) { if (axmonst[id] < 0)axmonst[id] = 0;axmonst[id]++; }
					}
					else
					{
						if (x > xm[id] + 17)
						{
							if (actmonst[id] < 2)actmonst[id] = 1;
							axmonst[id] = 0;
							V2monst[id] = 0;
						}
						else { axmonst[id]--; }
					}
				}
				else
				{
					if (x < xm[id] - 33) {
						if (actmonst[id] == 1 || actmonst[id] == 0) { if (axmonst[id] > 0)axmonst[id] = 0;axmonst[id]--; }
					}
					else
					{
						if (x < xm[id] - 17)
						{
							axmonst[id] = 0;
							V2monst[id] = 0;
							if (actmonst[id] < 2)actmonst[id] = 1;
						}
						else { axmonst[id]++; }
					}

				}
				/*if (y + 4 > ym[id]) { if (ayfly[id] < 0)ayfly[id] = 0;ayfly[id]++; }
				else { if (ayfly[id] > 0)ayfly[id] = 0;ayfly[id]--; }
				if ((y + 5 - ym[id]<5 && y + 5>ym[id]) || (ym[id] - y - 5 - ym[id]<5 && ym[id]>y + 5))
					if ((x - xm[id]<5 && x > xm[id]) || (xm[id] - x < 5 && x < xm[id])) { heart1 = heart1 - atk; }*/

			}
			{//怪物动作与时间
				if (actmonst[id] == 1)
				{
					acttime[id]++;
					if (acttime[id] > 17)
					{
						actmonst[id] = 2;acttime[id] = 0;
					}
				}//怪物动作及时间判定

				if (actmonst[id] == 2)
				{
					acttime[id]++;
					if (acttime[id] > 1) {
						acttime[id] = 0;actmonst[id] = 3;
						if (conmonst[id] == -1)
						{
							for (b = -5;b < 18;b++)
							{
								c = b / 2;
								for (a = 3;a < 32 + c;a++)

									if (dx[1][ym[id] + b][xm[id] - a] == 1) { heart1 = heart1 - 9;goto hardsobreak; }
							}
						}
						else
						{
							for (b = -5;b < 18;b++)
							{
								c = b / 2;
								for (a = 3;a < 32 + c;a++)

									if (dx[1][ym[id] + b][xm[id] + a] == 1) { heart1 = heart1 - 9;goto hardsobreak; }
							}
						}

					}
				}
			hardsobreak:;
				if (actmonst[id] == 3)
				{
					acttime[id]++;
					axmonst[id] = 0;
					V2monst[id] = 0;
					if (acttime[id] > 45) {
						acttime[id] = 0;actmonst[id] = 0;
					}
				}
			}//怪物动作与时间

			if (axmonst[id] != 0)
			{
				V1monst[id] = V1monst[id] + axmonst[id] / 10;V2monst[id] = V1monst[id];
				if (V1monst[id] <= -2) {
					V1monst[id] = -0;
				}
				else if (V1monst[id] >= 2) {
					V1monst[id] = 0;
				}
			}
			if (V2monst[id] > 0)
			{

				{for (a = 0;a < V2monst[id];a++)
				{
					if (
						dx[0][ym[id] - 8][xm[id] + 2] == 3 || dx[0][ym[id] - 7][xm[id] + 2] == 3 || dx[0][ym[id] - 6][xm[id] + 2] == 3 || dx[0][ym[id] - 5][xm[id] - 2] == 3 || dx[0][ym[id] - 4][xm[id] + 3] == 3 || dx[0][ym[id] - 3][xm[id] - 3] == 3 || dx[0][ym[id] - 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
						)
					{
						V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] - 3;break;
					}

					xm[id]++;
				}
				}

			}
			if (V2monst[id] < 0)
			{

				{for (a = 0;a + V2monst[id];a++)
				{
					if (
						dx[0][ym[id] - 8][xm[id] - 2] == 3 || dx[0][ym[id] - 7][xm[id] - 2] == 3 || dx[0][ym[id] - 6][xm[id] - 2] == 3 || dx[0][ym[id] - 5][xm[id] - 2] == 3 || dx[0][ym[id] - 4][xm[id] - 3] == 3 || dx[0][ym[id] - 3][xm[id] - 3] == 3 || dx[0][ym[id] - 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
						)
					{
						V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] + 3;break;
					}

					xm[id]--;
				}
				}

			}


			/*if (aY[e] <= 2) { aY[e] += 0.5; }
		if (vY[e] < 8)vY[e] = vY[e] + aY[e];
		Vy2 = vY[e];

		for (a = 0;a < Vy2;a++)//下落检测
		{
			ym[e]++;
			if (dx[0][ym[e] + 9][xm[e]] == 2 || dx[0][ym[e] + 9][xm[e] + 1] == 2 || dx[0][ym[e] + 9][xm[e] - 1] == 2 || dx[0][ym[e] + 9][xm[e]] == 3 || dx[0][ym[e] + 9][xm[e] + 1] == 3 || dx[0][ym[e] + 9][xm[e] - 1] == 3)
			{
				aY[e] = 0;vY[e] = 0;Vy2 = 0;fag[e][3]++;break;
			}
		}*/


			//猛汉跳楼模拟器
			if (dx[0][ym[id] + 19][xm[id]] != 2 && dx[0][ym[id] + 19][xm[id] + 1] != 2 && dx[0][ym[id] + 19][xm[id] - 1] != 2)
			{

				if (aY[id] <= 2) { aY[id] += 0.5; }
				if (vY[id] < 8)vY[id] = vY[id] + aY[id] / 1.5;
				Vy2 = vY[id];

				for (a = 0;a < Vy2;a++)//下落检测
				{
					ym[id]++;
					if (dx[0][ym[id] + 19][xm[id]] == 2 || dx[0][ym[id] + 19][xm[id] + 1] == 2 || dx[0][ym[id] + 19][xm[id] - 1] == 2)
					{
						aY[id] = 0;vY[id] = 0;Vy2 = 0;fag[id][3] = 1;break;
					}
					else fag[id][3] = 0;
				}


			}

			
			y1 = ym[id];
			if (hurteen[id] != i[id])//伤害动画
			{
				hurteen[id] = i[id];
				延迟(300);
			}
			if (i[id] > 1)
			{//生命等于0时
				//怪物图像
				if (i[id] < 10000)
				{
					mondel(xm[id],y1,xfork,yfork,cas,id);
					


				}
				//怪物图像
				else
				{
					if (i[id] < 10001) {
						i[id]++;die[id]++; mop[room]++;
					}
				}


				if (i[id] < h1/4 && ni[id] == -1) { dieword = id;nice[id] = 0;ni[id] = -2;mop[room]++; }//当怪物体力掉到一定程度求饶时,ni用来防止触发第二次



			}
			else//死亡触发
		{i[id] = 10000;}

			if (fag[id][3] > 1)fag[id][3] = 0;//怪物动作状态







		}
		else//对话栏
		{
			if (nice[id] == 0)
			{
				if (nice[id] == 5)
				{


				}

				printf("#############################################################################################################################################\n");
				if (hdso == 1)
				{
					if (51 == room) {



						talkf(81, 86);

						//房间2特有剧情

						if (meun == 1)
						{
							hdso++;system("cls");talktime = 0;meun = '?'; mop[room]++;
						}
						if (meun == 3) { hdso = 3;system("cls");talktime = 0;meun = '?'; }
						if (meun == 0) { hdso--;hdso = 0;system("cls");talktime = 0;exit; }//如果talk=0则将不显示与商人对话}
					}
				}
				if (hdso == 2)
				{
					if (51 == room)
					{
						talktime++;
						if (talktime > 0)printf("                                 穿越者吗？有点意思。。。。。。                                                           \n");//
						if (talktime > 20)printf("                                 不过看你的样子也不像这片大陆上的人                                                           \n");//
						if (talktime > 40)printf("                                 小子，我姑且就信你一回                                                           \n");//
						if (talktime > 60)printf("                                 向我背后走去，那里便是出口                                                           \n");//
						if (talktime > 80)printf("                                 如果你见到国王，记得替我向他问好                                                           \n");//
						if (talktime > 100)printf("                                 咱有缘再见                                                           \n");//
						if (talktime > 120)printf("                                                     溜了溜了~~~（按0退出）\n");
						if (talktime > 120)talktime = 120;
						if (meun == 0) { hdso--;hdso = 0;system("cls");talktime = 0;talk = 0;nice[id] = 1;exit; }//如果talk=0则将不显示与商人对话}
					}
				}

				if (room == 51 && hdso == 3)
				{
					talktime++;
					if (talktime > 0)printf("                                 国王的亲信？                                                                                                                                                                                        \n");//printf("\n");小子，就凭你还想戏弄我？
					if (talktime > 20)printf("                                 小子，就凭你还想戏弄我？                                                                                                                                                                                        \n");//printf("\n");找死
					if (talktime > 40)printf("                                 找死                                                                                                                                                                                        \n");//printf("\n");
					if (talktime > 60) { hdso = 0;talktime = 0;system("cls");talk = 0;nice[id] = ni[id];meun = '?'; }





				}





				printf("#############################################################################################################################################\n");
			}
			if (nice[id] == 1) { printf("走吧，年轻人，不要忘记带上上面宝箱里的奖励"); }

		}

	}
}

void scp6789(int x2, int y2, int h1, int id, int r, int e)
{/*
  ---------------------------------------------------------------------------------------------------------------------------------------------
						   函数分为逻辑区与对话区
   常用参数 a,b，Ay
   x2					初始化横坐标													y2					初始化纵坐标
   h1					初始化生命														id					怪物逻辑编号
   r					怪物寻敌半径													e					是否为逻辑/对话
   die[id]				怪物死亡不在运行标志											i[id]				怪物的实际生命值+1
   x1					怪物横坐标														y1					怪物纵坐标
   xm[id]				怪物实际横坐标											    	ym[id]				怪物实际纵坐标
   Vy2					怪物当前速度（整型）											max					最大速度
   yfork				武器横坐标														xfork				武器纵坐标
   nice[id]				怪物善恶值													    ato[id]				怪物当前状态为巡逻/发现敌人
   fag[0]				是前往目标的标志												fag[1]				是第一个目标坐标
   fag[2]				是第二个目标坐标												fag[3]				是怪物是否落地
   aY[id]				怪物纵向加速度													axmonst[id]			怪物横向加速度
   actmonst[id]			怪物当前动作模型                                                dx[0][][]=id            怪物在游戏中逻辑层的模型
   vY[id]               怪物当前纵向速度(浮点数)										Vy2[id]				怪物当前纵向速度（整型）
   hurteen[id]          怪物受伤标志                                                    diewordx[0][id]         当怪物战斗中途触发的对话
   axmonst[id]          怪物横向加速度                                                  conmonst[id]        怪物左右朝向
   V1monst[id]          怪物横向速度（浮点数）                                          V2monst[id]         怪物横向速度整型数
   meun                 怪物对话深度（层次）                                            acttime[id]         当前动作持续的帧数（时间）
  ----------------------------------------------------------------------------------------------------------------------------------------------
  */
	
	if (die[id] < 1)
	{
		int x1 = 0, y1 = 0, a = 0, b = 0, Vy2 = 0, c = 0, max = 3, atk = 3, yfork = 0, xfork = 0;
		 short int yugo=0;
		if (e == 0)
		{
			if (i[id] == 0)//怪物数据函数初始化 
			{
				x2 = x2 + 30 + 30;
				xm[id] = x2;ym[id] = y2;i[id] = h1 + 1;ym[id] = 600 - ym[id];fag[id][1] = xm[id] + r;fag[id][2] = xm[id] - r;ato[id] = 1;aY[id] = 0;ni[id] = -1;
			}

			//寻敌

			if (nice[id] < 0)
			{
				if ((x >= xm[id] && x - xm[id] < 600) || (x < xm[id] && xm[id] - x < 600)) { ato[id] = 0; }
				else { ato[id] = 1; }
			}
			else { ato[id] = 1; }





			//if (ato[id] == 1)//巡航，巡逻,待命
			//{
			//	
			//}
			//else
			//{
			//}

			if (xm[id] < x) { xm[id]++;if (actmonst[id] > 30)conmonst[id] = 1; }
			else{ xm[id]--;if (actmonst[id] > 30)conmonst[id] = -1;
		}


			if (actmonst[id]++ > 60)actmonst[id] = 0;
			
			if (conmonst[id] == 1) {
				yfork = ym[id] + 30;
				xfork = xm[id] + 30;

			}
			else
			{
				yfork = ym[id]+30;
				xfork = xm[id]-30;



			}

			switch (actmonst[id])
			{
			case 1:yfork = ym[id];xfork = xm[id];
			case 2:if (conmonst[id] == 1) {yfork -= 1;xfork -= 1;}else{yfork -= 1;xfork += 1;}
			case 3:if (conmonst[id] == 1) {yfork -= 1;xfork -= 1;}else{yfork -= 1;xfork += 1;}
				   
			case 4:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
				   else { yfork -= 1;xfork += 1; }
			case 5:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
				   else { yfork -= 1;xfork += 1; }
			case 6:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
				   else { yfork -= 1;xfork += 1; }
			case 7:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
				   else { yfork -= 1;xfork += 1; }
			case 8:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
				   else { yfork -= 1;xfork += 1; }
			case 9:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
				   else { yfork -= 1;xfork += 1; }
			case 10:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 11:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 12:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 13:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 14:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 15:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 16:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 17:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 18:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 19:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 20:	if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
						else { yfork -= 1;xfork += 1; }
			case 21:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 22:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 23:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 24:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 25:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 26:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 27:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 28:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 29:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
			case 30:if (conmonst[id] == 1) { yfork -= 1;xfork -= 1; }
					else { yfork -= 1;xfork += 1; }
				if (conmonst[id] == 1) {

					if (dx[1][yfork - 3][xfork + 12] == 0)dx[1][yfork - 3][xfork + 12] = 25;if (dx[1][yfork - 3][xfork + 24] == 0)dx[1][yfork - 3][xfork + 24] = 25;if (dx[1][yfork - 2][xfork + 10] == 0)dx[1][yfork - 2][xfork + 10] = 25;if (dx[1][yfork - 2][xfork + 11] == 0)dx[1][yfork - 2][xfork + 11] = 25;if (dx[1][yfork - 2][xfork + 24] == 0)dx[1][yfork - 2][xfork + 24] = 25;if (dx[1][yfork - 1][xfork + 8] == 0)dx[1][yfork - 1][xfork + 8] = 25; 
						if (dx[1][yfork - 1][xfork + 9] == 0)dx[1][yfork - 1][xfork + 9] = 25;if (dx[1][yfork - 1][xfork + 10] == 0)dx[1][yfork - 1][xfork + 10] = 25;if (dx[1][yfork - 1][xfork + 11] == 0)dx[1][yfork - 1][xfork + 11] = 25;if (dx[1][yfork - 1][xfork + 23] == 0)dx[1][yfork - 1][xfork + 23] = 25;if (dx[1][yfork - 1][xfork + 24] == 0)dx[1][yfork - 1][xfork + 24] = 25;if (dx[1][yfork + 0][xfork + 6] == 0)dx[1][yfork + 0][xfork + 6] = 25; 
							if (dx[1][yfork + 0][xfork + 7] == 0)dx[1][yfork + 0][xfork + 7] = 25;if (dx[1][yfork + 0][xfork + 8] == 0)dx[1][yfork + 0][xfork + 8] = 25;if (dx[1][yfork + 0][xfork + 9] == 0)dx[1][yfork + 0][xfork + 9] = 25;if (dx[1][yfork + 0][xfork + 22] == 0)dx[1][yfork + 0][xfork + 22] = 25;if (dx[1][yfork + 0][xfork + 23] == 0)dx[1][yfork + 0][xfork + 23] = 25;if (dx[1][yfork + 1][xfork + 3] == 0)dx[1][yfork + 1][xfork + 3] = 25; 
								if (dx[1][yfork + 1][xfork + 4] == 0)dx[1][yfork + 1][xfork + 4] = 25;if (dx[1][yfork + 1][xfork + 5] == 0)dx[1][yfork + 1][xfork + 5] = 25;if (dx[1][yfork + 1][xfork + 6] == 0)dx[1][yfork + 1][xfork + 6] = 25;if (dx[1][yfork + 1][xfork + 7] == 0)dx[1][yfork + 1][xfork + 7] = 25;if (dx[1][yfork + 1][xfork + 20] == 0)dx[1][yfork + 1][xfork + 20] = 25;if (dx[1][yfork + 1][xfork + 21] == 0)dx[1][yfork + 1][xfork + 21] = 25; 
									if (dx[1][yfork + 1][xfork + 22] == 0)dx[1][yfork + 1][xfork + 22] = 25;if (dx[1][yfork + 2][xfork + 0] == 0)dx[1][yfork + 2][xfork + 0] = 25;if (dx[1][yfork + 2][xfork + 1] == 0)dx[1][yfork + 2][xfork + 1] = 25;if (dx[1][yfork + 2][xfork + 2] == 0)dx[1][yfork + 2][xfork + 2] = 25;if (dx[1][yfork + 2][xfork + 3] == 0)dx[1][yfork + 2][xfork + 3] = 25;if (dx[1][yfork + 2][xfork + 4] == 0)dx[1][yfork + 2][xfork + 4] = 25; 
										if (dx[1][yfork + 2][xfork + 5] == 0)dx[1][yfork + 2][xfork + 5] = 25;if (dx[1][yfork + 2][xfork + 19] == 0)dx[1][yfork + 2][xfork + 19] = 25;if (dx[1][yfork + 2][xfork + 20] == 0)dx[1][yfork + 2][xfork + 20] = 25;if (dx[1][yfork + 3][xfork - 4] == 0)dx[1][yfork + 3][xfork - 4] = 25;if (dx[1][yfork + 3][xfork - 3] == 0)dx[1][yfork + 3][xfork - 3] = 25;if (dx[1][yfork + 3][xfork - 2] == 0)dx[1][yfork + 3][xfork - 2] = 25; 
											if (dx[1][yfork + 3][xfork - 1] == 0)dx[1][yfork + 3][xfork - 1] = 25;if (dx[1][yfork + 3][xfork + 0] == 0)dx[1][yfork + 3][xfork + 0] = 25;if (dx[1][yfork + 3][xfork + 1] == 0)dx[1][yfork + 3][xfork + 1] = 25;if (dx[1][yfork + 3][xfork + 2] == 0)dx[1][yfork + 3][xfork + 2] = 25;if (dx[1][yfork + 3][xfork + 16] == 0)dx[1][yfork + 3][xfork + 16] = 25;if (dx[1][yfork + 3][xfork + 17] == 0)dx[1][yfork + 3][xfork + 17] = 25; 
												if (dx[1][yfork + 3][xfork + 18] == 0)dx[1][yfork + 3][xfork + 18] = 25;if (dx[1][yfork + 3][xfork + 19] == 0)dx[1][yfork + 3][xfork + 19] = 25;if (dx[1][yfork + 4][xfork - 8] == 0)dx[1][yfork + 4][xfork - 8] = 25;if (dx[1][yfork + 4][xfork - 7] == 0)dx[1][yfork + 4][xfork - 7] = 25;if (dx[1][yfork + 4][xfork - 6] == 0)dx[1][yfork + 4][xfork - 6] = 25;if (dx[1][yfork + 4][xfork - 5] == 0)dx[1][yfork + 4][xfork - 5] = 25; 
													if (dx[1][yfork + 4][xfork - 4] == 0)dx[1][yfork + 4][xfork - 4] = 25;if (dx[1][yfork + 4][xfork - 3] == 0)dx[1][yfork + 4][xfork - 3] = 25;if (dx[1][yfork + 4][xfork + 14] == 0)dx[1][yfork + 4][xfork + 14] = 25;if (dx[1][yfork + 4][xfork + 15] == 0)dx[1][yfork + 4][xfork + 15] = 25;if (dx[1][yfork + 4][xfork + 16] == 0)dx[1][yfork + 4][xfork + 16] = 25;if (dx[1][yfork + 5][xfork + 12] == 0)dx[1][yfork + 5][xfork + 12] = 25;        
														if (dx[1][yfork + 5][xfork + 13] == 0)dx[1][yfork + 5][xfork + 13] = 25;if (dx[1][yfork + 5][xfork + 14] == 0)dx[1][yfork + 5][xfork + 14] = 25;if (dx[1][yfork + 6][xfork + 9] == 0)dx[1][yfork + 6][xfork + 9] = 25;if (dx[1][yfork + 6][xfork + 10] == 0)dx[1][yfork + 6][xfork + 10] = 25;if (dx[1][yfork + 6][xfork + 11] == 0)dx[1][yfork + 6][xfork + 11] = 25;if (dx[1][yfork + 6][xfork + 12] == 0)dx[1][yfork + 6][xfork + 12] = 25;          
															if (dx[1][yfork + 7][xfork + 6] == 0)dx[1][yfork + 7][xfork + 6] = 25;if (dx[1][yfork + 7][xfork + 7] == 0)dx[1][yfork + 7][xfork + 7] = 25;if (dx[1][yfork + 7][xfork + 8] == 0)dx[1][yfork + 7][xfork + 8] = 25;if (dx[1][yfork + 7][xfork + 9] == 0)dx[1][yfork + 7][xfork + 9] = 25;if (dx[1][yfork + 8][xfork - 3] == 0)dx[1][yfork + 8][xfork - 3] = 25;if (dx[1][yfork + 8][xfork - 2] == 0)dx[1][yfork + 8][xfork - 2] = 25;
																if (dx[1][yfork + 8][xfork - 1] == 0)dx[1][yfork + 8][xfork - 1] = 25;if (dx[1][yfork + 8][xfork + 0] == 0)dx[1][yfork + 8][xfork + 0] = 25;if (dx[1][yfork + 8][xfork + 1] == 0)dx[1][yfork + 8][xfork + 1] = 25;if (dx[1][yfork + 8][xfork + 2] == 0)dx[1][yfork + 8][xfork + 2] = 25;if (dx[1][yfork + 8][xfork + 3] == 0)dx[1][yfork + 8][xfork + 3] = 25;if (dx[1][yfork + 8][xfork + 4] == 0)dx[1][yfork + 8][xfork + 4] = 25;           
																	if (dx[1][yfork + 8][xfork + 5] == 0)dx[1][yfork + 8][xfork + 5] = 25;if (dx[1][yfork + 8][xfork + 6] == 0)dx[1][yfork + 8][xfork + 6] = 25;if (dx[1][yfork + 9][xfork - 12] == 0)dx[1][yfork + 9][xfork - 12] = 25;if (dx[1][yfork + 9][xfork - 11] == 0)dx[1][yfork + 9][xfork - 11] = 25;if (dx[1][yfork + 9][xfork - 10] == 0)dx[1][yfork + 9][xfork - 10] = 25;if (dx[1][yfork + 9][xfork - 9] == 0)dx[1][yfork + 9][xfork - 9] = 25; 
																		if (dx[1][yfork + 9][xfork - 8] == 0)dx[1][yfork + 9][xfork - 8] = 25;if (dx[1][yfork + 9][xfork - 7] == 0)dx[1][yfork + 9][xfork - 7] = 25;if (dx[1][yfork + 9][xfork - 6] == 0)dx[1][yfork + 9][xfork - 6] = 25;if (dx[1][yfork + 9][xfork - 5] == 0)dx[1][yfork + 9][xfork - 5] = 25;if (dx[1][yfork + 9][xfork - 4] == 0)dx[1][yfork + 9][xfork - 4] = 25;if (dx[1][yfork + 9][xfork - 3] == 0)dx[1][yfork + 9][xfork - 3] = 25;
																		if (dx[1][yfork + 9][xfork - 2] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork - 1] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork + 0] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork + 1] == 1)yugo = 1;
																			if (dx[1][yfork - 3][xfork + 12] == 1)yugo = 1;
																			if (dx[1][yfork - 3][xfork + 24] == 1)yugo = 1;
																			if (dx[1][yfork - 2][xfork + 10] == 1)yugo = 1;
																			if (dx[1][yfork - 2][xfork + 11] == 1)yugo = 1;
																			if (dx[1][yfork - 2][xfork + 24] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork + 8] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork + 9] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork + 10] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork + 11] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork + 23] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork + 24] == 1)yugo = 1;
																			if (dx[1][yfork + 0][xfork + 6] == 1)yugo = 1;
																			if (dx[1][yfork + 0][xfork + 7] == 1)yugo = 1;
																			if (dx[1][yfork + 0][xfork + 8] == 1)yugo = 1;
																			if (dx[1][yfork + 0][xfork + 9] == 1)yugo = 1;
																			if (dx[1][yfork + 0][xfork + 22] == 1)yugo = 1;
																			if (dx[1][yfork + 0][xfork + 23] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork + 3] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork + 4] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork + 5] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork + 6] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork + 7] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork + 20] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork + 21] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork + 22] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork + 0] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork + 1] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork + 3] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork + 4] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork + 5] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork + 19] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork + 20] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork - 4] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork - 3] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork - 2] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork - 1] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork + 0] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork + 1] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork + 2] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork + 16] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork + 17] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork + 18] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork + 19] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork - 8] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork - 7] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork - 6] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork - 5] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork - 4] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork - 3] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork + 14] ==1)yugo = 1;
																			if (dx[1][yfork + 4][xfork + 15] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork + 16] == 1)yugo = 1;
																			if (dx[1][yfork + 5][xfork + 12] == 1)yugo = 1;
																			if (dx[1][yfork + 5][xfork + 13] == 1)yugo = 1;
																			if (dx[1][yfork + 5][xfork + 14] == 1)yugo = 1;
																			if (dx[1][yfork + 6][xfork + 9] == 1)yugo = 1;
																			if (dx[1][yfork + 6][xfork + 10] == 1)yugo = 1;
																			if (dx[1][yfork + 6][xfork + 11] == 1)yugo = 1;
																			if (dx[1][yfork + 6][xfork + 12] == 1)yugo = 1;
																			if (dx[1][yfork + 7][xfork + 6] == 1)yugo = 1;
																			if (dx[1][yfork + 7][xfork + 7] == 1)yugo = 1;
																			if (dx[1][yfork + 7][xfork + 8] == 1)yugo = 1;
																			if (dx[1][yfork + 7][xfork + 9] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork - 3] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork - 2] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork - 1] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork + 0] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork + 1] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork + 2] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork + 3] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork + 4] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork + 5] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork + 6] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork - 12] ==1)yugo = 1;
																			if (dx[1][yfork + 9][xfork - 11] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork - 10] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork - 9] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork - 8] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork - 7] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork - 6] == 1)yugo = 1;
																			

					
				}
				else
				{

					
					if (dx[1][yfork - 3][xfork - 12] == 0)dx[1][yfork - 3][xfork - 12] = 25;if (dx[1][yfork - 3][xfork - 24] == 0)dx[1][yfork - 3][xfork - 24] = 25;if (dx[1][yfork - 2][xfork - 10] == 0)dx[1][yfork - 2][xfork - 10] = 25;if (dx[1][yfork - 2][xfork - 11] == 0)dx[1][yfork - 2][xfork - 11] = 25;if (dx[1][yfork - 2][xfork - 24] == 0)dx[1][yfork - 2][xfork - 24] = 25;if (dx[1][yfork - 1][xfork - 8] == 0)dx[1][yfork - 1][xfork - 8] = 25; 
						if (dx[1][yfork - 1][xfork - 9] == 0)dx[1][yfork - 1][xfork - 9] = 25;if (dx[1][yfork - 1][xfork - 10] == 0)dx[1][yfork - 1][xfork - 10] = 25;if (dx[1][yfork - 1][xfork - 11] == 0)dx[1][yfork - 1][xfork - 11] = 25;if (dx[1][yfork - 1][xfork - 23] == 0)dx[1][yfork - 1][xfork - 23] = 25;if (dx[1][yfork - 1][xfork - 24] == 0)dx[1][yfork - 1][xfork - 24] = 25;if (dx[1][yfork + 0][xfork - 6] == 0)dx[1][yfork + 0][xfork - 6] = 25; 
							if (dx[1][yfork + 0][xfork - 7] == 0)dx[1][yfork + 0][xfork - 7] = 25;if (dx[1][yfork + 0][xfork - 8] == 0)dx[1][yfork + 0][xfork - 8] = 25;if (dx[1][yfork + 0][xfork - 9] == 0)dx[1][yfork + 0][xfork - 9] = 25;if (dx[1][yfork + 0][xfork - 22] == 0)dx[1][yfork + 0][xfork - 22] = 25;if (dx[1][yfork + 0][xfork - 23] == 0)dx[1][yfork + 0][xfork - 23] = 25;if (dx[1][yfork + 1][xfork - 3] == 0)dx[1][yfork + 1][xfork - 3] = 25; 
								if (dx[1][yfork + 1][xfork - 4] == 0)dx[1][yfork + 1][xfork - 4] = 25;if (dx[1][yfork + 1][xfork - 5] == 0)dx[1][yfork + 1][xfork - 5] = 25;if (dx[1][yfork + 1][xfork - 6] == 0)dx[1][yfork + 1][xfork - 6] = 25;if (dx[1][yfork + 1][xfork - 7] == 0)dx[1][yfork + 1][xfork - 7] = 25;if (dx[1][yfork + 1][xfork - 20] == 0)dx[1][yfork + 1][xfork - 20] = 25;if (dx[1][yfork + 1][xfork - 21] == 0)dx[1][yfork + 1][xfork - 21] = 25; 
									if (dx[1][yfork + 1][xfork - 22] == 0)dx[1][yfork + 1][xfork - 22] = 25;if (dx[1][yfork + 2][xfork - 0] == 0)dx[1][yfork + 2][xfork - 0] = 25;if (dx[1][yfork + 2][xfork - 1] == 0)dx[1][yfork + 2][xfork - 1] = 25;if (dx[1][yfork + 2][xfork - 2] == 0)dx[1][yfork + 2][xfork - 2] = 25;if (dx[1][yfork + 2][xfork - 3] == 0)dx[1][yfork + 2][xfork - 3] = 25;if (dx[1][yfork + 2][xfork - 4] == 0)dx[1][yfork + 2][xfork - 4] = 25; 
										if (dx[1][yfork + 2][xfork - 5] == 0)dx[1][yfork + 2][xfork - 5] = 25;if (dx[1][yfork + 2][xfork - 19] == 0)dx[1][yfork + 2][xfork - 19] = 25;if (dx[1][yfork + 2][xfork - 20] == 0)dx[1][yfork + 2][xfork - 20] = 25;if (dx[1][yfork + 3][xfork + 4] == 0)dx[1][yfork + 3][xfork + 4] = 25;if (dx[1][yfork + 3][xfork + 3] == 0)dx[1][yfork + 3][xfork + 3] = 25;if (dx[1][yfork + 3][xfork + 2] == 0)dx[1][yfork + 3][xfork + 2] = 25; 
											if (dx[1][yfork + 3][xfork + 1] == 0)dx[1][yfork + 3][xfork + 1] = 25;if (dx[1][yfork + 3][xfork - 0] == 0)dx[1][yfork + 3][xfork - 0] = 25;if (dx[1][yfork + 3][xfork - 1] == 0)dx[1][yfork + 3][xfork - 1] = 25;if (dx[1][yfork + 3][xfork - 2] == 0)dx[1][yfork + 3][xfork - 2] = 25;if (dx[1][yfork + 3][xfork - 16] == 0)dx[1][yfork + 3][xfork - 16] = 25;if (dx[1][yfork + 3][xfork - 17] == 0)dx[1][yfork + 3][xfork - 17] = 25; 
												if (dx[1][yfork + 3][xfork - 18] == 0)dx[1][yfork + 3][xfork - 18] = 25;if (dx[1][yfork + 3][xfork - 19] == 0)dx[1][yfork + 3][xfork - 19] = 25;if (dx[1][yfork + 4][xfork + 8] == 0)dx[1][yfork + 4][xfork + 8] = 25;if (dx[1][yfork + 4][xfork + 7] == 0)dx[1][yfork + 4][xfork + 7] = 25;if (dx[1][yfork + 4][xfork + 6] == 0)dx[1][yfork + 4][xfork + 6] = 25;if (dx[1][yfork + 4][xfork + 5] == 0)dx[1][yfork + 4][xfork + 5] = 25; 
													if (dx[1][yfork + 4][xfork + 4] == 0)dx[1][yfork + 4][xfork + 4] = 25;if (dx[1][yfork + 4][xfork + 3] == 0)dx[1][yfork + 4][xfork + 3] = 25;if (dx[1][yfork + 4][xfork - 14] == 0)dx[1][yfork + 4][xfork - 14] = 25;if (dx[1][yfork + 4][xfork - 15] == 0)dx[1][yfork + 4][xfork - 15] = 25;if (dx[1][yfork + 4][xfork - 16] == 0)dx[1][yfork + 4][xfork - 16] = 25;if (dx[1][yfork + 5][xfork - 12] == 0)dx[1][yfork + 5][xfork - 12] = 25;
														if (dx[1][yfork + 5][xfork - 13] == 0)dx[1][yfork + 5][xfork - 13] = 25;if (dx[1][yfork + 5][xfork - 14] == 0)dx[1][yfork + 5][xfork - 14] = 25;if (dx[1][yfork + 6][xfork - 9] == 0)dx[1][yfork + 6][xfork - 9] = 25;if (dx[1][yfork + 6][xfork - 10] == 0)dx[1][yfork + 6][xfork - 10] = 25;if (dx[1][yfork + 6][xfork - 11] == 0)dx[1][yfork + 6][xfork - 11] = 25;if (dx[1][yfork + 6][xfork - 12] == 0)dx[1][yfork + 6][xfork - 12] = 25;          
															if (dx[1][yfork + 7][xfork - 6] == 0)dx[1][yfork + 7][xfork - 6] = 25;if (dx[1][yfork + 7][xfork - 7] == 0)dx[1][yfork + 7][xfork - 7] = 25;if (dx[1][yfork + 7][xfork - 8] == 0)dx[1][yfork + 7][xfork - 8] = 25;if (dx[1][yfork + 7][xfork - 9] == 0)dx[1][yfork + 7][xfork - 9] = 25;if (dx[1][yfork + 8][xfork + 3] == 0)dx[1][yfork + 8][xfork + 3] = 25;if (dx[1][yfork + 8][xfork + 2] == 0)dx[1][yfork + 8][xfork + 2] = 25;                    
																if (dx[1][yfork + 8][xfork + 1] == 0)dx[1][yfork + 8][xfork + 1] = 25;if (dx[1][yfork + 8][xfork - 0] == 0)dx[1][yfork + 8][xfork - 0] = 25;if (dx[1][yfork + 8][xfork - 1] == 0)dx[1][yfork + 8][xfork - 1] = 25;if (dx[1][yfork + 8][xfork - 2] == 0)dx[1][yfork + 8][xfork - 2] = 25;if (dx[1][yfork + 8][xfork - 3] == 0)dx[1][yfork + 8][xfork - 3] = 25;if (dx[1][yfork + 8][xfork - 4] == 0)dx[1][yfork + 8][xfork - 4] = 25;         
																	if (dx[1][yfork + 8][xfork - 5] == 0)dx[1][yfork + 8][xfork - 5] = 25;if (dx[1][yfork + 8][xfork - 6] == 0)dx[1][yfork + 8][xfork - 6] = 25;if (dx[1][yfork + 9][xfork + 12] == 0)dx[1][yfork + 9][xfork + 12] = 25;if (dx[1][yfork + 9][xfork + 11] == 0)dx[1][yfork + 9][xfork + 11] = 25;if (dx[1][yfork + 9][xfork + 10] == 0)dx[1][yfork + 9][xfork + 10] = 25;if (dx[1][yfork + 9][xfork + 9] == 0)dx[1][yfork + 9][xfork + 9] = 25; 
																		if (dx[1][yfork + 9][xfork + 8] == 1)yugo = 1;
																		if (dx[1][yfork + 9][xfork + 7] == 1)yugo = 1;
																		if (dx[1][yfork + 9][xfork + 6] == 1)yugo = 1;
																		if (dx[1][yfork + 9][xfork + 5] == 1)yugo = 1;
																		if (dx[1][yfork + 9][xfork + 4] == 1)yugo = 1;
																		if (dx[1][yfork + 9][xfork + 3] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork + 2] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork + 1] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork - 0] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork - 1] == 1)yugo = 1;
																			if (dx[1][yfork - 3][xfork - 12] == 1)yugo = 1;
																			if (dx[1][yfork - 3][xfork - 24] == 1)yugo = 1;
																			if (dx[1][yfork - 2][xfork - 10] == 1)yugo = 1;
																			if (dx[1][yfork - 2][xfork - 11] == 1)yugo = 1;
																			if (dx[1][yfork - 2][xfork - 24] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork - 8] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork - 9] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork - 10] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork - 11] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork - 23] == 1)yugo = 1;
																			if (dx[1][yfork - 1][xfork - 24] == 1)yugo = 1;
																			if (dx[1][yfork + 0][xfork - 6] == 1)yugo = 1;
																			if (dx[1][yfork + 0][xfork - 7] == 1)yugo = 1;
																			if (dx[1][yfork + 0][xfork - 8] == 1)yugo = 1;
																			if (dx[1][yfork + 0][xfork - 9] == 1)yugo = 1;
																			if (dx[1][yfork + 0][xfork - 22] ==1)yugo = 1;
																			if (dx[1][yfork + 0][xfork - 23] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork - 3] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork - 4] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork - 5] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork - 6] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork - 7] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork - 20] ==1)yugo = 1;
																			if (dx[1][yfork + 1][xfork - 21] == 1)yugo = 1;
																			if (dx[1][yfork + 1][xfork - 22] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork - 0] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork - 1] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork - 2] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork - 3] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork - 4] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork - 5] == 1)yugo = 1;
																			if (dx[1][yfork + 2][xfork - 19] ==1)yugo = 1;
																			if (dx[1][yfork + 2][xfork - 20] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork + 4] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork + 3] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork + 2] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork + 1] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork - 0] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork - 1] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork - 2] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork - 16] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork - 17] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork - 18] == 1)yugo = 1;
																			if (dx[1][yfork + 3][xfork - 19] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork + 8] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork + 7] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork + 6] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork + 5] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork + 4] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork + 3] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork - 14] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork - 15] == 1)yugo = 1;
																			if (dx[1][yfork + 4][xfork - 16] == 1)yugo = 1;
																			if (dx[1][yfork + 5][xfork - 12] == 1)yugo = 1;
																			if (dx[1][yfork + 5][xfork - 13] == 1)yugo = 1;
																			if (dx[1][yfork + 5][xfork - 14] == 1)yugo = 1;
																			if (dx[1][yfork + 6][xfork - 9] == 1)yugo = 1;
																			if (dx[1][yfork + 6][xfork - 10] == 1)yugo = 1;
																			if (dx[1][yfork + 6][xfork - 11] == 1)yugo = 1;
																			if (dx[1][yfork + 6][xfork - 12] == 1)yugo = 1;
																			if (dx[1][yfork + 7][xfork - 6] == 1)yugo = 1;
																			if (dx[1][yfork + 7][xfork - 7] == 1)yugo = 1;
																			if (dx[1][yfork + 7][xfork - 8] == 1)yugo = 1;
																			if (dx[1][yfork + 7][xfork - 9] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork + 3] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork + 2] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork + 1] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork - 0] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork - 1] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork - 2] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork - 3] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork - 4] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork - 5] == 1)yugo = 1;
																			if (dx[1][yfork + 8][xfork - 6] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork + 12] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork + 11] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork + 10] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork + 9] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork + 8] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork + 7] == 1)yugo = 1;
																			if (dx[1][yfork + 9][xfork + 6] == 1)yugo = 1;
																			

				}

				
				break;
			//default:yfork = 0;xfork = 0;
			
			}
			if (yugo == 1) 
			{
				yugo = 0;cooldown[1] = 20;
			}
			if (cooldown[1] > 1) 
			{
				V1 = 0;V2 = 0;act1 = 1;act3 = 0;
			}
			

			if (axmonst[id] != 0)
			{
				V1monst[id] = V1monst[id] + axmonst[id] / 10;V2monst[id] = V1monst[id];
				if (V1monst[id] <= -2) {
					V1monst[id] = -0;
				}
				else if (V1monst[id] >= 2) {
					V1monst[id] = 0;
				}
			}
			if (V2monst[id] > 0)
			{

				{for (a = 0;a < V2monst[id];a++)
				{
					if (
						dx[0][ym[id] - 8][xm[id] + 2] == 3 || dx[0][ym[id] - 7][xm[id] + 2] == 3 || dx[0][ym[id] - 6][xm[id] + 2] == 3 || dx[0][ym[id] - 5][xm[id] - 2] == 3 || dx[0][ym[id] - 4][xm[id] + 3] == 3 || dx[0][ym[id] - 3][xm[id] - 3] == 3 || dx[0][ym[id] - 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
						)
					{
						V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] - 3;break;
					}
					
					xm[id]++;
				}
				}

			}
			if (V2monst[id] < 0)
			{

				{for (a = 0;a + V2monst[id];a++)
				{
					if (
						dx[0][ym[id] - 8][xm[id] - 2] == 3 || dx[0][ym[id] - 7][xm[id] - 2] == 3 || dx[0][ym[id] - 6][xm[id] - 2] == 3 || dx[0][ym[id] - 5][xm[id] - 2] == 3 || dx[0][ym[id] - 4][xm[id] - 3] == 3 || dx[0][ym[id] - 3][xm[id] - 3] == 3 || dx[0][ym[id] - 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
						)
					{
						V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] + 3;break;
					}
					
					xm[id]--;
				}
				}

			}
			//猛汉跳楼模拟器
			if (dx[0][ym[id] + 28][xm[id]] != 2 && dx[0][ym[id] + 28][xm[id] + 1] != 2 && dx[0][ym[id] + 28][xm[id] - 1] != 2)
			{

				if (aY[id] <= 2) { aY[id] += 0.5; }
				if (vY[id] < 8)vY[id] = vY[id] + aY[id] / 1.5;
				Vy2 = vY[id];

				for (a = 0;a < Vy2;a++)//下落检测
				{
					ym[id]++;
					if (dx[0][ym[id] + 28][xm[id]] == 2 || dx[0][ym[id] + 28][xm[id] + 1] == 2 || dx[0][ym[id] + 28][xm[id] - 1] == 2)
					{
						aY[id] = 0;vY[id] = 0;Vy2 = 0;fag[id][3] = 1;break;
					}
					else fag[id][3] = 0;
				}


			}

			x2 = xm[id];
			y2 = ym[id];
			if (hurteen[id] != i[id])//伤害动画
			{
				hurteen[id] = i[id];
				延迟(300);
			}
			if (i[id] > 1)
			{//生命等于0时
				//怪物图像
				if (i[id] < 10000)
				{
					
					{
						if (dx[0][y2 + 0][x2 - 8] == 0)dx[0][y2 + 0][x2 - 8] = id;if (dx[0][y2 + 0][x2 - 7] == 0)dx[0][y2 + 0][x2 - 7] = id;if (dx[0][y2 + 0][x2 - 6] == 0)dx[0][y2 + 0][x2 - 6] = id;if (dx[0][y2 + 0][x2 - 5] == 0)dx[0][y2 + 0][x2 - 5] = id;if (dx[0][y2 + 0][x2 - 4] == 0)dx[0][y2 + 0][x2 - 4] = id;if (dx[0][y2 + 0][x2 - 3] == 0)dx[0][y2 + 0][x2 - 3] = id;
						if (dx[0][y2 + 0][x2 - 2] == 0)dx[0][y2 + 0][x2 - 2] = id;if (dx[0][y2 + 0][x2 - 1] == 0)dx[0][y2 + 0][x2 - 1] = id;if (dx[0][y2 + 0][x2 + 0] == 0)dx[0][y2 + 0][x2 + 0] = id;if (dx[0][y2 + 0][x2 + 1] == 0)dx[0][y2 + 0][x2 + 1] = id;if (dx[0][y2 + 0][x2 + 2] == 0)dx[0][y2 + 0][x2 + 2] = id;if (dx[0][y2 + 0][x2 + 3] == 0)dx[0][y2 + 0][x2 + 3] = id;
						if (dx[0][y2 + 0][x2 + 4] == 0)dx[0][y2 + 0][x2 + 4] = id;if (dx[0][y2 + 0][x2 + 5] == 0)dx[0][y2 + 0][x2 + 5] = id;if (dx[0][y2 + 0][x2 + 6] == 0)dx[0][y2 + 0][x2 + 6] = id;if (dx[0][y2 + 0][x2 + 7] == 0)dx[0][y2 + 0][x2 + 7] = id;if (dx[0][y2 + 0][x2 + 8] == 0)dx[0][y2 + 0][x2 + 8] = id;if (dx[0][y2 + 0][x2 + 9] == 0)dx[0][y2 + 0][x2 + 9] = id;
						if (dx[0][y2 + 1][x2 - 8] == 0)dx[0][y2 + 1][x2 - 8] = id;if (dx[0][y2 + 1][x2 + 0] == 0)dx[0][y2 + 1][x2 + 0] = id;if (dx[0][y2 + 1][x2 + 9] == 0)dx[0][y2 + 1][x2 + 9] = id;if (dx[0][y2 + 2][x2 - 8] == 0)dx[0][y2 + 2][x2 - 8] = id;if (dx[0][y2 + 2][x2 - 7] == 0)dx[0][y2 + 2][x2 - 7] = id;if (dx[0][y2 + 2][x2 - 6] == 0)dx[0][y2 + 2][x2 - 6] = id;
						if (dx[0][y2 + 2][x2 - 5] == 0)dx[0][y2 + 2][x2 - 5] = id;if (dx[0][y2 + 2][x2 - 4] == 0)dx[0][y2 + 2][x2 - 4] = id;if (dx[0][y2 + 2][x2 - 3] == 0)dx[0][y2 + 2][x2 - 3] = id;if (dx[0][y2 + 2][x2 - 2] == 0)dx[0][y2 + 2][x2 - 2] = id;if (dx[0][y2 + 2][x2 - 1] == 0)dx[0][y2 + 2][x2 - 1] = id;if (dx[0][y2 + 2][x2 + 0] == 0)dx[0][y2 + 2][x2 + 0] = id;
						if (dx[0][y2 + 2][x2 + 1] == 0)dx[0][y2 + 2][x2 + 1] = id;if (dx[0][y2 + 2][x2 + 2] == 0)dx[0][y2 + 2][x2 + 2] = id;if (dx[0][y2 + 2][x2 + 3] == 0)dx[0][y2 + 2][x2 + 3] = id;if (dx[0][y2 + 2][x2 + 4] == 0)dx[0][y2 + 2][x2 + 4] = id;if (dx[0][y2 + 2][x2 + 5] == 0)dx[0][y2 + 2][x2 + 5] = id;if (dx[0][y2 + 2][x2 + 6] == 0)dx[0][y2 + 2][x2 + 6] = id;
						if (dx[0][y2 + 2][x2 + 7] == 0)dx[0][y2 + 2][x2 + 7] = id;if (dx[0][y2 + 2][x2 + 8] == 0)dx[0][y2 + 2][x2 + 8] = id;if (dx[0][y2 + 2][x2 + 9] == 0)dx[0][y2 + 2][x2 + 9] = id;if (dx[0][y2 + 3][x2 + 0] == 0)dx[0][y2 + 3][x2 + 0] = id;if (dx[0][y2 + 4][x2 + 0] == 0)dx[0][y2 + 4][x2 + 0] = id;if (dx[0][y2 + 4][x2 + 1] == 0)dx[0][y2 + 4][x2 + 1] = id;
						if (dx[0][y2 + 5][x2 + 1] == 0)dx[0][y2 + 5][x2 + 1] = id;if (dx[0][y2 + 6][x2 + 1] == 0)dx[0][y2 + 6][x2 + 1] = id;if (dx[0][y2 + 7][x2 - 10] == 0)dx[0][y2 + 7][x2 - 10] = id;if (dx[0][y2 + 7][x2 - 9] == 0)dx[0][y2 + 7][x2 - 9] = id;if (dx[0][y2 + 7][x2 - 8] == 0)dx[0][y2 + 7][x2 - 8] = id;if (dx[0][y2 + 7][x2 - 7] == 0)dx[0][y2 + 7][x2 - 7] = id;
						if (dx[0][y2 + 7][x2 - 6] == 0)dx[0][y2 + 7][x2 - 6] = id;if (dx[0][y2 + 7][x2 - 5] == 0)dx[0][y2 + 7][x2 - 5] = id;if (dx[0][y2 + 7][x2 - 4] == 0)dx[0][y2 + 7][x2 - 4] = id;if (dx[0][y2 + 7][x2 - 3] == 0)dx[0][y2 + 7][x2 - 3] = id;if (dx[0][y2 + 7][x2 - 2] == 0)dx[0][y2 + 7][x2 - 2] = id;if (dx[0][y2 + 7][x2 - 1] == 0)dx[0][y2 + 7][x2 - 1] = id;
						if (dx[0][y2 + 7][x2 + 0] == 0)dx[0][y2 + 7][x2 + 0] = id;if (dx[0][y2 + 7][x2 + 1] == 0)dx[0][y2 + 7][x2 + 1] = id;if (dx[0][y2 + 7][x2 + 2] == 0)dx[0][y2 + 7][x2 + 2] = id;if (dx[0][y2 + 7][x2 + 3] == 0)dx[0][y2 + 7][x2 + 3] = id;if (dx[0][y2 + 7][x2 + 4] == 0)dx[0][y2 + 7][x2 + 4] = id;if (dx[0][y2 + 7][x2 + 5] == 0)dx[0][y2 + 7][x2 + 5] = id;
						if (dx[0][y2 + 7][x2 + 6] == 0)dx[0][y2 + 7][x2 + 6] = id;if (dx[0][y2 + 7][x2 + 7] == 0)dx[0][y2 + 7][x2 + 7] = id;if (dx[0][y2 + 7][x2 + 8] == 0)dx[0][y2 + 7][x2 + 8] = id;if (dx[0][y2 + 7][x2 + 9] == 0)dx[0][y2 + 7][x2 + 9] = id;if (dx[0][y2 + 7][x2 + 10] == 0)dx[0][y2 + 7][x2 + 10] = id;if (dx[0][y2 + 8][x2 - 10] == 0)dx[0][y2 + 8][x2 - 10] = id;
						if (dx[0][y2 + 8][x2 + 10] == 0)dx[0][y2 + 8][x2 + 10] = id;if (dx[0][y2 + 9][x2 - 10] == 0)dx[0][y2 + 9][x2 - 10] = id;if (dx[0][y2 + 9][x2 + 10] == 0)dx[0][y2 + 9][x2 + 10] = id;if (dx[0][y2 + 10][x2 - 10] == 0)dx[0][y2 + 10][x2 - 10] = id;if (dx[0][y2 + 10][x2 + 10] == 0)dx[0][y2 + 10][x2 + 10] = id;if (dx[0][y2 + 11][x2 - 10] == 0)dx[0][y2 + 11][x2 - 10] = id;
						if (dx[0][y2 + 11][x2 - 9] == 0)dx[0][y2 + 11][x2 - 9] = id;if (dx[0][y2 + 11][x2 - 8] == 0)dx[0][y2 + 11][x2 - 8] = id;if (dx[0][y2 + 11][x2 - 7] == 0)dx[0][y2 + 11][x2 - 7] = id;if (dx[0][y2 + 11][x2 - 6] == 0)dx[0][y2 + 11][x2 - 6] = id;if (dx[0][y2 + 11][x2 - 5] == 0)dx[0][y2 + 11][x2 - 5] = id;if (dx[0][y2 + 11][x2 - 4] == 0)dx[0][y2 + 11][x2 - 4] = id;
						if (dx[0][y2 + 11][x2 - 3] == 0)dx[0][y2 + 11][x2 - 3] = id;if (dx[0][y2 + 11][x2 + 4] == 0)dx[0][y2 + 11][x2 + 4] = id;if (dx[0][y2 + 11][x2 + 5] == 0)dx[0][y2 + 11][x2 + 5] = id;if (dx[0][y2 + 11][x2 + 6] == 0)dx[0][y2 + 11][x2 + 6] = id;if (dx[0][y2 + 11][x2 + 7] == 0)dx[0][y2 + 11][x2 + 7] = id;if (dx[0][y2 + 11][x2 + 8] == 0)dx[0][y2 + 11][x2 + 8] = id;
						if (dx[0][y2 + 11][x2 + 9] == 0)dx[0][y2 + 11][x2 + 9] = id;if (dx[0][y2 + 11][x2 + 10] == 0)dx[0][y2 + 11][x2 + 10] = id;if (dx[0][y2 + 12][x2 - 10] == 0)dx[0][y2 + 12][x2 - 10] = id;if (dx[0][y2 + 12][x2 - 9] == 0)dx[0][y2 + 12][x2 - 9] = id;if (dx[0][y2 + 12][x2 - 8] == 0)dx[0][y2 + 12][x2 - 8] = id;if (dx[0][y2 + 12][x2 - 7] == 0)dx[0][y2 + 12][x2 - 7] = id;
						if (dx[0][y2 + 12][x2 - 6] == 0)dx[0][y2 + 12][x2 - 6] = id;if (dx[0][y2 + 12][x2 - 5] == 0)dx[0][y2 + 12][x2 - 5] = id;if (dx[0][y2 + 12][x2 - 4] == 0)dx[0][y2 + 12][x2 - 4] = id;if (dx[0][y2 + 12][x2 - 3] == 0)dx[0][y2 + 12][x2 - 3] = id;if (dx[0][y2 + 12][x2 + 4] == 0)dx[0][y2 + 12][x2 + 4] = id;if (dx[0][y2 + 12][x2 + 5] == 0)dx[0][y2 + 12][x2 + 5] = id;
						if (dx[0][y2 + 12][x2 + 6] == 0)dx[0][y2 + 12][x2 + 6] = id;if (dx[0][y2 + 12][x2 + 7] == 0)dx[0][y2 + 12][x2 + 7] = id;if (dx[0][y2 + 12][x2 + 8] == 0)dx[0][y2 + 12][x2 + 8] = id;if (dx[0][y2 + 12][x2 + 9] == 0)dx[0][y2 + 12][x2 + 9] = id;if (dx[0][y2 + 12][x2 + 10] == 0)dx[0][y2 + 12][x2 + 10] = id;if (dx[0][y2 + 13][x2 - 11] == 0)dx[0][y2 + 13][x2 - 11] = id;
						if (dx[0][y2 + 13][x2 - 10] == 0)dx[0][y2 + 13][x2 - 10] = id;if (dx[0][y2 + 13][x2 + 10] == 0)dx[0][y2 + 13][x2 + 10] = id;if (dx[0][y2 + 13][x2 + 11] == 0)dx[0][y2 + 13][x2 + 11] = id;if (dx[0][y2 + 14][x2 - 12] == 0)dx[0][y2 + 14][x2 - 12] = id;if (dx[0][y2 + 14][x2 - 11] == 0)dx[0][y2 + 14][x2 - 11] = id;if (dx[0][y2 + 14][x2 - 10] == 0)dx[0][y2 + 14][x2 - 10] = id;
						if (dx[0][y2 + 14][x2 - 9] == 0)dx[0][y2 + 14][x2 - 9] = id;if (dx[0][y2 + 14][x2 - 8] == 0)dx[0][y2 + 14][x2 - 8] = id;if (dx[0][y2 + 14][x2 - 7] == 0)dx[0][y2 + 14][x2 - 7] = id;if (dx[0][y2 + 14][x2 - 6] == 0)dx[0][y2 + 14][x2 - 6] = id;if (dx[0][y2 + 14][x2 - 5] == 0)dx[0][y2 + 14][x2 - 5] = id;if (dx[0][y2 + 14][x2 - 4] == 0)dx[0][y2 + 14][x2 - 4] = id;
						if (dx[0][y2 + 14][x2 - 3] == 0)dx[0][y2 + 14][x2 - 3] = id;if (dx[0][y2 + 14][x2 + 2] == 0)dx[0][y2 + 14][x2 + 2] = id;if (dx[0][y2 + 14][x2 + 3] == 0)dx[0][y2 + 14][x2 + 3] = id;if (dx[0][y2 + 14][x2 + 4] == 0)dx[0][y2 + 14][x2 + 4] = id;if (dx[0][y2 + 14][x2 + 5] == 0)dx[0][y2 + 14][x2 + 5] = id;if (dx[0][y2 + 14][x2 + 6] == 0)dx[0][y2 + 14][x2 + 6] = id;
						if (dx[0][y2 + 14][x2 + 7] == 0)dx[0][y2 + 14][x2 + 7] = id;if (dx[0][y2 + 14][x2 + 8] == 0)dx[0][y2 + 14][x2 + 8] = id;if (dx[0][y2 + 14][x2 + 9] == 0)dx[0][y2 + 14][x2 + 9] = id;if (dx[0][y2 + 14][x2 + 10] == 0)dx[0][y2 + 14][x2 + 10] = id;if (dx[0][y2 + 14][x2 + 12] == 0)dx[0][y2 + 14][x2 + 12] = id;if (dx[0][y2 + 14][x2 + 13] == 0)dx[0][y2 + 14][x2 + 13] = id;
						if (dx[0][y2 + 15][x2 - 14] == 0)dx[0][y2 + 15][x2 - 14] = id;if (dx[0][y2 + 15][x2 - 13] == 0)dx[0][y2 + 15][x2 - 13] = id;if (dx[0][y2 + 15][x2 - 12] == 0)dx[0][y2 + 15][x2 - 12] = id;if (dx[0][y2 + 15][x2 - 10] == 0)dx[0][y2 + 15][x2 - 10] = id;if (dx[0][y2 + 15][x2 - 9] == 0)dx[0][y2 + 15][x2 - 9] = id;if (dx[0][y2 + 15][x2 - 8] == 0)dx[0][y2 + 15][x2 - 8] = id;
						if (dx[0][y2 + 15][x2 - 7] == 0)dx[0][y2 + 15][x2 - 7] = id;if (dx[0][y2 + 15][x2 - 6] == 0)dx[0][y2 + 15][x2 - 6] = id;if (dx[0][y2 + 15][x2 - 5] == 0)dx[0][y2 + 15][x2 - 5] = id;if (dx[0][y2 + 15][x2 - 4] == 0)dx[0][y2 + 15][x2 - 4] = id;if (dx[0][y2 + 15][x2 - 3] == 0)dx[0][y2 + 15][x2 - 3] = id;if (dx[0][y2 + 15][x2 + 2] == 0)dx[0][y2 + 15][x2 + 2] = id;
						if (dx[0][y2 + 15][x2 + 3] == 0)dx[0][y2 + 15][x2 + 3] = id;if (dx[0][y2 + 15][x2 + 4] == 0)dx[0][y2 + 15][x2 + 4] = id;if (dx[0][y2 + 15][x2 + 5] == 0)dx[0][y2 + 15][x2 + 5] = id;if (dx[0][y2 + 15][x2 + 6] == 0)dx[0][y2 + 15][x2 + 6] = id;if (dx[0][y2 + 15][x2 + 7] == 0)dx[0][y2 + 15][x2 + 7] = id;if (dx[0][y2 + 15][x2 + 8] == 0)dx[0][y2 + 15][x2 + 8] = id;
						if (dx[0][y2 + 15][x2 + 9] == 0)dx[0][y2 + 15][x2 + 9] = id;if (dx[0][y2 + 15][x2 + 10] == 0)dx[0][y2 + 15][x2 + 10] = id;if (dx[0][y2 + 15][x2 + 14] == 0)dx[0][y2 + 15][x2 + 14] = id;if (dx[0][y2 + 15][x2 + 20] == 0)dx[0][y2 + 15][x2 + 20] = id;if (dx[0][y2 + 15][x2 + 21] == 0)dx[0][y2 + 15][x2 + 21] = id;if (dx[0][y2 + 16][x2 - 17] == 0)dx[0][y2 + 16][x2 - 17] = id;
						if (dx[0][y2 + 16][x2 - 16] == 0)dx[0][y2 + 16][x2 - 16] = id;if (dx[0][y2 + 16][x2 - 15] == 0)dx[0][y2 + 16][x2 - 15] = id;if (dx[0][y2 + 16][x2 - 14] == 0)dx[0][y2 + 16][x2 - 14] = id;if (dx[0][y2 + 16][x2 - 10] == 0)dx[0][y2 + 16][x2 - 10] = id;if (dx[0][y2 + 16][x2 - 9] == 0)dx[0][y2 + 16][x2 - 9] = id;if (dx[0][y2 + 16][x2 - 8] == 0)dx[0][y2 + 16][x2 - 8] = id;
						if (dx[0][y2 + 16][x2 - 7] == 0)dx[0][y2 + 16][x2 - 7] = id;if (dx[0][y2 + 16][x2 - 6] == 0)dx[0][y2 + 16][x2 - 6] = id;if (dx[0][y2 + 16][x2 - 5] == 0)dx[0][y2 + 16][x2 - 5] = id;if (dx[0][y2 + 16][x2 + 3] == 0)dx[0][y2 + 16][x2 + 3] = id;if (dx[0][y2 + 16][x2 + 4] == 0)dx[0][y2 + 16][x2 + 4] = id;if (dx[0][y2 + 16][x2 + 5] == 0)dx[0][y2 + 16][x2 + 5] = id;
						if (dx[0][y2 + 16][x2 + 6] == 0)dx[0][y2 + 16][x2 + 6] = id;if (dx[0][y2 + 16][x2 + 7] == 0)dx[0][y2 + 16][x2 + 7] = id;if (dx[0][y2 + 16][x2 + 8] == 0)dx[0][y2 + 16][x2 + 8] = id;if (dx[0][y2 + 16][x2 + 9] == 0)dx[0][y2 + 16][x2 + 9] = id;if (dx[0][y2 + 16][x2 + 10] == 0)dx[0][y2 + 16][x2 + 10] = id;if (dx[0][y2 + 16][x2 + 15] == 0)dx[0][y2 + 16][x2 + 15] = id;
						if (dx[0][y2 + 16][x2 + 18] == 0)dx[0][y2 + 16][x2 + 18] = id;if (dx[0][y2 + 16][x2 + 19] == 0)dx[0][y2 + 16][x2 + 19] = id;if (dx[0][y2 + 17][x2 - 26] == 0)dx[0][y2 + 17][x2 - 26] = id;if (dx[0][y2 + 17][x2 - 25] == 0)dx[0][y2 + 17][x2 - 25] = id;if (dx[0][y2 + 17][x2 - 19] == 0)dx[0][y2 + 17][x2 - 19] = id;if (dx[0][y2 + 17][x2 - 18] == 0)dx[0][y2 + 17][x2 - 18] = id;
						if (dx[0][y2 + 17][x2 - 17] == 0)dx[0][y2 + 17][x2 - 17] = id;if (dx[0][y2 + 17][x2 - 10] == 0)dx[0][y2 + 17][x2 - 10] = id;if (dx[0][y2 + 17][x2 - 9] == 0)dx[0][y2 + 17][x2 - 9] = id;if (dx[0][y2 + 17][x2 - 8] == 0)dx[0][y2 + 17][x2 - 8] = id;if (dx[0][y2 + 17][x2 - 7] == 0)dx[0][y2 + 17][x2 - 7] = id;if (dx[0][y2 + 17][x2 - 6] == 0)dx[0][y2 + 17][x2 - 6] = id;
						if (dx[0][y2 + 17][x2 - 5] == 0)dx[0][y2 + 17][x2 - 5] = id;if (dx[0][y2 + 17][x2 + 3] == 0)dx[0][y2 + 17][x2 + 3] = id;if (dx[0][y2 + 17][x2 + 4] == 0)dx[0][y2 + 17][x2 + 4] = id;if (dx[0][y2 + 17][x2 + 5] == 0)dx[0][y2 + 17][x2 + 5] = id;if (dx[0][y2 + 17][x2 + 6] == 0)dx[0][y2 + 17][x2 + 6] = id;if (dx[0][y2 + 17][x2 + 7] == 0)dx[0][y2 + 17][x2 + 7] = id;
						if (dx[0][y2 + 17][x2 + 8] == 0)dx[0][y2 + 17][x2 + 8] = id;if (dx[0][y2 + 17][x2 + 9] == 0)dx[0][y2 + 17][x2 + 9] = id;if (dx[0][y2 + 17][x2 + 10] == 0)dx[0][y2 + 17][x2 + 10] = id;if (dx[0][y2 + 17][x2 + 16] == 0)dx[0][y2 + 17][x2 + 16] = id;if (dx[0][y2 + 17][x2 + 17] == 0)dx[0][y2 + 17][x2 + 17] = id;if (dx[0][y2 + 17][x2 + 18] == 0)dx[0][y2 + 17][x2 + 18] = id;
						if (dx[0][y2 + 17][x2 + 19] == 0)dx[0][y2 + 17][x2 + 19] = id;if (dx[0][y2 + 17][x2 + 20] == 0)dx[0][y2 + 17][x2 + 20] = id;if (dx[0][y2 + 17][x2 + 21] == 0)dx[0][y2 + 17][x2 + 21] = id;if (dx[0][y2 + 17][x2 + 22] == 0)dx[0][y2 + 17][x2 + 22] = id;if (dx[0][y2 + 17][x2 + 23] == 0)dx[0][y2 + 17][x2 + 23] = id;if (dx[0][y2 + 18][x2 - 25] == 0)dx[0][y2 + 18][x2 - 25] = id;
						if (dx[0][y2 + 18][x2 - 24] == 0)dx[0][y2 + 18][x2 - 24] = id;if (dx[0][y2 + 18][x2 - 23] == 0)dx[0][y2 + 18][x2 - 23] = id;if (dx[0][y2 + 18][x2 - 22] == 0)dx[0][y2 + 18][x2 - 22] = id;if (dx[0][y2 + 18][x2 - 21] == 0)dx[0][y2 + 18][x2 - 21] = id;if (dx[0][y2 + 18][x2 - 20] == 0)dx[0][y2 + 18][x2 - 20] = id;if (dx[0][y2 + 18][x2 - 19] == 0)dx[0][y2 + 18][x2 - 19] = id;
						if (dx[0][y2 + 18][x2 - 10] == 0)dx[0][y2 + 18][x2 - 10] = id;if (dx[0][y2 + 18][x2 - 9] == 0)dx[0][y2 + 18][x2 - 9] = id;if (dx[0][y2 + 18][x2 - 8] == 0)dx[0][y2 + 18][x2 - 8] = id;if (dx[0][y2 + 18][x2 - 7] == 0)dx[0][y2 + 18][x2 - 7] = id;if (dx[0][y2 + 18][x2 + 7] == 0)dx[0][y2 + 18][x2 + 7] = id;if (dx[0][y2 + 18][x2 + 8] == 0)dx[0][y2 + 18][x2 + 8] = id;
						if (dx[0][y2 + 18][x2 + 9] == 0)dx[0][y2 + 18][x2 + 9] = id;if (dx[0][y2 + 18][x2 + 10] == 0)dx[0][y2 + 18][x2 + 10] = id;if (dx[0][y2 + 18][x2 + 17] == 0)dx[0][y2 + 18][x2 + 17] = id;if (dx[0][y2 + 19][x2 - 22] == 0)dx[0][y2 + 19][x2 - 22] = id;if (dx[0][y2 + 19][x2 - 21] == 0)dx[0][y2 + 19][x2 - 21] = id;if (dx[0][y2 + 19][x2 - 10] == 0)dx[0][y2 + 19][x2 - 10] = id;
						if (dx[0][y2 + 19][x2 - 9] == 0)dx[0][y2 + 19][x2 - 9] = id;if (dx[0][y2 + 19][x2 - 8] == 0)dx[0][y2 + 19][x2 - 8] = id;if (dx[0][y2 + 19][x2 - 7] == 0)dx[0][y2 + 19][x2 - 7] = id;if (dx[0][y2 + 19][x2 - 6] == 0)dx[0][y2 + 19][x2 - 6] = id;if (dx[0][y2 + 19][x2 + 5] == 0)dx[0][y2 + 19][x2 + 5] = id;if (dx[0][y2 + 19][x2 + 6] == 0)dx[0][y2 + 19][x2 + 6] = id;
						if (dx[0][y2 + 19][x2 + 7] == 0)dx[0][y2 + 19][x2 + 7] = id;if (dx[0][y2 + 19][x2 + 8] == 0)dx[0][y2 + 19][x2 + 8] = id;if (dx[0][y2 + 19][x2 + 9] == 0)dx[0][y2 + 19][x2 + 9] = id;if (dx[0][y2 + 19][x2 + 10] == 0)dx[0][y2 + 19][x2 + 10] = id;if (dx[0][y2 + 19][x2 + 18] == 0)dx[0][y2 + 19][x2 + 18] = id;if (dx[0][y2 + 20][x2 - 24] == 0)dx[0][y2 + 20][x2 - 24] = id;
						if (dx[0][y2 + 20][x2 - 23] == 0)dx[0][y2 + 20][x2 - 23] = id;if (dx[0][y2 + 20][x2 - 10] == 0)dx[0][y2 + 20][x2 - 10] = id;if (dx[0][y2 + 20][x2 - 9] == 0)dx[0][y2 + 20][x2 - 9] = id;if (dx[0][y2 + 20][x2 - 8] == 0)dx[0][y2 + 20][x2 - 8] = id;if (dx[0][y2 + 20][x2 + 7] == 0)dx[0][y2 + 20][x2 + 7] = id;if (dx[0][y2 + 20][x2 + 8] == 0)dx[0][y2 + 20][x2 + 8] = id;
						if (dx[0][y2 + 20][x2 + 9] == 0)dx[0][y2 + 20][x2 + 9] = id;if (dx[0][y2 + 20][x2 + 10] == 0)dx[0][y2 + 20][x2 + 10] = id;if (dx[0][y2 + 21][x2 - 10] == 0)dx[0][y2 + 21][x2 - 10] = id;if (dx[0][y2 + 21][x2 - 9] == 0)dx[0][y2 + 21][x2 - 9] = id;if (dx[0][y2 + 21][x2 - 8] == 0)dx[0][y2 + 21][x2 - 8] = id;if (dx[0][y2 + 21][x2 - 7] == 0)dx[0][y2 + 21][x2 - 7] = id;
						if (dx[0][y2 + 21][x2 - 6] == 0)dx[0][y2 + 21][x2 - 6] = id;if (dx[0][y2 + 21][x2 - 5] == 0)dx[0][y2 + 21][x2 - 5] = id;if (dx[0][y2 + 21][x2 - 4] == 0)dx[0][y2 + 21][x2 - 4] = id;if (dx[0][y2 + 21][x2 - 3] == 0)dx[0][y2 + 21][x2 - 3] = id;if (dx[0][y2 + 21][x2 - 2] == 0)dx[0][y2 + 21][x2 - 2] = id;if (dx[0][y2 + 21][x2 - 1] == 0)dx[0][y2 + 21][x2 - 1] = id;
						if (dx[0][y2 + 21][x2 + 0] == 0)dx[0][y2 + 21][x2 + 0] = id;if (dx[0][y2 + 21][x2 + 1] == 0)dx[0][y2 + 21][x2 + 1] = id;if (dx[0][y2 + 21][x2 + 2] == 0)dx[0][y2 + 21][x2 + 2] = id;if (dx[0][y2 + 21][x2 + 3] == 0)dx[0][y2 + 21][x2 + 3] = id;if (dx[0][y2 + 21][x2 + 4] == 0)dx[0][y2 + 21][x2 + 4] = id;if (dx[0][y2 + 21][x2 + 5] == 0)dx[0][y2 + 21][x2 + 5] = id;
						if (dx[0][y2 + 21][x2 + 6] == 0)dx[0][y2 + 21][x2 + 6] = id;if (dx[0][y2 + 21][x2 + 7] == 0)dx[0][y2 + 21][x2 + 7] = id;if (dx[0][y2 + 21][x2 + 8] == 0)dx[0][y2 + 21][x2 + 8] = id;if (dx[0][y2 + 21][x2 + 9] == 0)dx[0][y2 + 21][x2 + 9] = id;if (dx[0][y2 + 21][x2 + 10] == 0)dx[0][y2 + 21][x2 + 10] = id;if (dx[0][y2 + 22][x2 - 7] == 0)dx[0][y2 + 22][x2 - 7] = id;
						if (dx[0][y2 + 22][x2 + 7] == 0)dx[0][y2 + 22][x2 + 7] = id;if (dx[0][y2 + 23][x2 - 7] == 0)dx[0][y2 + 23][x2 - 7] = id;if (dx[0][y2 + 23][x2 + 7] == 0)dx[0][y2 + 23][x2 + 7] = id;if (dx[0][y2 + 24][x2 - 7] == 0)dx[0][y2 + 24][x2 - 7] = id;if (dx[0][y2 + 24][x2 + 7] == 0)dx[0][y2 + 24][x2 + 7] = id;if (dx[0][y2 + 25][x2 - 7] == 0)dx[0][y2 + 25][x2 - 7] = id;
						if (dx[0][y2 + 25][x2 + 7] == 0)dx[0][y2 + 25][x2 + 7] = id;if (dx[0][y2 + 26][x2 - 10] == 0)dx[0][y2 + 26][x2 - 10] = id;if (dx[0][y2 + 26][x2 - 9] == 0)dx[0][y2 + 26][x2 - 9] = id;if (dx[0][y2 + 26][x2 - 8] == 0)dx[0][y2 + 26][x2 - 8] = id;if (dx[0][y2 + 26][x2 - 7] == 0)dx[0][y2 + 26][x2 - 7] = id;if (dx[0][y2 + 26][x2 - 6] == 0)dx[0][y2 + 26][x2 - 6] = id;
						if (dx[0][y2 + 26][x2 - 5] == 0)dx[0][y2 + 26][x2 - 5] = id;if (dx[0][y2 + 26][x2 + 5] == 0)dx[0][y2 + 26][x2 + 5] = id;if (dx[0][y2 + 26][x2 + 6] == 0)dx[0][y2 + 26][x2 + 6] = id;if (dx[0][y2 + 26][x2 + 7] == 0)dx[0][y2 + 26][x2 + 7] = id;if (dx[0][y2 + 26][x2 + 8] == 0)dx[0][y2 + 26][x2 + 8] = id;if (dx[0][y2 + 26][x2 + 9] == 0)dx[0][y2 + 26][x2 + 9] = id;
						if (dx[0][y2 + 26][x2 + 10] == 0)dx[0][y2 + 26][x2 + 10] = id;if (dx[0][y2 + 27][x2 - 10] == 0)dx[0][y2 + 27][x2 - 10] = id;if (dx[0][y2 + 27][x2 - 9] == 0)dx[0][y2 + 27][x2 - 9] = id;if (dx[0][y2 + 27][x2 - 8] == 0)dx[0][y2 + 27][x2 - 8] = id;if (dx[0][y2 + 27][x2 - 7] == 0)dx[0][y2 + 27][x2 - 7] = id;if (dx[0][y2 + 27][x2 - 6] == 0)dx[0][y2 + 27][x2 - 6] = id;
						if (dx[0][y2 + 27][x2 - 5] == 0)dx[0][y2 + 27][x2 - 5] = id;if (dx[0][y2 + 27][x2 + 5] == 0)dx[0][y2 + 27][x2 + 5] = id;if (dx[0][y2 + 27][x2 + 6] == 0)dx[0][y2 + 27][x2 + 6] = id;if (dx[0][y2 + 27][x2 + 7] == 0)dx[0][y2 + 27][x2 + 7] = id;if (dx[0][y2 + 27][x2 + 8] == 0)dx[0][y2 + 27][x2 + 8] = id;if (dx[0][y2 + 27][x2 + 9] == 0)dx[0][y2 + 27][x2 + 9] = id;
						if (dx[0][y2 + 27][x2 + 10] == 0)dx[0][y2 + 27][x2 + 10] = id;}

					
						
					
					


				}
				//怪物图像
				else
				{
					if (i[id] < 10001) {
						i[id]++;die[id]++; mop[room]++;
					}
				}


				if (i[id] < 20 && ni[id] == -1) { dieword = id;nice[id] = 0;ni[id] = -2;mop[room]++; }//当怪物体力掉到一定程度求饶时,ni用来防止触发第二次



			}
			else//死亡触发
			{
				i[id] = 10000;
			}

			if (fag[id][3] > 1)fag[id][3] = 0;//怪物动作状态







		}
		

	}
}

void villager(int x2, int y2, int h1, int id, int r, int e)
{/*
  ---------------------------------------------------------------------------------------------------------------------------------------------
                           函数分为逻辑区与对话区
   常用参数 a,b，Ay
   x2					初始化横坐标													y2					初始化纵坐标 
   h1					初始化生命														id					怪物逻辑编号 
   r					怪物寻敌半径													e					是否为逻辑/对话
   die[id]				怪物死亡不在运行标志											i[id]				怪物的实际生命值+1
   x1					怪物横坐标														y1					怪物纵坐标 
   xm[id]				怪物实际横坐标											    	ym[id]				怪物实际纵坐标
   Vy2					怪物当前速度（整型）											max					最大速度 
   yfork				武器横坐标														xfork				武器纵坐标
   nice[id]				怪物善恶值													    ato[id]				怪物当前状态为巡逻/发现敌人
   fag[0]				是前往目标的标志												fag[1]				是第一个目标坐标 
   fag[2]				是第二个目标坐标												fag[3]				是怪物是否落地  
   aY[id]				怪物纵向加速度													axmonst[id]			怪物横向加速度
   actmonst[id]			怪物当前动作模型                                                dx[0][][]=id            怪物在游戏中逻辑层的模型
   vY[id]               怪物当前纵向速度(浮点数)										Vy2[id]				怪物当前纵向速度（整型）
   hurteen[id]          怪物受伤标志                                                    diewordx[0][id]         当怪物战斗中途触发的对话
   axmonst[id]          怪物横向加速度                                                  conmonst[id]        怪物左右朝向
   V1monst[id]          怪物横向速度（浮点数）                                          V2monst[id]         怪物横向速度整型数
   meun                 怪物对话深度（层次）
  ----------------------------------------------------------------------------------------------------------------------------------------------
  */
	
	if (die[id] < 1)
	{
		int x1 = 0, y1 = 0, a = 0, b = 0, Vy2 = 0, c = 0, max = 3, atk = 3, yfork = 0, xfork = 0;
		if (e == 0)
		{
			if (i[id] == 0)//怪物数据函数初始化 
			{
				x2 = x2 + 30 + 30;
				xm[id] = x2;ym[id] = y2;i[id] = h1 + 1;ym[id] = 600 - ym[id];fag[id][1] = xm[id] + r;fag[id][2] = xm[id] - r;ato[id] = 1;aY[id] = 0;ni[id] = -1;
			}

			//寻敌

			if (nice[id] < 0)
			{

				{ ato[id] = 0;hdso = 0;talk = 0;dieword = id;nice[id] = 0;ni[id] = -2;
				}

			}
			else { ato[id] = 1; }





			if (ato[id] == 1)//巡航，巡逻,待命
			{
				axmonst[id] = 0;V2monst[id] = 0;V1monst[id] = 0;actmonst[id] = 0;

			}
			else
			{




			}



			if (axmonst[id] != 0)
			{
				V1monst[id] = V1monst[id] + axmonst[id] / 10;V2monst[id] = V1monst[id];
				if (V1monst[id] <= -4) {
					V1monst[id] = -4;
				}
				else if (V1monst[id] >= 4) {
					V1monst[id] = 4;
				}
			}
			if (V2monst[id] > 0)
			{

				{for (a = 0;a < V2monst[id];a++)
				{
					if (
						dx[0][ym[id] - 8][xm[id] + 2] == 3 || dx[0][ym[id] - 7][xm[id] + 2] == 3 || dx[0][ym[id] - 6][xm[id] + 2] == 3 || dx[0][ym[id] - 5][xm[id] - 2] == 3 || dx[0][ym[id] - 4][xm[id] + 3] == 3 || dx[0][ym[id] - 3][xm[id] - 3] == 3 || dx[0][ym[id] - 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
						)
					{
						V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] - 3;break;
					}

					xm[id]++;
				}
				}

			}
			if (V2monst[id] < 0)
			{

				{for (a = 0;a + V2monst[id];a++)
				{
					if (
						dx[0][ym[id] - 8][xm[id] - 2] == 3 || dx[0][ym[id] - 7][xm[id] - 2] == 3 || dx[0][ym[id] - 6][xm[id] - 2] == 3 || dx[0][ym[id] - 5][xm[id] - 2] == 3 || dx[0][ym[id] - 4][xm[id] - 3] == 3 || dx[0][ym[id] - 3][xm[id] - 3] == 3 || dx[0][ym[id] - 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
						)
					{
						V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] + 3;break;
					}

					xm[id]--;
				}
				}

			}


			if (dx[0][ym[id] + 9][xm[id]] != 2 && dx[0][ym[id] + 9][xm[id] + 1] != 2 && dx[0][ym[id] + 9][xm[id] - 1] != 2)//重力函数
			{

				physicsengine(id,11);


			}
			y1 = ym[id];
			if (hurteen[id] != i[id])//伤害动画
			{
				hurteen[id] = i[id];
				延迟(300);
			}
			if (i[id] > 1)
			{//生命等于0时
				//怪物图像
				if (i[id] < 10000)
				{

					char Ay = -2;
					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					Ay++;
					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					Ay++;

					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 2] == 0)dx[1][ym[id] + Ay][xm[id] + 2] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 2] == 0)dx[1][ym[id] + Ay][xm[id] - 2] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 3] == 0)dx[1][ym[id] + Ay][xm[id] + 3] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 3] == 0)dx[1][ym[id] + Ay][xm[id] - 3] = id;
					Ay++;
					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					Ay++;
					//2

					{ if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id; }

					//else if (act1 == 3) { if (dx[1][ym[id] + Ay][xm[id] + 4] == 0) dx[1][ym[id] + Ay][xm[id] + 4] = id;if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id; }

					//else if (act1 == 4) {if (dx[1][ym[id] + Ay][xm[id] - 4] == 0)dx[1][ym[id] + Ay][xm[id] - 4] = id;if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;}
					Ay++;//3        if(dx[1][y + Ay][x]==0)
					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 2] == 0)dx[1][ym[id] + Ay][xm[id] + 2] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 2] == 0)dx[1][ym[id] + Ay][xm[id] - 2] = id;

					/*if (act1 == 3)
					{
						if (dx[1][ym[id] + Ay][xm[id] + 3] == 0)dx[1][ym[id] + Ay][xm[id] + 3] = id;
						if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
						if (dx[1][ym[id] + Ay][xm[id] + 2] == 0)dx[1][ym[id] + Ay][xm[id] + 2] = id;
						if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					}
					else     if (act1 == 4)
					{
						if (dx[1][ym[id] + Ay][xm[id] - 3] == 0)dx[1][ym[id] + Ay][xm[id] - 3] = id;
						if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
						if (dx[1][ym[id] + Ay][xm[id] - 2] == 0)dx[1][ym[id] + Ay][xm[id] - 2] = id;
						if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					}*/
					Ay++;//4
					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					{
						if (dx[1][ym[id] + Ay][xm[id] + 2] == 0)dx[1][ym[id] + Ay][xm[id] + 2] = id;
						if (dx[1][ym[id] + Ay][xm[id] - 2] == 0)dx[1][ym[id] + Ay][xm[id] - 2] = id;
					}
					Ay++;//5
					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					Ay++;//6

					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					Ay++;//6

					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					Ay++;//7

					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;//8



				}
				//怪物图像
				else
				{
					if (i[id] < 10001) {
						i[id]++;die[id]++;
					}
				}


				//if (i[id] < 20 && ni[id] == -1) { dieword = id;nice[id] = 0;ni[id] = -2; }//当怪物体力掉到一定程度求饶时



			}
			else//死亡触发
			{
				i[id] = 10000;
			}









		}
		else
		{
			if (nice[id] == 0)
			{
				if (nice[id] == 5)
				{


				}

				
			
				if (vill == 1)
				{
					
					
					if (id == 9000)
					{
						talkf(1, 5);
						if (meun == 1) { vill++;system("cls");talktime = 0;meun = '?'; mop[room]++; }
						if (meun == 3) { vill = 3;system("cls");talktime = 0;meun = '?'; }
						if (meun == 0) {vill = 0;system("cls");talktime = 0;exit; }
					}
					if (id == 9001)
					{
						talkf(6, 14);
						if (meun == 1) { vill++;system("cls");talktime = 0;meun = '?'; mop[room]++; }
						if (meun == 3) { vill = 3;system("cls");talktime = 0;meun = '?'; }
					}
				}
				if (vill == 2)
				{
					if (id == 9000)
					{
						talkf(15, 21);
						if (meun == 0) { vill--;system("cls");talktime = 0;exit; }//如果talk=0则将不显示与商人对话}
					}
					if (id == 9001)
					{
						talktime++;
						if (talktime > 0)printf("                                 Wdnmd走错了还能走到我家里来，                                                           \n");//
						if (talktime > 20)printf("                                 赶紧给我滚出去                                                           \n");//
						if (talktime > 40)printf("                                 要不然让你吃不完兜着走                                                           \n");//

						if (talktime > 60)printf("                                                     开溜~（按0退出）\n");
						if (talktime > 120)talktime = 120;
						if (meun == 0) { vill = 0;system("cls");talktime = 0;exit; }
					}
				}
				if (vill == 3) {
					if (id == 9000)
					{
						talkf(22, 42);
						//if (talktime > 450)talktime = 450;
						if (meun == 0) {
							vill = 5;system("cls");talktime = 0; meun = '?';
						}
						if (meun == 1) {
							vill = 6;system("cls");talktime = 0;meun = '?';
						}

					}
					if (id == 9001)
					{
						talktime++;
						if (talktime < 200) {
							if (talktime > 0)printf("                                 蛤？给小怡的信？                                                                                                                                                                                       \n");//printf("\n");小子，就凭你还想戏弄我？
							if (talktime > 20)printf("                                 我老弟这么出息了吗                                                                                                                                                                                        \n");//printf("\n");找死
							if (talktime > 40)printf("                                 我不信                                                                                                                                                                                        \n");//printf("\n");
							if (talktime > 60)printf("                                 把信给我看看！                                                           \n");//printf("\n");emmmmmm
							if (talktime > 80)printf("                                 。。。。。                                                           \n");//printf("\n");你懂的··········
							if (talktime > 100)printf("                                 。。。。。                                                           \n");//printf("\n");emmmmmmm
							if (talktime > 120)printf("                                 。。。。。                                                          \n");//printf("\n");就是······
							if (talktime > 140)printf("                                 还真是我老弟的字!                                                           \n");//printf("\n");啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊
							if (talktime > 160)printf("                                 写的还挺肉麻                                                           \n");//printf("\n");欸欸欸欸你别走啊~！
							if (talktime > 180)printf("                                 什么叫“给这世界上最可爱的小怡”                                                           \n");//printf("\n");就是我。。我。。我一直喜。。。。。。。。。。
						}
						else
						{
							if (talktime == 200) { system("cls"); }
							if (talktime > 200)printf("                                 。。。。。。                                                           \n");//printf("\n");喜欢我们村的小怡！！！！！
							if (talktime > 230)printf("                                 蛤蛤蛤，笑死我了                                                           \n");//printf("\n");md羞死老子了！
							if (talktime > 250)printf("                                 你可千万别告诉他我看过信了                                                           \n");//printf("\n");不！许！tm！的！给！老！子！笑！
							if (talktime > 270)printf("                                 你问我小怡在哪？                                                           \n");//printf("\n");
							if (talktime > 290)printf("                                 那丫头就在我这房子后面的房子里                                                           \n");//printf("\n");事成之后奖励大大滴有！
							if (talktime > 310)printf("                                 我俩兄弟打小和ta就是邻居                                                           \n");//printf("\n");你问奖励有多少？500金币！
							if (talktime > 330)printf("                                 老熟了                                                           \n");//printf("\n");md我堂堂拆二代500金币还是出的起的！
							if (talktime > 350)printf("                                 总之就这样吧，一路顺风                                                           \n");//printf("\n");总之就是这样了，信给我拿好
						}

						if (talktime > 380) {
							talktime = 0;vill = 0;system("cls");talktime = 0;nice[9001] = 1;meun = '?';
						}

					}
				}
				if (vill == 6)
				{
					if (id == 9000) {
						talktime++;

						if (talktime > 0)printf("                                 这份艰巨的任务就交给你了啊，兄嘚！                                                           \n");//printf("\n");可千万别被人发现啊
						if (talktime > 20)printf("                                 可千万别被人发现啊                                                           \n");//printf("\n");

						if (talktime > 40)printf("                                 小怡她家就在离这不远处，顺着路走就到了，一路顺风~                                                           \n");
						if (talktime > 60) { vill = 0;system("cls");talktime = 0;talk = 0;nice[id] = 1;exit; }
					}
				}
				if (vill == 5)
				{
					if (id == 9000) {
						talktime++;

						if (talktime > 0)printf("                                 正你大爷！你知道了我的秘密，                                                           \n");//printf("\n");可千万别被人发现啊
						if (talktime > 20)printf("                                 不想去也得去！                                                           \n");//printf("\n");
						if (talktime > 40)printf("                                 要不然，嘿嘿，你就完蛋了~~                                                           \n");
						if (talktime > 60)printf("                                 哎哎哎大哥别打脸，你就行行好                                                           \n");
						if (talktime > 80)printf("                                 帮小弟一次吧:)                                                           \n");
						if (talktime > 100)printf("                                 我的人生幸福可全在你手上拉                                                           \n");
						if (talktime > 120)printf("                                 有钱赚他不香吗~                                                           \n");
						if (talktime > 140)printf("                                 小怡她家就在离这不远处，顺着路走就到了，一路顺风~                                                           \n");
						if (talktime > 160) { vill = 0;system("cls");talktime = 0;talk = 0;nice[id] = 1;exit; }
					}
				}


				
			}
			if (nice[id] == 1)
			{
				printf("#############################################################################################################################################\n");
				if (vill == 1)
				{
					if (id == 9000)
					{
						talktime++;

						if (talktime > 0)printf("                                 还没打算走吗？走吧走吧，走完了就被发现了                                                           \n");//不知道外面究竟怎么样了

						if (talktime > 20)printf("                                 我也不知道怎么就来到了这个世界了，你能告诉我这是哪里吗？（按1）                                                           \n");//我可是国王的亲信，你必须得帮助我


						if (meun == 1) { vill++;system("cls");talktime = 0;meun = '?'; mop[room]++; }
						if (talktime > 120)talktime = 120;
						printf("                                                     溜了溜了~~~（按0退出）\n");
						if (meun == 0) { vill--;vill = 0;system("cls");talktime = 0;exit; }
					}
				}
				if (vill == 2)
				{
					if (id == 9000)
					{
						talktime++;
						if (talktime > 0)printf("                                 蛤！这里就是整个大陆最大的明珠！安格斯——浦东！                                                           \n");//
						if (talktime > 20)printf("                                 不过看你的样子也不像这片大陆上的人                                                           \n");//
						if (talktime > 40)printf("                                 马上这栋房子就要被国王的骑士拆迁了                                                           \n");//
						if (talktime > 60)printf("                                 这里据说是国王最喜欢的土地，果然还说要修建——呢啥·····                                                           \n");//
						if (talktime > 80)printf("                                 偶！对了，叫井屏！咱不是文化人，也不知道那是哈                                                           \n");//
						if (talktime > 100)printf("                                 但是我这次一定能得到国王的赏赐成为男爵吧！                                                           \n");//
						if (talktime > 120)printf("                                                     好的了解~（按0退出）\n");
						if (talktime > 120)talktime = 120;
						if (meun == 0) { vill--;system("cls");talktime = 0;exit; }//如果talk=0则将不显示与商人对话}
					}
				}
				printf("#############################################################################################################################################\n");
			}

		}

	}
}

void gard(int x2, int y2, int h1, int id, int r, int e)
{
  /*
  ---------------------------------------------------------------------------------------------------------------------------------------------
                           函数分为逻辑区与对话区
   常用参数 a,b，Ay
   x2					初始化横坐标													y2					初始化纵坐标 
   h1					初始化生命														id					怪物逻辑编号 
   r					怪物寻敌半径													e					是否为逻辑/对话
   die[id]				怪物死亡不在运行标志											i[id]				怪物的实际生命值+1
   x1					怪物横坐标														y1					怪物纵坐标 
   xm[id]				怪物实际横坐标											    	ym[id]				怪物实际纵坐标
   Vy2					怪物当前速度（整型）											max					最大速度 
   yfork				武器横坐标														xfork				武器纵坐标
   nice[id]				怪物善恶值													    ato[id]				怪物当前状态为巡逻/发现敌人
   fag[0]				是前往目标的标志												fag[1]				是第一个目标坐标 
   fag[2]				是第二个目标坐标												fag[3]				是怪物是否落地  
   aY[id]				怪物纵向加速度													axmonst[id]			怪物横向加速度
   actmonst[id]			怪物当前动作模型                                                dx[0][][]=id            怪物在游戏中逻辑层的模型
   vY[id]               怪物当前纵向速度(浮点数)										Vy2[id]				怪物当前纵向速度（整型）
   hurteen[id]          怪物受伤标志                                                    diewordx[0][id]         当怪物战斗中途触发的对话
   axmonst[id]          怪物横向加速度                                                  conmonst[id]        怪物左右朝向
   V1monst[id]          怪物横向速度（浮点数）                                          V2monst[id]         怪物横向速度整型数
  ----------------------------------------------------------------------------------------------------------------------------------------------
  */
	
	if (die[id] < 1)
	{
		int x1 = 0, y1 = 0, a = 0, b = 0, Vy2 = 0, c = 0, max = 3, atk = 3, yfork = 0, xfork = 0;
		//---------------------------------------------------------------------------
		//                             怪物逻辑区域
		//---------------------------------------------------------------------------
		if (e == 0)
		{
			if (i[id] == 0)//怪物数据函数初始化 
			{
				x2 = x2 + 30 + 30;
				xm[id] = x2;ym[id] = y2;
				i[id] = h1 + 1;
				ym[id] = 600 - ym[id];
				fag[id][1] = xm[id] + r;
				fag[id][2] = xm[id] - r;
				ato[id] = 1;
				aY[id] = 0;ni[id] = -1;
			}

			//寻敌

			if (nice[id] < 0)
			{

				{ ato[id] = 0;hdso = 0;talk = 0;dieword = id;ni[id] = -2;
				}

			}
			else { ato[id] = 1; }





			if (ato[id] == 1)//巡航，巡逻,待命
			{
				axmonst[id] = 0;V2monst[id] = 0;V1monst[id] = 0;actmonst[id] = 0;

			}
			else
			{




			}

			if (axmonst[id] >= 0) { conmonst[id] = 1; }
			else { conmonst[id] = -1; }

			if (axmonst[id] != 0)
			{
				V1monst[id] = V1monst[id] + axmonst[id] / 10;V2monst[id] = V1monst[id];
				if (V1monst[id] <= -3) {
					V1monst[id] = -3;
				}
				else if (V1monst[id] >= 3) {
					V1monst[id] = 3;
				}
			}
			if (V2monst[id] > 0)
			{

				{for (a = 0;a < V2monst[id];a++)
				{
					if (
						dx[0][ym[id] - 8][xm[id] + 2] == 3 || dx[0][ym[id] - 7][xm[id] + 2] == 3 || dx[0][ym[id] - 6][xm[id] + 2] == 3 || dx[0][ym[id] - 5][xm[id] - 2] == 3 || dx[0][ym[id] - 4][xm[id] + 3] == 3 || dx[0][ym[id] - 3][xm[id] - 3] == 3 || dx[0][ym[id] - 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
						)
					{
						V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] - 3;break;
					}

					xm[id]++;
				}
				}

			}
			if (V2monst[id] < 0)
			{

				{for (a = 0;a + V2monst[id];a++)
				{
					if (
						dx[0][ym[id] - 8][xm[id] - 2] == 3 || dx[0][ym[id] - 7][xm[id] - 2] == 3 || dx[0][ym[id] - 6][xm[id] - 2] == 3 || dx[0][ym[id] - 5][xm[id] - 2] == 3 || dx[0][ym[id] - 4][xm[id] - 3] == 3 || dx[0][ym[id] - 3][xm[id] - 3] == 3 || dx[0][ym[id] - 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
						)
					{
						V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] + 3;break;
					}

					xm[id]--;
				}
				}

			}


			if (dx[0][ym[id] + 9][xm[id]] != 2 && dx[0][ym[id] + 9][xm[id] + 1] != 2 && dx[0][ym[id] + 9][xm[id] - 1] != 2)//重力函数
			{

				physicsengine(id ,12);


			}
			y1 = ym[id];
			if (hurteen[id] != i[id])//伤害动画
			{
				hurteen[id] = i[id];
				延迟(300);
			}
			if (i[id] > 1)
			{//生命等于0时
				//怪物图像
				if (i[id] < 10000)
				{

					char Ay = -1;

					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;

					Ay++;

					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 2] == 0)dx[1][ym[id] + Ay][xm[id] + 2] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 2] == 0)dx[1][ym[id] + Ay][xm[id] - 2] = id;
					Ay++;
					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					Ay++;
					//2

					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;

					if (actmonst[id] == 3) {
						if (dx[1][ym[id] + Ay][xm[id] + 4] == 0) dx[1][ym[id] + Ay][xm[id] + 4] = id;
						if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					}

					else if (actmonst[id] == 4) {
						if (dx[1][ym[id] + Ay][xm[id] - 4] == 0)dx[1][ym[id] + Ay][xm[id] - 4] = id;
						if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					}
					Ay++;//3        if(dx[1][y + Ay][x]==0)
					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] + 2] == 0)dx[1][ym[id] + Ay][xm[id] + 2] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 2] == 0)dx[1][ym[id] + Ay][xm[id] - 2] = id;

					if (actmonst[id] == 3)
					{
						if (dx[1][ym[id] + Ay][xm[id] + 3] == 0)dx[1][ym[id] + Ay][xm[id] + 3] = id;
						if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
						if (dx[1][ym[id] + Ay][xm[id] + 2] == 0)dx[1][ym[id] + Ay][xm[id] + 2] = id;
						if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					}
					else     if (actmonst[id] == 4)
					{
						if (dx[1][ym[id] + Ay][xm[id] - 3] == 0)dx[1][ym[id] + Ay][xm[id] - 3] = id;
						if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
						if (dx[1][ym[id] + Ay][xm[id] - 2] == 0)dx[1][ym[id] + Ay][xm[id] - 2] = id;
						if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					}
					Ay++;//4
					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					if (actmonst[id] == 1 || actmonst[id] == 0) {
						if (dx[1][ym[id] + Ay][xm[id] + 2] == 0)dx[1][ym[id] + Ay][xm[id] + 2] = id;
						if (dx[1][ym[id] + Ay][xm[id] - 2] == 0)dx[1][ym[id] + Ay][xm[id] - 2] = id;
						if (dx[1][ym[id] + Ay][xm[id] + 3] == 0)dx[1][ym[id] + Ay][xm[id] + 3] = id;
						if (dx[1][ym[id] + Ay][xm[id] - 3] == 0)dx[1][ym[id] + Ay][xm[id] - 3] = id;

					}
					Ay++;//5
					if (dx[1][ym[id] + Ay][xm[id]] == 0)dx[1][ym[id] + Ay][xm[id]] = id;
					if (conmonst[id] < 0)if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					else if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					Ay++;//6

					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					Ay++;//6

					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;
					Ay++;//7

					if (dx[1][ym[id] + Ay][xm[id] + 1] == 0)dx[1][ym[id] + Ay][xm[id] + 1] = id;
					if (dx[1][ym[id] + Ay][xm[id] - 1] == 0)dx[1][ym[id] + Ay][xm[id] - 1] = id;//8

					if (actmonst[id] == 0)
					{
						Ay = 0;
						if (conmonst[id] >= 0)
						{

						}
						else {
							if (dx[1][ym[id] + Ay][xm[id] - 5] == 0)dx[1][ym[id] + Ay][xm[id] - 5] = id;
							if (dx[1][ym[id] + Ay][xm[id] - 6] == 0)dx[1][ym[id] + Ay][xm[id] - 6] = id;
							Ay++;
							if (dx[1][ym[id] + Ay][xm[id] - 5] == 0)dx[1][ym[id] + Ay][xm[id] - 5] = id;
							if (dx[1][ym[id] + Ay][xm[id] - 7] == 0)dx[1][ym[id] + Ay][xm[id] - 7] = id;
							Ay++;
							if (dx[1][ym[id] + Ay][xm[id] - 5] == 0)dx[1][ym[id] + Ay][xm[id] - 5] = id;
							if (dx[1][ym[id] + Ay][xm[id] - 7] == 0)dx[1][ym[id] + Ay][xm[id] - 7] = id;
							Ay++;
							if (dx[1][ym[id] + Ay][xm[id] - 5] == 0)dx[1][ym[id] + Ay][xm[id] - 5] = id;
							if (dx[1][ym[id] + Ay][xm[id] - 7] == 0)dx[1][ym[id] + Ay][xm[id] - 7] = id;
							if (dx[1][ym[id] + Ay][xm[id] - 6] == 0)dx[1][ym[id] + Ay][xm[id] - 6] = id;
							Ay++;
							if (dx[1][ym[id] + Ay][xm[id] - 5] == 0)dx[1][ym[id] + Ay][xm[id] - 5] = id;
							Ay++;
							if (dx[1][ym[id] + Ay][xm[id] - 5] == 0)dx[1][ym[id] + Ay][xm[id] - 5] = id;
							Ay++;
							if (dx[1][ym[id] + Ay][xm[id] - 5] == 0)dx[1][ym[id] + Ay][xm[id] - 5] = id;
							Ay++;
							if (dx[1][ym[id] + Ay][xm[id] - 5] == 0)dx[1][ym[id] + Ay][xm[id] - 5] = id;
							Ay++;
							if (dx[1][ym[id] + Ay][xm[id] - 5] == 0)dx[1][ym[id] + Ay][xm[id] - 5] = id;
							Ay++;
							if (dx[1][ym[id] + Ay][xm[id] - 5] == 0)dx[1][ym[id] + Ay][xm[id] - 5] = id;

						}
					}



				}
				//怪物图像
				else
				{
					if (i[id] < 10001) {
						i[id]++;die[id]++;
					}
				}


				//if (i[id] < 20 && ni[id] == -1) { dieword = id;nice[id] = 0;ni[id] = -2; }//当怪物体力掉到一定程度求饶时



			}
			else//死亡触发
		{
		i[id] = 10000;}








		}
		//---------------------------------------------------------------------------
		//                               对话框
		//---------------------------------------------------------------------------
		else
		{


		}
	}
}

void dionmondking(int x2, int y2, int h1, int id, int r, int e) 
{
	 
	

	/*
  ---------------------------------------------------------------------------------------------------------------------------------------------
						   函数分为逻辑区与对话区
   常用参数 a,b，Ay
   x2					初始化横坐标													y2					初始化纵坐标
   h1					初始化生命														id					怪物逻辑编号
   r					怪物寻敌半径													e					是否为逻辑/对话
   die[id]				怪物死亡不在运行标志											i[id]				怪物的实际生命值+1
   x1					怪物横坐标														y1					怪物纵坐标
   xm[id]				怪物实际横坐标											    	ym[id]				怪物实际纵坐标
   Vy2					怪物当前速度（整型）											max					最大速度
   yfork				武器横坐标														xfork				武器纵坐标
   nice[id]				怪物善恶值													    ato[id]				怪物当前状态为巡逻/发现敌人
   fag[0]				是前往目标的标志												fag[1]				是第一个目标坐标
   fag[2]				是第二个目标坐标												fag[3]				是怪物是否落地
   aY[id]				怪物纵向加速度													axmonst[id]			怪物横向加速度
   actmonst[id]			怪物当前动作模型                                                dx[0][][]=id            怪物在游戏中逻辑层的模型
   vY[id]               怪物当前纵向速度(浮点数)										Vy2[id]				怪物当前纵向速度（整型）
   hurteen[id]          怪物受伤标志                                                    diewordx[0][id]         当怪物战斗中途触发的对话
   axmonst[id]          怪物横向加速度                                                  conmonst[id]        怪物左右朝向
   V1monst[id]          怪物横向速度（浮点数）                                          V2monst[id]         怪物横向速度整型数
   meun                 怪物对话深度（层次）
  ----------------------------------------------------------------------------------------------------------------------------------------------
  */

		if (die[id] < 1)
		{
			int x1 = 0, y1 = 0, a = 0, b = 0, Vy2 = 0, c = 0, max = 3, atk = 3, yfork = 0, xfork = 0;
			if (e == 0)
			{
				if (i[id] == 0)//怪物数据函数初始化 
				{
					x2 = x2 + 30 + 30;
					xm[id] = x2;ym[id] = y2;i[id] = h1 + 1;ym[id] = 600 - ym[id];fag[id][1] = xm[id] + r;fag[id][2] = xm[id] - r;ato[id] = 1;aY[id] = 0;ni[id] = -1;
				}

				//寻敌

				if (nice[id] < 0)
				{

					{ ato[id] = 0;hdso = 0;talk = 0;dieword = id;nice[id] = 0;ni[id] = -2;
					}

				}
				else { ato[id] = 1; }





				if (ato[id] == 1)//巡航，巡逻,待命
				{
					//axmonst[id] = 0;V2monst[id] = 0;V1monst[id] = 0;actmonst[id] = 0;

				}
				else
				{




				}

				

				if (axmonst[id] != 0)
				{
					V1monst[id] = V1monst[id] + axmonst[id] / (float)10;V2monst[id] = V1monst[id];
					if (V1monst[id] <= -4) {
						V1monst[id] = -4;
					}
					else if (V1monst[id] >= 4) {
						V1monst[id] = 4;
					}
				}
				actmonst[id] = 0;
				if (V2monst[id] > 0)
				{

					{for (a = 0;a < V2monst[id];a++)
					{/*
						if (
							dx[0][ym[id] + 8][xm[id] + 2] == 3 || dx[0][ym[id] + 7][xm[id] + 2] == 3 || dx[0][ym[id] + 6][xm[id] + 2] == 3 || dx[0][ym[id] + 5][xm[id] - 2] == 3 || dx[0][ym[id] + 4][xm[id] + 3] == 3 || dx[0][ym[id] + 3][xm[id] - 3] == 3 || dx[0][ym[id] + 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
							)
						{
							V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] - 3;break;
						}*/

						xm[id]++;
						actmonst[id] = 1;
						conmonst[id] = 1;
					}
					}

				}
				if (V2monst[id] < 0)
				{

					{for (a = 0;a + V2monst[id];a++)
					{
						if (
							dx[0][ym[id] + 8][xm[id] - 2] == 3 || dx[0][ym[id] + 7][xm[id] - 2] == 3 || dx[0][ym[id] + 6][xm[id] - 2] == 3 || dx[0][ym[id] + 5][xm[id] - 2] == 3 || dx[0][ym[id] + 4][xm[id] - 3] == 3 || dx[0][ym[id] + 3][xm[id] - 3] == 3 || dx[0][ym[id] + 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
							)
						{
							V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] + 3;break;
						}

						xm[id]--;
						actmonst[id] = 1;
						conmonst[id] = -1;
					}
					}

				}


			
					physicsengine(id,13);


				
				y1 = ym[id];
				if (hurteen[id] != i[id])//伤害动画
				{
					hurteen[id] = i[id];
					延迟(300);
				}
				if (i[id] > 1)
				{//生命等于0时
					//怪物图像
					if (i[id] < 10000)
					{
						int *p1, *p2;
						p2 = &ym[id];
						p1 = &xm[id];
						if (conmonst[id] >= 0) {
							if (actmonst[id] == 0) {
								if (dx[1][*p2 - 2][*p1 + 0] == 0)dx[1][*p2 - 2][*p1 + 0] = id;if (dx[1][*p2 - 1][*p1 - 2] == 0)dx[1][*p2 - 1][*p1 - 2] = id;if (dx[1][*p2 - 1][*p1 + 0] == 0)dx[1][*p2 - 1][*p1 + 0] = id;if (dx[1][*p2 - 1][*p1 + 2] == 0)dx[1][*p2 - 1][*p1 + 2] = id;if (dx[1][*p2 + 0][*p1 - 2] == 0)dx[1][*p2 + 0][*p1 - 2] = id;if (dx[1][*p2 + 0][*p1 - 1] == 0)dx[1][*p2 + 0][*p1 - 1] = id;if (dx[1][*p2 + 0][*p1 + 0] == 0)dx[1][*p2 + 0][*p1 + 0] = id;if (dx[1][*p2 + 0][*p1 + 1] == 0)dx[1][*p2 + 0][*p1 + 1] = id;if (dx[1][*p2 + 0][*p1 + 2] == 0)dx[1][*p2 + 0][*p1 + 2] = id;
								if (dx[1][*p2 + 1][*p1 - 1] == 0)dx[1][*p2 + 1][*p1 - 1] = id;if (dx[1][*p2 + 1][*p1 + 0] == 0)dx[1][*p2 + 1][*p1 + 0] = id;if (dx[1][*p2 + 1][*p1 + 1] == 0)dx[1][*p2 + 1][*p1 + 1] = id;if (dx[1][*p2 + 2][*p1 + 0] == 0)dx[1][*p2 + 2][*p1 + 0] = id;if (dx[1][*p2 + 3][*p1 - 4] == 0)dx[1][*p2 + 3][*p1 - 4] = id;if (dx[1][*p2 + 3][*p1 - 3] == 0)dx[1][*p2 + 3][*p1 - 3] = id;if (dx[1][*p2 + 3][*p1 - 2] == 0)dx[1][*p2 + 3][*p1 - 2] = id;if (dx[1][*p2 + 3][*p1 - 1] == 0)dx[1][*p2 + 3][*p1 - 1] = id;if (dx[1][*p2 + 3][*p1 + 0] == 0)dx[1][*p2 + 3][*p1 + 0] = id;
								if (dx[1][*p2 + 3][*p1 + 1] == 0)dx[1][*p2 + 3][*p1 + 1] = id;if (dx[1][*p2 + 3][*p1 + 2] == 0)dx[1][*p2 + 3][*p1 + 2] = id;if (dx[1][*p2 + 3][*p1 + 3] == 0)dx[1][*p2 + 3][*p1 + 3] = id;if (dx[1][*p2 + 4][*p1 - 5] == 0)dx[1][*p2 + 4][*p1 - 5] = id;if (dx[1][*p2 + 4][*p1 - 4] == 0)dx[1][*p2 + 4][*p1 - 4] = id;if (dx[1][*p2 + 4][*p1 - 3] == 0)dx[1][*p2 + 4][*p1 - 3] = id;if (dx[1][*p2 + 4][*p1 - 2] == 0)dx[1][*p2 + 4][*p1 - 2] = id;if (dx[1][*p2 + 4][*p1 + 0] == 0)dx[1][*p2 + 4][*p1 + 0] = id;if (dx[1][*p2 + 4][*p1 + 2] == 0)dx[1][*p2 + 4][*p1 + 2] = id;
								if (dx[1][*p2 + 4][*p1 + 3] == 0)dx[1][*p2 + 4][*p1 + 3] = id;if (dx[1][*p2 + 4][*p1 + 4] == 0)dx[1][*p2 + 4][*p1 + 4] = id;if (dx[1][*p2 + 5][*p1 - 6] == 0)dx[1][*p2 + 5][*p1 - 6] = id;if (dx[1][*p2 + 5][*p1 - 5] == 0)dx[1][*p2 + 5][*p1 - 5] = id;if (dx[1][*p2 + 5][*p1 - 2] == 0)dx[1][*p2 + 5][*p1 - 2] = id;if (dx[1][*p2 + 5][*p1 + 0] == 0)dx[1][*p2 + 5][*p1 + 0] = id;if (dx[1][*p2 + 5][*p1 + 2] == 0)dx[1][*p2 + 5][*p1 + 2] = id;if (dx[1][*p2 + 5][*p1 + 4] == 0)dx[1][*p2 + 5][*p1 + 4] = id;if (dx[1][*p2 + 6][*p1 - 7] == 0)dx[1][*p2 + 6][*p1 - 7] = id;
								if (dx[1][*p2 + 6][*p1 - 6] == 0)dx[1][*p2 + 6][*p1 - 6] = id;if (dx[1][*p2 + 6][*p1 - 2] == 0)dx[1][*p2 + 6][*p1 - 2] = id;if (dx[1][*p2 + 6][*p1 - 1] == 0)dx[1][*p2 + 6][*p1 - 1] = id;if (dx[1][*p2 + 6][*p1 + 0] == 0)dx[1][*p2 + 6][*p1 + 0] = id;if (dx[1][*p2 + 6][*p1 + 1] == 0)dx[1][*p2 + 6][*p1 + 1] = id;if (dx[1][*p2 + 6][*p1 + 4] == 0)dx[1][*p2 + 6][*p1 + 4] = id;if (dx[1][*p2 + 7][*p1 - 8] == 0)dx[1][*p2 + 7][*p1 - 8] = id;if (dx[1][*p2 + 7][*p1 - 7] == 0)dx[1][*p2 + 7][*p1 - 7] = id;if (dx[1][*p2 + 7][*p1 - 1] == 0)dx[1][*p2 + 7][*p1 - 1] = id;
								if (dx[1][*p2 + 7][*p1 + 1] == 0)dx[1][*p2 + 7][*p1 + 1] = id;if (dx[1][*p2 + 7][*p1 + 4] == 0)dx[1][*p2 + 7][*p1 + 4] = id;if (dx[1][*p2 + 8][*p1 - 8] == 0)dx[1][*p2 + 8][*p1 - 8] = id;if (dx[1][*p2 + 8][*p1 - 7] == 0)dx[1][*p2 + 8][*p1 - 7] = id;if (dx[1][*p2 + 8][*p1 - 6] == 0)dx[1][*p2 + 8][*p1 - 6] = id;if (dx[1][*p2 + 8][*p1 - 3] == 0)dx[1][*p2 + 8][*p1 - 3] = id;if (dx[1][*p2 + 8][*p1 - 1] == 0)dx[1][*p2 + 8][*p1 - 1] = id;if (dx[1][*p2 + 8][*p1 + 1] == 0)dx[1][*p2 + 8][*p1 + 1] = id;if (dx[1][*p2 + 8][*p1 + 4] == 0)dx[1][*p2 + 8][*p1 + 4] = id;
								if (dx[1][*p2 + 9][*p1 - 8] == 0)dx[1][*p2 + 9][*p1 - 8] = id;if (dx[1][*p2 + 9][*p1 - 7] == 0)dx[1][*p2 + 9][*p1 - 7] = id;if (dx[1][*p2 + 9][*p1 - 6] == 0)dx[1][*p2 + 9][*p1 - 6] = id;if (dx[1][*p2 + 9][*p1 - 5] == 0)dx[1][*p2 + 9][*p1 - 5] = id;if (dx[1][*p2 + 9][*p1 - 4] == 0)dx[1][*p2 + 9][*p1 - 4] = id;if (dx[1][*p2 + 9][*p1 - 3] == 0)dx[1][*p2 + 9][*p1 - 3] = id;if (dx[1][*p2 + 9][*p1 - 1] == 0)dx[1][*p2 + 9][*p1 - 1] = id;if (dx[1][*p2 + 9][*p1 + 1] == 0)dx[1][*p2 + 9][*p1 + 1] = id;if (dx[1][*p2 + 9][*p1 + 2] == 0)dx[1][*p2 + 9][*p1 + 2] = id;
								if (dx[1][*p2 + 9][*p1 + 3] == 0)dx[1][*p2 + 9][*p1 + 3] = id;if (dx[1][*p2 + 9][*p1 + 4] == 0)dx[1][*p2 + 9][*p1 + 4] = id;
							}
							if (actmonst[id] == 1) {
								if (dx[1][*p2 - 2][*p1 + 0] == 0)dx[1][*p2 - 2][*p1 + 0] = id;if (dx[1][*p2 - 1][*p1 - 2] == 0)dx[1][*p2 - 1][*p1 - 2] = id;if (dx[1][*p2 - 1][*p1 + 0] == 0)dx[1][*p2 - 1][*p1 + 0] = id;if (dx[1][*p2 - 1][*p1 + 2] == 0)dx[1][*p2 - 1][*p1 + 2] = id;if (dx[1][*p2 + 0][*p1 - 2] == 0)dx[1][*p2 + 0][*p1 - 2] = id;if (dx[1][*p2 + 0][*p1 - 1] == 0)dx[1][*p2 + 0][*p1 - 1] = id;if (dx[1][*p2 + 0][*p1 + 0] == 0)dx[1][*p2 + 0][*p1 + 0] = id;if (dx[1][*p2 + 0][*p1 + 1] == 0)dx[1][*p2 + 0][*p1 + 1] = id;if (dx[1][*p2 + 0][*p1 + 2] == 0)dx[1][*p2 + 0][*p1 + 2] = id;
								if (dx[1][*p2 + 1][*p1 - 1] == 0)dx[1][*p2 + 1][*p1 - 1] = id;if (dx[1][*p2 + 1][*p1 + 0] == 0)dx[1][*p2 + 1][*p1 + 0] = id;if (dx[1][*p2 + 1][*p1 + 1] == 0)dx[1][*p2 + 1][*p1 + 1] = id;if (dx[1][*p2 + 2][*p1 + 0] == 0)dx[1][*p2 + 2][*p1 + 0] = id;if (dx[1][*p2 + 3][*p1 - 6] == 0)dx[1][*p2 + 3][*p1 - 6] = id;if (dx[1][*p2 + 3][*p1 - 5] == 0)dx[1][*p2 + 3][*p1 - 5] = id;if (dx[1][*p2 + 3][*p1 - 4] == 0)dx[1][*p2 + 3][*p1 - 4] = id;if (dx[1][*p2 + 3][*p1 - 3] == 0)dx[1][*p2 + 3][*p1 - 3] = id;if (dx[1][*p2 + 3][*p1 - 2] == 0)dx[1][*p2 + 3][*p1 - 2] = id;
								if (dx[1][*p2 + 3][*p1 - 1] == 0)dx[1][*p2 + 3][*p1 - 1] = id;if (dx[1][*p2 + 3][*p1 + 0] == 0)dx[1][*p2 + 3][*p1 + 0] = id;if (dx[1][*p2 + 3][*p1 + 1] == 0)dx[1][*p2 + 3][*p1 + 1] = id;if (dx[1][*p2 + 3][*p1 + 2] == 0)dx[1][*p2 + 3][*p1 + 2] = id;if (dx[1][*p2 + 4][*p1 - 9] == 0)dx[1][*p2 + 4][*p1 - 9] = id;if (dx[1][*p2 + 4][*p1 - 8] == 0)dx[1][*p2 + 4][*p1 - 8] = id;if (dx[1][*p2 + 4][*p1 - 7] == 0)dx[1][*p2 + 4][*p1 - 7] = id;if (dx[1][*p2 + 4][*p1 - 4] == 0)dx[1][*p2 + 4][*p1 - 4] = id;if (dx[1][*p2 + 4][*p1 - 3] == 0)dx[1][*p2 + 4][*p1 - 3] = id;
								if (dx[1][*p2 + 4][*p1 - 2] == 0)dx[1][*p2 + 4][*p1 - 2] = id;if (dx[1][*p2 + 4][*p1 + 0] == 0)dx[1][*p2 + 4][*p1 + 0] = id;if (dx[1][*p2 + 4][*p1 + 2] == 0)dx[1][*p2 + 4][*p1 + 2] = id;if (dx[1][*p2 + 5][*p1 - 12] == 0)dx[1][*p2 + 5][*p1 - 12] = id;if (dx[1][*p2 + 5][*p1 - 11] == 0)dx[1][*p2 + 5][*p1 - 11] = id;if (dx[1][*p2 + 5][*p1 - 10] == 0)dx[1][*p2 + 5][*p1 - 10] = id;if (dx[1][*p2 + 5][*p1 - 5] == 0)dx[1][*p2 + 5][*p1 - 5] = id;if (dx[1][*p2 + 5][*p1 - 4] == 0)dx[1][*p2 + 5][*p1 - 4] = id;if (dx[1][*p2 + 5][*p1 - 2] == 0)dx[1][*p2 + 5][*p1 - 2] = id;
								if (dx[1][*p2 + 5][*p1 + 0] == 0)dx[1][*p2 + 5][*p1 + 0] = id;if (dx[1][*p2 + 5][*p1 + 2] == 0)dx[1][*p2 + 5][*p1 + 2] = id;if (dx[1][*p2 + 6][*p1 - 15] == 0)dx[1][*p2 + 6][*p1 - 15] = id;if (dx[1][*p2 + 6][*p1 - 14] == 0)dx[1][*p2 + 6][*p1 - 14] = id;if (dx[1][*p2 + 6][*p1 - 13] == 0)dx[1][*p2 + 6][*p1 - 13] = id;if (dx[1][*p2 + 6][*p1 - 8] == 0)dx[1][*p2 + 6][*p1 - 8] = id;if (dx[1][*p2 + 6][*p1 - 7] == 0)dx[1][*p2 + 6][*p1 - 7] = id;if (dx[1][*p2 + 6][*p1 - 6] == 0)dx[1][*p2 + 6][*p1 - 6] = id;if (dx[1][*p2 + 6][*p1 - 1] == 0)dx[1][*p2 + 6][*p1 - 1] = id;
								if (dx[1][*p2 + 6][*p1 + 0] == 0)dx[1][*p2 + 6][*p1 + 0] = id;if (dx[1][*p2 + 6][*p1 + 1] == 0)dx[1][*p2 + 6][*p1 + 1] = id;if (dx[1][*p2 + 7][*p1 - 13] == 0)dx[1][*p2 + 7][*p1 - 13] = id;if (dx[1][*p2 + 7][*p1 - 12] == 0)dx[1][*p2 + 7][*p1 - 12] = id;if (dx[1][*p2 + 7][*p1 - 11] == 0)dx[1][*p2 + 7][*p1 - 11] = id;if (dx[1][*p2 + 7][*p1 - 10] == 0)dx[1][*p2 + 7][*p1 - 10] = id;if (dx[1][*p2 + 7][*p1 - 9] == 0)dx[1][*p2 + 7][*p1 - 9] = id;if (dx[1][*p2 + 7][*p1 - 1] == 0)dx[1][*p2 + 7][*p1 - 1] = id;if (dx[1][*p2 + 7][*p1 + 1] == 0)dx[1][*p2 + 7][*p1 + 1] = id;
								if (dx[1][*p2 + 8][*p1 - 1] == 0)dx[1][*p2 + 8][*p1 - 1] = id;if (dx[1][*p2 + 8][*p1 + 1] == 0)dx[1][*p2 + 8][*p1 + 1] = id;if (dx[1][*p2 + 9][*p1 - 1] == 0)dx[1][*p2 + 9][*p1 - 1] = id;if (dx[1][*p2 + 9][*p1 + 1] == 0)dx[1][*p2 + 9][*p1 + 1] = id;
							}
						}
						else
						{
							if (actmonst[id] == 0) {
								if (dx[1][*p2 - 2][*p1 - 0] == 0)dx[1][*p2 - 2][*p1 - 0] = id;if (dx[1][*p2 - 1][*p1 + 2] == 0)dx[1][*p2 - 1][*p1 + 2] = id;if (dx[1][*p2 - 1][*p1 - 0] == 0)dx[1][*p2 - 1][*p1 - 0] = id;if (dx[1][*p2 - 1][*p1 - 2] == 0)dx[1][*p2 - 1][*p1 - 2] = id;if (dx[1][*p2 + 0][*p1 + 2] == 0)dx[1][*p2 + 0][*p1 + 2] = id;if (dx[1][*p2 + 0][*p1 + 1] == 0)dx[1][*p2 + 0][*p1 + 1] = id;if (dx[1][*p2 + 0][*p1 - 0] == 0)dx[1][*p2 + 0][*p1 - 0] = id;if (dx[1][*p2 + 0][*p1 - 1] == 0)dx[1][*p2 + 0][*p1 - 1] = id;if (dx[1][*p2 + 0][*p1 - 2] == 0)dx[1][*p2 + 0][*p1 - 2] = id;
								if (dx[1][*p2 + 1][*p1 + 1] == 0)dx[1][*p2 + 1][*p1 + 1] = id;if (dx[1][*p2 + 1][*p1 - 0] == 0)dx[1][*p2 + 1][*p1 - 0] = id;if (dx[1][*p2 + 1][*p1 - 1] == 0)dx[1][*p2 + 1][*p1 - 1] = id;if (dx[1][*p2 + 2][*p1 - 0] == 0)dx[1][*p2 + 2][*p1 - 0] = id;if (dx[1][*p2 + 3][*p1 + 4] == 0)dx[1][*p2 + 3][*p1 + 4] = id;if (dx[1][*p2 + 3][*p1 + 3] == 0)dx[1][*p2 + 3][*p1 + 3] = id;if (dx[1][*p2 + 3][*p1 + 2] == 0)dx[1][*p2 + 3][*p1 + 2] = id;if (dx[1][*p2 + 3][*p1 + 1] == 0)dx[1][*p2 + 3][*p1 + 1] = id;if (dx[1][*p2 + 3][*p1 - 0] == 0)dx[1][*p2 + 3][*p1 - 0] = id;
								if (dx[1][*p2 + 3][*p1 - 1] == 0)dx[1][*p2 + 3][*p1 - 1] = id;if (dx[1][*p2 + 3][*p1 - 2] == 0)dx[1][*p2 + 3][*p1 - 2] = id;if (dx[1][*p2 + 3][*p1 - 3] == 0)dx[1][*p2 + 3][*p1 - 3] = id;if (dx[1][*p2 + 4][*p1 + 5] == 0)dx[1][*p2 + 4][*p1 + 5] = id;if (dx[1][*p2 + 4][*p1 + 4] == 0)dx[1][*p2 + 4][*p1 + 4] = id;if (dx[1][*p2 + 4][*p1 + 3] == 0)dx[1][*p2 + 4][*p1 + 3] = id;if (dx[1][*p2 + 4][*p1 + 2] == 0)dx[1][*p2 + 4][*p1 + 2] = id;if (dx[1][*p2 + 4][*p1 - 0] == 0)dx[1][*p2 + 4][*p1 - 0] = id;if (dx[1][*p2 + 4][*p1 - 2] == 0)dx[1][*p2 + 4][*p1 - 2] = id;
								if (dx[1][*p2 + 4][*p1 - 3] == 0)dx[1][*p2 + 4][*p1 - 3] = id;if (dx[1][*p2 + 4][*p1 - 4] == 0)dx[1][*p2 + 4][*p1 - 4] = id;if (dx[1][*p2 + 5][*p1 + 6] == 0)dx[1][*p2 + 5][*p1 + 6] = id;if (dx[1][*p2 + 5][*p1 + 5] == 0)dx[1][*p2 + 5][*p1 + 5] = id;if (dx[1][*p2 + 5][*p1 + 2] == 0)dx[1][*p2 + 5][*p1 + 2] = id;if (dx[1][*p2 + 5][*p1 - 0] == 0)dx[1][*p2 + 5][*p1 - 0] = id;if (dx[1][*p2 + 5][*p1 - 2] == 0)dx[1][*p2 + 5][*p1 - 2] = id;if (dx[1][*p2 + 5][*p1 - 4] == 0)dx[1][*p2 + 5][*p1 - 4] = id;if (dx[1][*p2 + 6][*p1 + 7] == 0)dx[1][*p2 + 6][*p1 + 7] = id;
								if (dx[1][*p2 + 6][*p1 + 6] == 0)dx[1][*p2 + 6][*p1 + 6] = id;if (dx[1][*p2 + 6][*p1 + 2] == 0)dx[1][*p2 + 6][*p1 + 2] = id;if (dx[1][*p2 + 6][*p1 + 1] == 0)dx[1][*p2 + 6][*p1 + 1] = id;if (dx[1][*p2 + 6][*p1 - 0] == 0)dx[1][*p2 + 6][*p1 - 0] = id;if (dx[1][*p2 + 6][*p1 - 1] == 0)dx[1][*p2 + 6][*p1 - 1] = id;if (dx[1][*p2 + 6][*p1 - 4] == 0)dx[1][*p2 + 6][*p1 - 4] = id;if (dx[1][*p2 + 7][*p1 + 8] == 0)dx[1][*p2 + 7][*p1 + 8] = id;if (dx[1][*p2 + 7][*p1 + 7] == 0)dx[1][*p2 + 7][*p1 + 7] = id;if (dx[1][*p2 + 7][*p1 + 1] == 0)dx[1][*p2 + 7][*p1 + 1] = id;
								if (dx[1][*p2 + 7][*p1 - 1] == 0)dx[1][*p2 + 7][*p1 - 1] = id;if (dx[1][*p2 + 7][*p1 - 4] == 0)dx[1][*p2 + 7][*p1 - 4] = id;if (dx[1][*p2 + 8][*p1 + 8] == 0)dx[1][*p2 + 8][*p1 + 8] = id;if (dx[1][*p2 + 8][*p1 + 7] == 0)dx[1][*p2 + 8][*p1 + 7] = id;if (dx[1][*p2 + 8][*p1 + 6] == 0)dx[1][*p2 + 8][*p1 + 6] = id;if (dx[1][*p2 + 8][*p1 + 3] == 0)dx[1][*p2 + 8][*p1 + 3] = id;if (dx[1][*p2 + 8][*p1 + 1] == 0)dx[1][*p2 + 8][*p1 + 1] = id;if (dx[1][*p2 + 8][*p1 - 1] == 0)dx[1][*p2 + 8][*p1 - 1] = id;if (dx[1][*p2 + 8][*p1 - 4] == 0)dx[1][*p2 + 8][*p1 - 4] = id;
								if (dx[1][*p2 + 9][*p1 + 8] == 0)dx[1][*p2 + 9][*p1 + 8] = id;if (dx[1][*p2 + 9][*p1 + 7] == 0)dx[1][*p2 + 9][*p1 + 7] = id;if (dx[1][*p2 + 9][*p1 + 6] == 0)dx[1][*p2 + 9][*p1 + 6] = id;if (dx[1][*p2 + 9][*p1 + 5] == 0)dx[1][*p2 + 9][*p1 + 5] = id;if (dx[1][*p2 + 9][*p1 + 4] == 0)dx[1][*p2 + 9][*p1 + 4] = id;if (dx[1][*p2 + 9][*p1 + 3] == 0)dx[1][*p2 + 9][*p1 + 3] = id;if (dx[1][*p2 + 9][*p1 + 1] == 0)dx[1][*p2 + 9][*p1 + 1] = id;if (dx[1][*p2 + 9][*p1 - 1] == 0)dx[1][*p2 + 9][*p1 - 1] = id;if (dx[1][*p2 + 9][*p1 - 2] == 0)dx[1][*p2 + 9][*p1 - 2] = id;
								if (dx[1][*p2 + 9][*p1 - 3] == 0)dx[1][*p2 + 9][*p1 - 3] = id;if (dx[1][*p2 + 9][*p1 - 4] == 0)dx[1][*p2 + 9][*p1 - 4] = id;
							}
							if (actmonst[id] == 1) {
								if (dx[1][*p2 - 2][*p1 - 0] == 0)dx[1][*p2 - 2][*p1 - 0] = id;if (dx[1][*p2 - 1][*p1 + 2] == 0)dx[1][*p2 - 1][*p1 + 2] = id;if (dx[1][*p2 - 1][*p1 - 0] == 0)dx[1][*p2 - 1][*p1 - 0] = id;if (dx[1][*p2 - 1][*p1 - 2] == 0)dx[1][*p2 - 1][*p1 - 2] = id;if (dx[1][*p2 + 0][*p1 + 2] == 0)dx[1][*p2 + 0][*p1 + 2] = id;if (dx[1][*p2 + 0][*p1 + 1] == 0)dx[1][*p2 + 0][*p1 + 1] = id;if (dx[1][*p2 + 0][*p1 - 0] == 0)dx[1][*p2 + 0][*p1 - 0] = id;if (dx[1][*p2 + 0][*p1 - 1] == 0)dx[1][*p2 + 0][*p1 - 1] = id;if (dx[1][*p2 + 0][*p1 - 2] == 0)dx[1][*p2 + 0][*p1 - 2] = id;
								if (dx[1][*p2 + 1][*p1 + 1] == 0)dx[1][*p2 + 1][*p1 + 1] = id;if (dx[1][*p2 + 1][*p1 - 0] == 0)dx[1][*p2 + 1][*p1 - 0] = id;if (dx[1][*p2 + 1][*p1 - 1] == 0)dx[1][*p2 + 1][*p1 - 1] = id;if (dx[1][*p2 + 2][*p1 - 0] == 0)dx[1][*p2 + 2][*p1 - 0] = id;if (dx[1][*p2 + 3][*p1 + 6] == 0)dx[1][*p2 + 3][*p1 + 6] = id;if (dx[1][*p2 + 3][*p1 + 5] == 0)dx[1][*p2 + 3][*p1 + 5] = id;if (dx[1][*p2 + 3][*p1 + 4] == 0)dx[1][*p2 + 3][*p1 + 4] = id;if (dx[1][*p2 + 3][*p1 + 3] == 0)dx[1][*p2 + 3][*p1 + 3] = id;if (dx[1][*p2 + 3][*p1 + 2] == 0)dx[1][*p2 + 3][*p1 + 2] = id;
								if (dx[1][*p2 + 3][*p1 + 1] == 0)dx[1][*p2 + 3][*p1 + 1] = id;if (dx[1][*p2 + 3][*p1 - 0] == 0)dx[1][*p2 + 3][*p1 - 0] = id;if (dx[1][*p2 + 3][*p1 - 1] == 0)dx[1][*p2 + 3][*p1 - 1] = id;if (dx[1][*p2 + 3][*p1 - 2] == 0)dx[1][*p2 + 3][*p1 - 2] = id;if (dx[1][*p2 + 4][*p1 + 9] == 0)dx[1][*p2 + 4][*p1 + 9] = id;if (dx[1][*p2 + 4][*p1 + 8] == 0)dx[1][*p2 + 4][*p1 + 8] = id;if (dx[1][*p2 + 4][*p1 + 7] == 0)dx[1][*p2 + 4][*p1 + 7] = id;if (dx[1][*p2 + 4][*p1 + 4] == 0)dx[1][*p2 + 4][*p1 + 4] = id;if (dx[1][*p2 + 4][*p1 + 3] == 0)dx[1][*p2 + 4][*p1 + 3] = id;
								if (dx[1][*p2 + 4][*p1 + 2] == 0)dx[1][*p2 + 4][*p1 + 2] = id;if (dx[1][*p2 + 4][*p1 - 0] == 0)dx[1][*p2 + 4][*p1 - 0] = id;if (dx[1][*p2 + 4][*p1 - 2] == 0)dx[1][*p2 + 4][*p1 - 2] = id;if (dx[1][*p2 + 5][*p1 + 12] == 0)dx[1][*p2 + 5][*p1 + 12] = id;if (dx[1][*p2 + 5][*p1 + 11] == 0)dx[1][*p2 + 5][*p1 + 11] = id;if (dx[1][*p2 + 5][*p1 + 10] == 0)dx[1][*p2 + 5][*p1 + 10] = id;if (dx[1][*p2 + 5][*p1 + 5] == 0)dx[1][*p2 + 5][*p1 + 5] = id;if (dx[1][*p2 + 5][*p1 + 4] == 0)dx[1][*p2 + 5][*p1 + 4] = id;if (dx[1][*p2 + 5][*p1 + 2] == 0)dx[1][*p2 + 5][*p1 + 2] = id;
								if (dx[1][*p2 + 5][*p1 - 0] == 0)dx[1][*p2 + 5][*p1 - 0] = id;if (dx[1][*p2 + 5][*p1 - 2] == 0)dx[1][*p2 + 5][*p1 - 2] = id;if (dx[1][*p2 + 6][*p1 + 15] == 0)dx[1][*p2 + 6][*p1 + 15] = id;if (dx[1][*p2 + 6][*p1 + 14] == 0)dx[1][*p2 + 6][*p1 + 14] = id;if (dx[1][*p2 + 6][*p1 + 13] == 0)dx[1][*p2 + 6][*p1 + 13] = id;if (dx[1][*p2 + 6][*p1 + 8] == 0)dx[1][*p2 + 6][*p1 + 8] = id;if (dx[1][*p2 + 6][*p1 + 7] == 0)dx[1][*p2 + 6][*p1 + 7] = id;if (dx[1][*p2 + 6][*p1 + 6] == 0)dx[1][*p2 + 6][*p1 + 6] = id;if (dx[1][*p2 + 6][*p1 + 1] == 0)dx[1][*p2 + 6][*p1 + 1] = id;
								if (dx[1][*p2 + 6][*p1 - 0] == 0)dx[1][*p2 + 6][*p1 - 0] = id;if (dx[1][*p2 + 6][*p1 - 1] == 0)dx[1][*p2 + 6][*p1 - 1] = id;if (dx[1][*p2 + 7][*p1 + 13] == 0)dx[1][*p2 + 7][*p1 + 13] = id;if (dx[1][*p2 + 7][*p1 + 12] == 0)dx[1][*p2 + 7][*p1 + 12] = id;if (dx[1][*p2 + 7][*p1 + 11] == 0)dx[1][*p2 + 7][*p1 + 11] = id;if (dx[1][*p2 + 7][*p1 + 10] == 0)dx[1][*p2 + 7][*p1 + 10] = id;if (dx[1][*p2 + 7][*p1 + 9] == 0)dx[1][*p2 + 7][*p1 + 9] = id;if (dx[1][*p2 + 7][*p1 + 1] == 0)dx[1][*p2 + 7][*p1 + 1] = id;if (dx[1][*p2 + 7][*p1 - 1] == 0)dx[1][*p2 + 7][*p1 - 1] = id;
								if (dx[1][*p2 + 8][*p1 + 1] == 0)dx[1][*p2 + 8][*p1 + 1] = id;if (dx[1][*p2 + 8][*p1 - 1] == 0)dx[1][*p2 + 8][*p1 - 1] = id;if (dx[1][*p2 + 9][*p1 + 1] == 0)dx[1][*p2 + 9][*p1 + 1] = id;if (dx[1][*p2 + 9][*p1 - 1] == 0)dx[1][*p2 + 9][*p1 - 1] = id;
							}
						}



					}
					//怪物图像
					else
					{
						if (i[id] < 10001) {
							i[id]++;die[id]++;
						}
					}


					//if (i[id] < 20 && ni[id] == -1) { dieword = id;nice[id] = 0;ni[id] = -2; }//当怪物体力掉到一定程度求饶时



				}
				else//死亡触发
				{
					i[id] = 10000;
				}









			}
			else
			{
				if (nice[id] == 0)
				{
					if (nice[id] == 5)
					{


					}

					printf("#############################################################################################################################################\n");
					if (vill == 1)
					{
						if (id == 9000)
						{
							talkf(1, 5);
							if (meun == 1) { vill++;system("cls");talktime = 0;meun = '?'; mop[room]++; }
							if (meun == 3) { vill = 3;system("cls");talktime = 0;meun = '?'; }
							if (meun == 0) { vill--;vill = 0;system("cls");talktime = 0;exit; }
						}
						if (id == 9001)
						{
							talkf(6, 14);
							if (meun == 1) { vill++;system("cls");talktime = 0;meun = '?'; mop[room]++; }
							if (meun == 3) { vill = 3;system("cls");talktime = 0;meun = '?'; }
						}
					}
					if (vill == 2)
					{
						if (id == 9000)
						{
							talkf(15, 21);
							if (meun == 0) { vill--;system("cls");talktime = 0;exit; }//如果talk=0则将不显示与商人对话}
						}
						if (id == 9001)
						{
							talktime++;
							if (talktime > 0)printf("                                 Wdnmd走错了还能走到我家里来，                                                           \n");//
							if (talktime > 20)printf("                                 赶紧给我滚出去                                                           \n");//
							if (talktime > 40)printf("                                 要不然让你吃不完兜着走                                                           \n");//

							if (talktime > 60)printf("                                                     开溜~（按0退出）\n");
							if (talktime > 120)talktime = 120;
							if (meun == 0) { vill = 0;system("cls");talktime = 0;exit; }
						}
					}
					if (vill == 3) {
						if (id == 9000)
						{
							talkf(22, 42);
							if (talktime > 450)talktime = 450;
							if (meun == 0) {
								vill = 5;system("cls");talktime = 0; meun = '?';
							}
							if (meun == 1) {
								vill = 6;system("cls");talktime = 0;meun = '?';
							}

						}
						if (id == 9001)
						{
							talktime++;
							if (talktime < 200) {
								if (talktime > 0)printf("                                 蛤？给小怡的信？                                                                                                                                                                                       \n");//printf("\n");小子，就凭你还想戏弄我？
								if (talktime > 20)printf("                                 我老弟这么出息了吗                                                                                                                                                                                        \n");//printf("\n");找死
								if (talktime > 40)printf("                                 我不信                                                                                                                                                                                        \n");//printf("\n");
								if (talktime > 60)printf("                                 把信给我看看！                                                           \n");//printf("\n");emmmmmm
								if (talktime > 80)printf("                                 。。。。。                                                           \n");//printf("\n");你懂的··········
								if (talktime > 100)printf("                                 。。。。。                                                           \n");//printf("\n");emmmmmmm
								if (talktime > 120)printf("                                 。。。。。                                                          \n");//printf("\n");就是······
								if (talktime > 140)printf("                                 还真是我老弟的字!                                                           \n");//printf("\n");啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊
								if (talktime > 160)printf("                                 写的还挺肉麻                                                           \n");//printf("\n");欸欸欸欸你别走啊~！
								if (talktime > 180)printf("                                 什么叫“给这世界上最可爱的小怡”                                                           \n");//printf("\n");就是我。。我。。我一直喜。。。。。。。。。。
							}
							else
							{
								if (talktime == 200) { system("cls"); }
								if (talktime > 200)printf("                                 。。。。。。                                                           \n");//printf("\n");喜欢我们村的小怡！！！！！
								if (talktime > 230)printf("                                 蛤蛤蛤，笑死我了                                                           \n");//printf("\n");md羞死老子了！
								if (talktime > 250)printf("                                 你可千万别告诉他我看过信了                                                           \n");//printf("\n");不！许！tm！的！给！老！子！笑！
								if (talktime > 270)printf("                                 你问我小怡在哪？                                                           \n");//printf("\n");
								if (talktime > 290)printf("                                 那丫头就在我这房子后面的房子里                                                           \n");//printf("\n");事成之后奖励大大滴有！
								if (talktime > 310)printf("                                 我俩兄弟打小和ta就是邻居                                                           \n");//printf("\n");你问奖励有多少？500金币！
								if (talktime > 330)printf("                                 老熟了                                                           \n");//printf("\n");md我堂堂拆二代500金币还是出的起的！
								if (talktime > 350)printf("                                 总之就这样吧，一路顺风                                                           \n");//printf("\n");总之就是这样了，信给我拿好
							}

							if (talktime > 380) {
								talktime = 0;vill = 0;system("cls");talktime = 0;nice[9001] = 1;meun = '?';
							}

						}
					}
					if (vill == 6)
					{
						if (id == 9000) {
							talktime++;

							if (talktime > 0)printf("                                 这份艰巨的任务就交给你了啊，兄嘚！                                                           \n");//printf("\n");可千万别被人发现啊
							if (talktime > 20)printf("                                 可千万别被人发现啊                                                           \n");//printf("\n");

							if (talktime > 40)printf("                                 小怡她家就在离这不远处，顺着路走就到了，一路顺风~                                                           \n");
							if (talktime > 60) { vill = 0;system("cls");talktime = 0;talk = 0;nice[id] = 1;exit; }
						}
					}
					if (vill == 5)
					{
						if (id == 9000) {
							talktime++;

							if (talktime > 0)printf("                                 正你大爷！你知道了我的秘密，                                                           \n");//printf("\n");可千万别被人发现啊
							if (talktime > 20)printf("                                 不想去也得去！                                                           \n");//printf("\n");
							if (talktime > 40)printf("                                 要不然，嘿嘿，你就完蛋了~~                                                           \n");
							if (talktime > 60)printf("                                 哎哎哎大哥别打脸，你就行行好                                                           \n");
							if (talktime > 80)printf("                                 帮小弟一次吧:)                                                           \n");
							if (talktime > 100)printf("                                 我的人生幸福可全在你手上拉                                                           \n");
							if (talktime > 120)printf("                                 有钱赚他不香吗~                                                           \n");
							if (talktime > 140)printf("                                 小怡她家就在离这不远处，顺着路走就到了，一路顺风~                                                           \n");
							if (talktime > 160) { vill = 0;system("cls");talktime = 0;talk = 0;nice[id] = 1;exit; }
						}
					}


					printf("#############################################################################################################################################\n");
				}
				if (nice[id] == 1)
				{
					printf("#############################################################################################################################################\n");
					if (vill == 1)
					{
						if (id == 9000)
						{
							talktime++;

							if (talktime > 0)printf("                                 还没打算走吗？走吧走吧，走完了就被发现了                                                           \n");//不知道外面究竟怎么样了

							if (talktime > 20)printf("                                 我也不知道怎么就来到了这个世界了，你能告诉我这是哪里吗？（按1）                                                           \n");//我可是国王的亲信，你必须得帮助我


							if (meun == 1) { vill++;system("cls");talktime = 0;meun = '?'; mop[room]++; }
							if (talktime > 120)talktime = 120;
							printf("                                                     溜了溜了~~~（按0退出）\n");
							if (meun == 0) { vill--;vill = 0;system("cls");talktime = 0;exit; }
						}
					}
					if (vill == 2)
					{
						if (id == 9000)
						{
							talktime++;
							if (talktime > 0)printf("                                 蛤！这里就是整个大陆最大的明珠！安格斯——浦东！                                                           \n");//
							if (talktime > 20)printf("                                 不过看你的样子也不像这片大陆上的人                                                           \n");//
							if (talktime > 40)printf("                                 马上这栋房子就要被国王的骑士拆迁了                                                           \n");//
							if (talktime > 60)printf("                                 这里据说是国王最喜欢的土地，果然还说要修建——呢啥·····                                                           \n");//
							if (talktime > 80)printf("                                 偶！对了，叫井屏！咱不是文化人，也不知道那是哈                                                           \n");//
							if (talktime > 100)printf("                                 但是我这次一定能得到国王的赏赐成为男爵吧！                                                           \n");//
							if (talktime > 120)printf("                                                     好的了解~（按0退出）\n");
							if (talktime > 120)talktime = 120;
							if (meun == 0) { vill--;system("cls");talktime = 0;exit; }//如果talk=0则将不显示与商人对话}
						}
					}
					printf("#############################################################################################################################################\n");
				}

			}

		}
	


	/*if (dx[0][y2 - 2][x2-0] == 0)dx[0][y2 - 2][x2 - 0] = id;if (dx[0][y2 - 1][x2 + 2] == 0)dx[0][y2 - 1][x2 + 2] = id;if (dx[0][y2 - 1][x2-0] == 0)dx[0][y2 - 1][x2 - 0] = id;if (dx[0][y2 - 1][x2-2] == 0)dx[0][y2 - 1][x2 - 2] = id;if (dx[0][y2 + 0][x2 + 2] == 0)dx[0][y2 + 0][x2 + 2] = id;if (dx[0][y2 + 0][x2 + 1] == 0)dx[0][y2 + 0][x2 + 1] = id;if (dx[0][y2 + 0][x2-0] == 0)dx[0][y2 + 0][x2 - 0] = id;if (dx[0][y2 + 0][x2-1] == 0)dx[0][y2 + 0][x2 - 1] = id;if (dx[0][y2 + 0][x2-2] == 0)dx[0][y2 + 0][x2 - 2] = id;
	if (dx[0][y2 + 1][x2 + 1] == 0)dx[0][y2 + 1][x2 + 1] = id;if (dx[0][y2 + 1][x2-0] == 0)dx[0][y2 + 1][x2 - 0] = id;if (dx[0][y2 + 1][x2-1] == 0)dx[0][y2 + 1][x2 - 1] = id;if (dx[0][y2 + 2][x2-0] == 0)dx[0][y2 + 2][x2 - 0] = id;if (dx[0][y2 + 3][x2 + 6] == 0)dx[0][y2 + 3][x2 + 6] = id;if (dx[0][y2 + 3][x2 + 5] == 0)dx[0][y2 + 3][x2 + 5] = id;if (dx[0][y2 + 3][x2 + 4] == 0)dx[0][y2 + 3][x2 + 4] = id;if (dx[0][y2 + 3][x2 + 3] == 0)dx[0][y2 + 3][x2 + 3] = id;if (dx[0][y2 + 3][x2 + 2] == 0)dx[0][y2 + 3][x2 + 2] = id;
	if (dx[0][y2 + 3][x2 + 1] == 0)dx[0][y2 + 3][x2 + 1] = id;if (dx[0][y2 + 3][x2-0] == 0)dx[0][y2 + 3][x2 - 0] = id;if (dx[0][y2 + 3][x2-1] == 0)dx[0][y2 + 3][x2 - 1] = id;if (dx[0][y2 + 3][x2-2] == 0)dx[0][y2 + 3][x2 - 2] = id;if (dx[0][y2 + 4][x2 + 9] == 0)dx[0][y2 + 4][x2 + 9] = id;if (dx[0][y2 + 4][x2 + 8] == 0)dx[0][y2 + 4][x2 + 8] = id;if (dx[0][y2 + 4][x2 + 7] == 0)dx[0][y2 + 4][x2 + 7] = id;if (dx[0][y2 + 4][x2 + 4] == 0)dx[0][y2 + 4][x2 + 4] = id;if (dx[0][y2 + 4][x2 + 3] == 0)dx[0][y2 + 4][x2 + 3] = id;
	if (dx[0][y2 + 4][x2 + 2] == 0)dx[0][y2 + 4][x2 + 2] = id;if (dx[0][y2 + 4][x2-0] == 0)dx[0][y2 + 4][x2 - 0] = id;if (dx[0][y2 + 4][x2-2] == 0)dx[0][y2 + 4][x2 - 2] = id;if (dx[0][y2 + 5][x2 + 12] == 0)dx[0][y2 + 5][x2 + 12] = id;if (dx[0][y2 + 5][x2 + 11] == 0)dx[0][y2 + 5][x2 + 11] = id;if (dx[0][y2 + 5][x2 + 10] == 0)dx[0][y2 + 5][x2 + 10] = id;if (dx[0][y2 + 5][x2 + 5] == 0)dx[0][y2 + 5][x2 + 5] = id;if (dx[0][y2 + 5][x2 + 4] == 0)dx[0][y2 + 5][x2 + 4] = id;if (dx[0][y2 + 5][x2 + 2] == 0)dx[0][y2 + 5][x2 + 2] = id;
	if (dx[0][y2 + 5][x2-0] == 0)dx[0][y2 + 5][x2 - 0] = id;if (dx[0][y2 + 5][x2-2] == 0)dx[0][y2 + 5][x2 - 2] = id;if (dx[0][y2 + 6][x2 + 15] == 0)dx[0][y2 + 6][x2 + 15] = id;if (dx[0][y2 + 6][x2 + 14] == 0)dx[0][y2 + 6][x2 + 14] = id;if (dx[0][y2 + 6][x2 + 13] == 0)dx[0][y2 + 6][x2 + 13] = id;if (dx[0][y2 + 6][x2 + 8] == 0)dx[0][y2 + 6][x2 + 8] = id;if (dx[0][y2 + 6][x2 + 7] == 0)dx[0][y2 + 6][x2 + 7] = id;if (dx[0][y2 + 6][x2 + 6] == 0)dx[0][y2 + 6][x2 + 6] = id;if (dx[0][y2 + 6][x2 + 1] == 0)dx[0][y2 + 6][x2 + 1] = id;
	if (dx[0][y2 + 6][x2-0] == 0)dx[0][y2 + 6][x2 - 0] = id;if (dx[0][y2 + 6][x2-1] == 0)dx[0][y2 + 6][x2 - 1] = id;if (dx[0][y2 + 7][x2 + 13] == 0)dx[0][y2 + 7][x2 + 13] = id;if (dx[0][y2 + 7][x2 + 12] == 0)dx[0][y2 + 7][x2 + 12] = id;if (dx[0][y2 + 7][x2 + 11] == 0)dx[0][y2 + 7][x2 + 11] = id;if (dx[0][y2 + 7][x2 + 10] == 0)dx[0][y2 + 7][x2 + 10] = id;if (dx[0][y2 + 7][x2 + 9] == 0)dx[0][y2 + 7][x2 + 9] = id;if (dx[0][y2 + 7][x2 + 1] == 0)dx[0][y2 + 7][x2 + 1] = id;if (dx[0][y2 + 7][x2-1] == 0)dx[0][y2 + 7][x2 - 1] = id;
	if (dx[0][y2 + 8][x2 + 1] == 0)dx[0][y2 + 8][x2 + 1] = id;if (dx[0][y2 + 8][x2-1] == 0)dx[0][y2 + 8][x2 - 1] = id;if (dx[0][y2 + 9][x2 + 1] == 0)dx[0][y2 + 9][x2 + 1] = id;if (dx[0][y2 + 9][x2-1] == 0)dx[0][y2 + 9][x2 - 1] = id;
*/

	/*if (dx[0][y2 - 2][x2 + 0] == 0)dx[0][y2 - 2][x2 + 0] = id;if (dx[0][y2 - 1][x2 - 2] == 0)dx[0][y2 - 1][x2 - 2] = id;if (dx[0][y2 - 1][x2 + 0] == 0)dx[0][y2 - 1][x2 + 0] = id;if (dx[0][y2 - 1][x2 + 2] == 0)dx[0][y2 - 1][x2 + 2] = id;if (dx[0][y2 + 0][x2 - 2] == 0)dx[0][y2 + 0][x2 - 2] = id;if (dx[0][y2 + 0][x2 - 1] == 0)dx[0][y2 + 0][x2 - 1] = id;if (dx[0][y2 + 0][x2 + 0] == 0)dx[0][y2 + 0][x2 + 0] = id;if (dx[0][y2 + 0][x2 + 1] == 0)dx[0][y2 + 0][x2 + 1] = id;if (dx[0][y2 + 0][x2 + 2] == 0)dx[0][y2 + 0][x2 + 2] = id;
	if (dx[0][y2 + 1][x2 - 1] == 0)dx[0][y2 + 1][x2 - 1] = id;if (dx[0][y2 + 1][x2 + 0] == 0)dx[0][y2 + 1][x2 + 0] = id;if (dx[0][y2 + 1][x2 + 1] == 0)dx[0][y2 + 1][x2 + 1] = id;if (dx[0][y2 + 2][x2 + 0] == 0)dx[0][y2 + 2][x2 + 0] = id;if (dx[0][y2 + 3][x2 - 6] == 0)dx[0][y2 + 3][x2 - 6] = id;if (dx[0][y2 + 3][x2 - 5] == 0)dx[0][y2 + 3][x2 - 5] = id;if (dx[0][y2 + 3][x2 - 4] == 0)dx[0][y2 + 3][x2 - 4] = id;if (dx[0][y2 + 3][x2 - 3] == 0)dx[0][y2 + 3][x2 - 3] = id;if (dx[0][y2 + 3][x2 - 2] == 0)dx[0][y2 + 3][x2 - 2] = id;
	if (dx[0][y2 + 3][x2 - 1] == 0)dx[0][y2 + 3][x2 - 1] = id;if (dx[0][y2 + 3][x2 + 0] == 0)dx[0][y2 + 3][x2 + 0] = id;if (dx[0][y2 + 3][x2 + 1] == 0)dx[0][y2 + 3][x2 + 1] = id;if (dx[0][y2 + 3][x2 + 2] == 0)dx[0][y2 + 3][x2 + 2] = id;if (dx[0][y2 + 4][x2 - 9] == 0)dx[0][y2 + 4][x2 - 9] = id;if (dx[0][y2 + 4][x2 - 8] == 0)dx[0][y2 + 4][x2 - 8] = id;if (dx[0][y2 + 4][x2 - 7] == 0)dx[0][y2 + 4][x2 - 7] = id;if (dx[0][y2 + 4][x2 - 4] == 0)dx[0][y2 + 4][x2 - 4] = id;if (dx[0][y2 + 4][x2 - 3] == 0)dx[0][y2 + 4][x2 - 3] = id;
	if (dx[0][y2 + 4][x2 - 2] == 0)dx[0][y2 + 4][x2 - 2] = id;if (dx[0][y2 + 4][x2 + 0] == 0)dx[0][y2 + 4][x2 + 0] = id;if (dx[0][y2 + 4][x2 + 2] == 0)dx[0][y2 + 4][x2 + 2] = id;if (dx[0][y2 + 5][x2 - 12] == 0)dx[0][y2 + 5][x2 - 12] = id;if (dx[0][y2 + 5][x2 - 11] == 0)dx[0][y2 + 5][x2 - 11] = id;if (dx[0][y2 + 5][x2 - 10] == 0)dx[0][y2 + 5][x2 - 10] = id;if (dx[0][y2 + 5][x2 - 5] == 0)dx[0][y2 + 5][x2 - 5] = id;if (dx[0][y2 + 5][x2 - 4] == 0)dx[0][y2 + 5][x2 - 4] = id;if (dx[0][y2 + 5][x2 - 2] == 0)dx[0][y2 + 5][x2 - 2] = id;
	if (dx[0][y2 + 5][x2 + 0] == 0)dx[0][y2 + 5][x2 + 0] = id;if (dx[0][y2 + 5][x2 + 2] == 0)dx[0][y2 + 5][x2 + 2] = id;if (dx[0][y2 + 6][x2 - 15] == 0)dx[0][y2 + 6][x2 - 15] = id;if (dx[0][y2 + 6][x2 - 14] == 0)dx[0][y2 + 6][x2 - 14] = id;if (dx[0][y2 + 6][x2 - 13] == 0)dx[0][y2 + 6][x2 - 13] = id;if (dx[0][y2 + 6][x2 - 8] == 0)dx[0][y2 + 6][x2 - 8] = id;if (dx[0][y2 + 6][x2 - 7] == 0)dx[0][y2 + 6][x2 - 7] = id;if (dx[0][y2 + 6][x2 - 6] == 0)dx[0][y2 + 6][x2 - 6] = id;if (dx[0][y2 + 6][x2 - 1] == 0)dx[0][y2 + 6][x2 - 1] = id;
	if (dx[0][y2 + 6][x2 + 0] == 0)dx[0][y2 + 6][x2 + 0] = id;if (dx[0][y2 + 6][x2 + 1] == 0)dx[0][y2 + 6][x2 + 1] = id;if (dx[0][y2 + 7][x2 - 13] == 0)dx[0][y2 + 7][x2 - 13] = id;if (dx[0][y2 + 7][x2 - 12] == 0)dx[0][y2 + 7][x2 - 12] = id;if (dx[0][y2 + 7][x2 - 11] == 0)dx[0][y2 + 7][x2 - 11] = id;if (dx[0][y2 + 7][x2 - 10] == 0)dx[0][y2 + 7][x2 - 10] = id;if (dx[0][y2 + 7][x2 - 9] == 0)dx[0][y2 + 7][x2 - 9] = id;if (dx[0][y2 + 7][x2 - 1] == 0)dx[0][y2 + 7][x2 - 1] = id;if (dx[0][y2 + 7][x2 + 1] == 0)dx[0][y2 + 7][x2 + 1] = id;
	if (dx[0][y2 + 8][x2 - 1] == 0)dx[0][y2 + 8][x2 - 1] = id;if (dx[0][y2 + 8][x2 + 1] == 0)dx[0][y2 + 8][x2 + 1] = id;if (dx[0][y2 + 9][x2 - 1] == 0)dx[0][y2 + 9][x2 - 1] = id;if (dx[0][y2 + 9][x2 + 1] == 0)dx[0][y2 + 9][x2 + 1] = id;
*/

	/*if (dx[0][y2 - 2][x2 + 0] == 0)dx[0][y2 - 2][x2 + 0] = id;if (dx[0][y2 - 1][x2 - 2] == 0)dx[0][y2 - 1][x2 - 2] = id;if (dx[0][y2 - 1][x2 + 0] == 0)dx[0][y2 - 1][x2 + 0] = id;if (dx[0][y2 - 1][x2 + 2] == 0)dx[0][y2 - 1][x2 + 2] = id;if (dx[0][y2 + 0][x2 - 2] == 0)dx[0][y2 + 0][x2 - 2] = id;if (dx[0][y2 + 0][x2 - 1] == 0)dx[0][y2 + 0][x2 - 1] = id;if (dx[0][y2 + 0][x2 + 0] == 0)dx[0][y2 + 0][x2 + 0] = id;if (dx[0][y2 + 0][x2 + 1] == 0)dx[0][y2 + 0][x2 + 1] = id;if (dx[0][y2 + 0][x2 + 2] == 0)dx[0][y2 + 0][x2 + 2] = id;
	if (dx[0][y2 + 1][x2 - 1] == 0)dx[0][y2 + 1][x2 - 1] = id;if (dx[0][y2 + 1][x2 + 0] == 0)dx[0][y2 + 1][x2 + 0] = id;if (dx[0][y2 + 1][x2 + 1] == 0)dx[0][y2 + 1][x2 + 1] = id;if (dx[0][y2 + 2][x2 + 0] == 0)dx[0][y2 + 2][x2 + 0] = id;if (dx[0][y2 + 3][x2 - 4] == 0)dx[0][y2 + 3][x2 - 4] = id;if (dx[0][y2 + 3][x2 - 3] == 0)dx[0][y2 + 3][x2 - 3] = id;if (dx[0][y2 + 3][x2 - 2] == 0)dx[0][y2 + 3][x2 - 2] = id;if (dx[0][y2 + 3][x2 - 1] == 0)dx[0][y2 + 3][x2 - 1] = id;if (dx[0][y2 + 3][x2 + 0] == 0)dx[0][y2 + 3][x2 + 0] = id;
	if (dx[0][y2 + 3][x2 + 1] == 0)dx[0][y2 + 3][x2 + 1] = id;if (dx[0][y2 + 3][x2 + 2] == 0)dx[0][y2 + 3][x2 + 2] = id;if (dx[0][y2 + 3][x2 + 3] == 0)dx[0][y2 + 3][x2 + 3] = id;if (dx[0][y2 + 4][x2 - 5] == 0)dx[0][y2 + 4][x2 - 5] = id;if (dx[0][y2 + 4][x2 - 4] == 0)dx[0][y2 + 4][x2 - 4] = id;if (dx[0][y2 + 4][x2 - 3] == 0)dx[0][y2 + 4][x2 - 3] = id;if (dx[0][y2 + 4][x2 - 2] == 0)dx[0][y2 + 4][x2 - 2] = id;if (dx[0][y2 + 4][x2 + 0] == 0)dx[0][y2 + 4][x2 + 0] = id;if (dx[0][y2 + 4][x2 + 2] == 0)dx[0][y2 + 4][x2 + 2] = id;
	if (dx[0][y2 + 4][x2 + 3] == 0)dx[0][y2 + 4][x2 + 3] = id;if (dx[0][y2 + 4][x2 + 4] == 0)dx[0][y2 + 4][x2 + 4] = id;if (dx[0][y2 + 5][x2 - 6] == 0)dx[0][y2 + 5][x2 - 6] = id;if (dx[0][y2 + 5][x2 - 5] == 0)dx[0][y2 + 5][x2 - 5] = id;if (dx[0][y2 + 5][x2 - 2] == 0)dx[0][y2 + 5][x2 - 2] = id;if (dx[0][y2 + 5][x2 + 0] == 0)dx[0][y2 + 5][x2 + 0] = id;if (dx[0][y2 + 5][x2 + 2] == 0)dx[0][y2 + 5][x2 + 2] = id;if (dx[0][y2 + 5][x2 + 4] == 0)dx[0][y2 + 5][x2 + 4] = id;if (dx[0][y2 + 6][x2 - 7] == 0)dx[0][y2 + 6][x2 - 7] = id;
	if (dx[0][y2 + 6][x2 - 6] == 0)dx[0][y2 + 6][x2 - 6] = id;if (dx[0][y2 + 6][x2 - 2] == 0)dx[0][y2 + 6][x2 - 2] = id;if (dx[0][y2 + 6][x2 - 1] == 0)dx[0][y2 + 6][x2 - 1] = id;if (dx[0][y2 + 6][x2 + 0] == 0)dx[0][y2 + 6][x2 + 0] = id;if (dx[0][y2 + 6][x2 + 1] == 0)dx[0][y2 + 6][x2 + 1] = id;if (dx[0][y2 + 6][x2 + 4] == 0)dx[0][y2 + 6][x2 + 4] = id;if (dx[0][y2 + 7][x2 - 8] == 0)dx[0][y2 + 7][x2 - 8] = id;if (dx[0][y2 + 7][x2 - 7] == 0)dx[0][y2 + 7][x2 - 7] = id;if (dx[0][y2 + 7][x2 - 1] == 0)dx[0][y2 + 7][x2 - 1] = id;
	if (dx[0][y2 + 7][x2 + 1] == 0)dx[0][y2 + 7][x2 + 1] = id;if (dx[0][y2 + 7][x2 + 4] == 0)dx[0][y2 + 7][x2 + 4] = id;if (dx[0][y2 + 8][x2 - 8] == 0)dx[0][y2 + 8][x2 - 8] = id;if (dx[0][y2 + 8][x2 - 7] == 0)dx[0][y2 + 8][x2 - 7] = id;if (dx[0][y2 + 8][x2 - 6] == 0)dx[0][y2 + 8][x2 - 6] = id;if (dx[0][y2 + 8][x2 - 3] == 0)dx[0][y2 + 8][x2 - 3] = id;if (dx[0][y2 + 8][x2 - 1] == 0)dx[0][y2 + 8][x2 - 1] = id;if (dx[0][y2 + 8][x2 + 1] == 0)dx[0][y2 + 8][x2 + 1] = id;if (dx[0][y2 + 8][x2 + 4] == 0)dx[0][y2 + 8][x2 + 4] = id;
	if (dx[0][y2 + 9][x2 - 8] == 0)dx[0][y2 + 9][x2 - 8] = id;if (dx[0][y2 + 9][x2 - 7] == 0)dx[0][y2 + 9][x2 - 7] = id;if (dx[0][y2 + 9][x2 - 6] == 0)dx[0][y2 + 9][x2 - 6] = id;if (dx[0][y2 + 9][x2 - 5] == 0)dx[0][y2 + 9][x2 - 5] = id;if (dx[0][y2 + 9][x2 - 4] == 0)dx[0][y2 + 9][x2 - 4] = id;if (dx[0][y2 + 9][x2 - 3] == 0)dx[0][y2 + 9][x2 - 3] = id;if (dx[0][y2 + 9][x2 - 1] == 0)dx[0][y2 + 9][x2 - 1] = id;if (dx[0][y2 + 9][x2 + 1] == 0)dx[0][y2 + 9][x2 + 1] = id;if (dx[0][y2 + 9][x2 + 2] == 0)dx[0][y2 + 9][x2 + 2] = id;
	if (dx[0][y2 + 9][x2 + 3] == 0)dx[0][y2 + 9][x2 + 3] = id;if (dx[0][y2 + 9][x2 + 4] == 0)dx[0][y2 + 9][x2 + 4] = id;*/

	/*if (dx[0][y2 - 2][x2 - 0] == 0)dx[0][y2 - 2][x2 - 0] = id;if (dx[0][y2 - 1][x2 + 2] == 0)dx[0][y2 - 1][x2 + 2] = id;if (dx[0][y2 - 1][x2 - 0] == 0)dx[0][y2 - 1][x2 - 0] = id;if (dx[0][y2 - 1][x2 - 2] == 0)dx[0][y2 - 1][x2 - 2] = id;if (dx[0][y2 + 0][x2 + 2] == 0)dx[0][y2 + 0][x2 + 2] = id;if (dx[0][y2 + 0][x2 + 1] == 0)dx[0][y2 + 0][x2 + 1] = id;if (dx[0][y2 + 0][x2 - 0] == 0)dx[0][y2 + 0][x2 - 0] = id;if (dx[0][y2 + 0][x2 - 1] == 0)dx[0][y2 + 0][x2 - 1] = id;if (dx[0][y2 + 0][x2 - 2] == 0)dx[0][y2 + 0][x2 - 2] = id;
	if (dx[0][y2 + 1][x2 + 1] == 0)dx[0][y2 + 1][x2 + 1] = id;if (dx[0][y2 + 1][x2 - 0] == 0)dx[0][y2 + 1][x2 - 0] = id;if (dx[0][y2 + 1][x2 - 1] == 0)dx[0][y2 + 1][x2 - 1] = id;if (dx[0][y2 + 2][x2 - 0] == 0)dx[0][y2 + 2][x2 - 0] = id;if (dx[0][y2 + 3][x2 + 4] == 0)dx[0][y2 + 3][x2 + 4] = id;if (dx[0][y2 + 3][x2 + 3] == 0)dx[0][y2 + 3][x2 + 3] = id;if (dx[0][y2 + 3][x2 + 2] == 0)dx[0][y2 + 3][x2 + 2] = id;if (dx[0][y2 + 3][x2 + 1] == 0)dx[0][y2 + 3][x2 + 1] = id;if (dx[0][y2 + 3][x2 - 0] == 0)dx[0][y2 + 3][x2 - 0] = id;
	if (dx[0][y2 + 3][x2 - 1] == 0)dx[0][y2 + 3][x2 - 1] = id;if (dx[0][y2 + 3][x2 - 2] == 0)dx[0][y2 + 3][x2 - 2] = id;if (dx[0][y2 + 3][x2 - 3] == 0)dx[0][y2 + 3][x2 - 3] = id;if (dx[0][y2 + 4][x2 + 5] == 0)dx[0][y2 + 4][x2 + 5] = id;if (dx[0][y2 + 4][x2 + 4] == 0)dx[0][y2 + 4][x2 + 4] = id;if (dx[0][y2 + 4][x2 + 3] == 0)dx[0][y2 + 4][x2 + 3] = id;if (dx[0][y2 + 4][x2 + 2] == 0)dx[0][y2 + 4][x2 + 2] = id;if (dx[0][y2 + 4][x2 - 0] == 0)dx[0][y2 + 4][x2 - 0] = id;if (dx[0][y2 + 4][x2 - 2] == 0)dx[0][y2 + 4][x2 - 2] = id;
	if (dx[0][y2 + 4][x2 - 3] == 0)dx[0][y2 + 4][x2 - 3] = id;if (dx[0][y2 + 4][x2 - 4] == 0)dx[0][y2 + 4][x2 - 4] = id;if (dx[0][y2 + 5][x2 + 6] == 0)dx[0][y2 + 5][x2 + 6] = id;if (dx[0][y2 + 5][x2 + 5] == 0)dx[0][y2 + 5][x2 + 5] = id;if (dx[0][y2 + 5][x2 + 2] == 0)dx[0][y2 + 5][x2 + 2] = id;if (dx[0][y2 + 5][x2 - 0] == 0)dx[0][y2 + 5][x2 - 0] = id;if (dx[0][y2 + 5][x2 - 2] == 0)dx[0][y2 + 5][x2 - 2] = id;if (dx[0][y2 + 5][x2 - 4] == 0)dx[0][y2 + 5][x2 - 4] = id;if (dx[0][y2 + 6][x2 + 7] == 0)dx[0][y2 + 6][x2 + 7] = id;
	if (dx[0][y2 + 6][x2 + 6] == 0)dx[0][y2 + 6][x2 + 6] = id;if (dx[0][y2 + 6][x2 + 2] == 0)dx[0][y2 + 6][x2 + 2] = id;if (dx[0][y2 + 6][x2 + 1] == 0)dx[0][y2 + 6][x2 + 1] = id;if (dx[0][y2 + 6][x2 - 0] == 0)dx[0][y2 + 6][x2 - 0] = id;if (dx[0][y2 + 6][x2 - 1] == 0)dx[0][y2 + 6][x2 - 1] = id;if (dx[0][y2 + 6][x2 - 4] == 0)dx[0][y2 + 6][x2 - 4] = id;if (dx[0][y2 + 7][x2 + 8] == 0)dx[0][y2 + 7][x2 + 8] = id;if (dx[0][y2 + 7][x2 + 7] == 0)dx[0][y2 + 7][x2 + 7] = id;if (dx[0][y2 + 7][x2 + 1] == 0)dx[0][y2 + 7][x2 + 1] = id;
	if (dx[0][y2 + 7][x2 - 1] == 0)dx[0][y2 + 7][x2 - 1] = id;if (dx[0][y2 + 7][x2 - 4] == 0)dx[0][y2 + 7][x2 - 4] = id;if (dx[0][y2 + 8][x2 + 8] == 0)dx[0][y2 + 8][x2 + 8] = id;if (dx[0][y2 + 8][x2 + 7] == 0)dx[0][y2 + 8][x2 + 7] = id;if (dx[0][y2 + 8][x2 + 6] == 0)dx[0][y2 + 8][x2 + 6] = id;if (dx[0][y2 + 8][x2 + 3] == 0)dx[0][y2 + 8][x2 + 3] = id;if (dx[0][y2 + 8][x2 + 1] == 0)dx[0][y2 + 8][x2 + 1] = id;if (dx[0][y2 + 8][x2 - 1] == 0)dx[0][y2 + 8][x2 - 1] = id;if (dx[0][y2 + 8][x2 - 4] == 0)dx[0][y2 + 8][x2 - 4] = id;
	if (dx[0][y2 + 9][x2 + 8] == 0)dx[0][y2 + 9][x2 + 8] = id;if (dx[0][y2 + 9][x2 + 7] == 0)dx[0][y2 + 9][x2 + 7] = id;if (dx[0][y2 + 9][x2 + 6] == 0)dx[0][y2 + 9][x2 + 6] = id;if (dx[0][y2 + 9][x2 + 5] == 0)dx[0][y2 + 9][x2 + 5] = id;if (dx[0][y2 + 9][x2 + 4] == 0)dx[0][y2 + 9][x2 + 4] = id;if (dx[0][y2 + 9][x2 + 3] == 0)dx[0][y2 + 9][x2 + 3] = id;if (dx[0][y2 + 9][x2 + 1] == 0)dx[0][y2 + 9][x2 + 1] = id;if (dx[0][y2 + 9][x2 - 1] == 0)dx[0][y2 + 9][x2 - 1] = id;if (dx[0][y2 + 9][x2 - 2] == 0)dx[0][y2 + 9][x2 - 2] = id;
	if (dx[0][y2 + 9][x2 - 3] == 0)dx[0][y2 + 9][x2 - 3] = id;if (dx[0][y2 + 9][x2 - 4] == 0)dx[0][y2 + 9][x2 - 4] = id;
*/
}

void dieman(int x2,int y2) {
	int id = 15;
	x2 = x2 + 30 + 30;y2 = 600 - y2;
	dx[0][y2 - 2][x2 - 9] = id;dx[0][y2 - 2][x2 - 8] = id;dx[0][y2 - 2][x2 - 7] = id;dx[0][y2 - 2][x2 - 6] = id;dx[0][y2 - 2][x2 - 5] = id;dx[0][y2 - 2][x2 - 4] = id;
	dx[0][y2 - 2][x2 - 3] = id;dx[0][y2 - 2][x2 - 2] = id;dx[0][y2 - 1][x2 - 17] = id;dx[0][y2 - 1][x2 - 16] = id;dx[0][y2 - 1][x2 - 15] = id;dx[0][y2 - 1][x2 - 14] = id;
	dx[0][y2 - 1][x2 - 13] = id;dx[0][y2 - 1][x2 - 12] = id;dx[0][y2 - 1][x2 - 11] = id;dx[0][y2 - 1][x2 - 10] = id;dx[0][y2 - 1][x2 - 9] = id;dx[0][y2 - 1][x2 - 8] = id;
	dx[0][y2 - 1][x2 - 7] = id;dx[0][y2 - 1][x2 - 6] = id;dx[0][y2 - 1][x2 - 5] = id;dx[0][y2 - 1][x2 - 4] = id;dx[0][y2 - 1][x2 - 3] = id;dx[0][y2 - 1][x2 - 2] = id;
	dx[0][y2 - 1][x2 + 1] = id;dx[0][y2 - 1][x2 + 2] = id;dx[0][y2 - 1][x2 + 3] = id;dx[0][y2 - 1][x2 + 4] = id;dx[0][y2 - 1][x2 + 5] = id;dx[0][y2 + 0][x2 - 11] = id;
	dx[0][y2 + 0][x2 - 10] = id;dx[0][y2 + 0][x2 - 9] = id;dx[0][y2 + 0][x2 - 8] = id;dx[0][y2 + 0][x2 - 7] = id;dx[0][y2 + 0][x2 - 6] = id;dx[0][y2 + 0][x2 - 5] = id;
	dx[0][y2 + 0][x2 - 4] = id;dx[0][y2 + 0][x2 - 3] = id;dx[0][y2 + 0][x2 - 2] = id;dx[0][y2 + 0][x2 - 1] = id;dx[0][y2 + 0][x2 + 0] = id;dx[0][y2 + 0][x2 + 1] = id;
	dx[0][y2 + 0][x2 + 2] = id;dx[0][y2 + 0][x2 + 3] = id;dx[0][y2 + 0][x2 + 4] = id;dx[0][y2 + 0][x2 + 5] = id;dx[0][y2 + 1][x2 - 17] = id;dx[0][y2 + 1][x2 - 16] = id;
	dx[0][y2 + 1][x2 - 15] = id;dx[0][y2 + 1][x2 - 14] = id;dx[0][y2 + 1][x2 - 13] = id;dx[0][y2 + 1][x2 - 12] = id;dx[0][y2 + 1][x2 - 11] = id;dx[0][y2 + 1][x2 - 10] = id;
	dx[0][y2 + 1][x2 - 9] = id;dx[0][y2 + 1][x2 - 8] = id;dx[0][y2 + 1][x2 - 7] = id;dx[0][y2 + 1][x2 - 6] = id;dx[0][y2 + 1][x2 - 5] = id;dx[0][y2 + 1][x2 - 4] = id;
	dx[0][y2 + 1][x2 - 3] = id;dx[0][y2 + 1][x2 - 2] = id;dx[0][y2 + 1][x2 + 1] = id;dx[0][y2 + 1][x2 + 2] = id;dx[0][y2 + 1][x2 + 3] = id;dx[0][y2 + 1][x2 + 4] = id;
	dx[0][y2 + 1][x2 + 5] = id;dx[0][y2 + 2][x2 - 8] = id;dx[0][y2 + 2][x2 - 7] = id;dx[0][y2 + 2][x2 - 6] = id;dx[0][y2 + 2][x2 - 5] = id;dx[0][y2 + 2][x2 - 4] = id;
	dx[0][y2 + 2][x2 - 3] = id;dx[0][y2 + 2][x2 - 2] = id;

}

void mpc(int x2, int y2, int h1, int id, int r, int e,int cas)
{/*
  ---------------------------------------------------------------------------------------------------------------------------------------------
						   函数分为逻辑区与对话区
   常用参数 a,b，Ay
   x2					初始化横坐标													y2					初始化纵坐标
   h1					初始化生命														id					怪物逻辑编号
   r					怪物寻敌半径													e					是否为逻辑/对话
   die[id]				怪物死亡不在运行标志											i[id]				怪物的实际生命值+1
   x1					怪物横坐标														y1					怪物纵坐标
   xm[id]				怪物实际横坐标											    	ym[id]				怪物实际纵坐标
   Vy2					怪物当前速度（整型）											max					最大速度
   yfork				武器横坐标														xfork				武器纵坐标
   nice[id]				怪物善恶值													    ato[id]				怪物当前状态为巡逻/发现敌人
   fag[0]				是前往目标的标志												fag[1]				是第一个目标坐标
   fag[2]				是第二个目标坐标												fag[3]				是怪物是否落地
   aY[id]				怪物纵向加速度													axmonst[id]			怪物横向加速度
   actmonst[id]			怪物当前动作模型                                                dx[0][][]=id            怪物在游戏中逻辑层的模型
   vY[id]               怪物当前纵向速度(浮点数)										Vy2[id]				怪物当前纵向速度（整型）
   hurteen[id]          怪物受伤标志                                                    diewordx[0][id]         当怪物战斗中途触发的对话
   axmonst[id]          怪物横向加速度                                                  conmonst[id]        怪物左右朝向
   V1monst[id]          怪物横向速度（浮点数）                                          V2monst[id]         怪物横向速度整型数
   meun                 怪物对话深度（层次）                                            acttime[id]         当前动作持续的帧数（时间）
  ----------------------------------------------------------------------------------------------------------------------------------------------
  */

	if (die[id] < 1)
	{
		int x1 = 0, y1 = 0, a = 0, b = 0, Vy2 = 0, c = 0, max = 3, atk = 3, yfork = 0, xfork = 0;
		if (e == 0)
		{
			if (i[id] == 0)//怪物数据函数初始化 
			{
				x2 = x2 + 30 + 30;
				xm[id] = x2;
				ym[id] = y2;
				i[id] = h1 + 1;
				ym[id] = 600 - ym[id];
				fag[id][1] = xm[id] + r;
				fag[id][2] = xm[id] - r;
				ato[id] = 1;
				aY[id] = 0;
				ni[id] = -1;
			}

			//寻敌

			if (nice[id] < 0)
			{
				if ((x >= xm[id] && x - xm[id] < 600) || (x < xm[id] && xm[id] - x < 600)) { ato[id] = 0;hdso = 0;talk = 0; }
				else { ato[id] = 1; }
			}
			else { ato[id] = 1; }





			if (ato[id] == 1)//巡航，巡逻,待命
			{
				axmonst[id] = 0;V2monst[id] = 0;V1monst[id] = 0;actmonst[id] = 0;

			}
			else
			{
				if (actmonst[id] != 3)if (x >= xm[id]) { conmonst[id] = 1; }
				else { conmonst[id] = -1; }//自身朝向位置
				if (x > xm[id])//对敌人位置的判断
				{
					if (x > xm[id] + 33)
					{
						if (actmonst[id] == 1 || actmonst[id] == 0) { if (axmonst[id] < 0)axmonst[id] = 0;axmonst[id]++; }
					}
					else
					{
						if (x > xm[id] + 17)
						{
							if (actmonst[id] < 2)actmonst[id] = 1;
							axmonst[id] = 0;
							V2monst[id] = 0;
						}
						else { axmonst[id]--; }
					}
				}
				else
				{
					if (x < xm[id] - 33) {
						if (actmonst[id] == 1 || actmonst[id] == 0) { if (axmonst[id] > 0)axmonst[id] = 0;axmonst[id]--; }
					}
					else
					{
						if (x < xm[id] - 17)
						{
							axmonst[id] = 0;
							V2monst[id] = 0;
							if (actmonst[id] < 2)actmonst[id] = 1;
						}
						else { axmonst[id]++; }
					}

				}
				/*if (y + 4 > ym[id]) { if (ayfly[id] < 0)ayfly[id] = 0;ayfly[id]++; }
				else { if (ayfly[id] > 0)ayfly[id] = 0;ayfly[id]--; }
				if ((y + 5 - ym[id]<5 && y + 5>ym[id]) || (ym[id] - y - 5 - ym[id]<5 && ym[id]>y + 5))
					if ((x - xm[id]<5 && x > xm[id]) || (xm[id] - x < 5 && x < xm[id])) { heart1 = heart1 - atk; }*/

			}
			{//怪物动作与时间
				if (actmonst[id] == 1)
				{
					acttime[id]++;
					if (acttime[id] > 17)
					{
						actmonst[id] = 2;acttime[id] = 0;
					}
				}//怪物动作及时间判定

				if (actmonst[id] == 2)
				{
					acttime[id]++;
					if (acttime[id] > 1) {
						acttime[id] = 0;actmonst[id] = 3;
						if (conmonst[id] == -1)
						{
							for (b = -5;b < 18;b++)
							{
								c = b / 2;
								for (a = 3;a < 32 + c;a++)

									if (dx[1][ym[id] + b][xm[id] - a] == 1) { heart1 = heart1 - 9;goto hardsobreak; }
							}
						}
						else
						{
							for (b = -5;b < 18;b++)
							{
								c = b / 2;
								for (a = 3;a < 32 + c;a++)

									if (dx[0][ym[id] + b][xm[id] + a] == 1) { heart1 = heart1 - 9;goto hardsobreak; }
							}
						}

					}
				}
			hardsobreak:;
				if (actmonst[id] == 3)
				{
					acttime[id]++;
					axmonst[id] = 0;
					V2monst[id] = 0;
					if (acttime[id] > 45) {
						acttime[id] = 0;actmonst[id] = 0;
					}
				}
			}//怪物动作与时间

			


			y1 = ym[id];
			if (hurteen[id] != i[id])//伤害动画
			{
				hurteen[id] = i[id];
				延迟(300);
			}
			if (i[id] > 1)
			{//生命等于0时
				//怪物图像
				if (i[id] < 10000)
				{
					int *p1;

					p1 = &xm[id];

					{


						if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;//1
						if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
						if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						y1++;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;//2
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;

						y1++;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;//3
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						y1++;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;//4
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;
						if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
						if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						y1++;
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;//5
						if (dx[1][y1][*p1 + 7] == 0)dx[1][y1][*p1 + 7] = id;
						if (dx[1][y1][*p1 + 8] == 0)dx[1][y1][*p1 + 8] = id;
						if (dx[1][y1][*p1 + 9] == 0)dx[1][y1][*p1 + 9] = id;
						if (dx[1][y1][*p1 + 10] == 0)dx[1][y1][*p1 + 10] = id;
						if (dx[1][y1][*p1 + 11] == 0)dx[1][y1][*p1 + 11] = id;
						if (dx[1][y1][*p1 + 12] == 0)dx[1][y1][*p1 + 12] = id;
						if (dx[1][y1][*p1 - 7] == 0)dx[1][y1][*p1 - 7] = id;
						if (dx[1][y1][*p1 - 8] == 0)dx[1][y1][*p1 - 8] = id;
						if (dx[1][y1][*p1 - 9] == 0)dx[1][y1][*p1 - 9] = id;
						if (dx[1][y1][*p1 - 10] == 0)dx[1][y1][*p1 - 10] = id;
						if (dx[1][y1][*p1 - 11] == 0)dx[1][y1][*p1 - 11] = id;//5
						if (dx[1][y1][*p1 - 12] == 0)dx[1][y1][*p1 - 12] = id;
						y1++;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;//6
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;
						if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
						if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 + 4] == 0)dx[1][y1][*p1 + 4] = id;
						if (dx[1][y1][*p1 - 4] == 0)dx[1][y1][*p1 - 4] = id;
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 + 6] == 0)dx[1][y1][*p1 + 6] = id;
						if (dx[1][y1][*p1 - 6] == 0)dx[1][y1][*p1 - 6] = id;
						if (dx[1][y1][*p1 + 5] == 0)dx[1][y1][*p1 + 5] = id;
						if (dx[1][y1][*p1 - 5] == 0)dx[1][y1][*p1 - 5] = id;
						if (dx[1][y1][*p1 - 7] == 0)dx[1][y1][*p1 - 7] = id;
						if (dx[1][y1][*p1 + 7] == 0)dx[1][y1][*p1 + 7] = id;
						if (dx[1][y1][*p1 - 13] == 0)dx[1][y1][*p1 - 13] = id;
						if (dx[1][y1][*p1 + 13] == 0)dx[1][y1][*p1 + 13] = id;
						y1++;
						//七层
						if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;
						if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
						if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
						if (dx[1][y1][*p1 + 6] == 0)dx[1][y1][*p1 + 6] = id;
						if (dx[1][y1][*p1 - 6] == 0)dx[1][y1][*p1 - 6] = id;
						if (dx[1][y1][*p1 - 7] == 0)dx[1][y1][*p1 - 7] = id;
						if (dx[1][y1][*p1 + 7] == 0)dx[1][y1][*p1 + 7] = id;
						if (dx[1][y1][*p1 - 13] == 0)dx[1][y1][*p1 - 13] = id;
						if (dx[1][y1][*p1 + 13] == 0)dx[1][y1][*p1 + 13] = id;


						y1++;//八层
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;
						if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
						if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 + 4] == 0)dx[1][y1][*p1 + 4] = id;
						if (dx[1][y1][*p1 - 4] == 0)dx[1][y1][*p1 - 4] = id;
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 + 6] == 0)dx[1][y1][*p1 + 6] = id;
						if (dx[1][y1][*p1 - 6] == 0)dx[1][y1][*p1 - 6] = id;
						if (dx[1][y1][*p1 + 5] == 0)dx[1][y1][*p1 + 5] = id;
						if (dx[1][y1][*p1 - 5] == 0)dx[1][y1][*p1 - 5] = id;
						if (dx[1][y1][*p1 - 8] == 0)dx[1][y1][*p1 - 8] = id;
						if (dx[1][y1][*p1 - 9] == 0)dx[1][y1][*p1 - 9] = id;
						if (dx[1][y1][*p1 - 10] == 0)dx[1][y1][*p1 - 10] = id;
						if (dx[1][y1][*p1 - 11] == 0)dx[1][y1][*p1 - 11] = id;
						if (dx[1][y1][*p1 - 12] == 0)dx[1][y1][*p1 - 12] = id;
						if (dx[1][y1][*p1 + 8] == 0)dx[1][y1][*p1 + 8] = id;
						if (dx[1][y1][*p1 + 9] == 0)dx[1][y1][*p1 + 9] = id;
						if (dx[1][y1][*p1 + 10] == 0)dx[1][y1][*p1 + 10] = id;
						if (dx[1][y1][*p1 + 11] == 0)dx[1][y1][*p1 + 11] = id;
						if (dx[1][y1][*p1 + 12] == 0)dx[1][y1][*p1 + 12] = id;
						if (dx[1][y1][*p1 - 13] == 0)dx[1][y1][*p1 - 13] = id;
						if (dx[1][y1][*p1 + 13] == 0)dx[1][y1][*p1 + 13] = id;
						y1++;//九层
						if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
						if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
						if (dx[1][y1][*p1 + 4] == 0)dx[1][y1][*p1 + 4] = id;
						if (dx[1][y1][*p1 - 4] == 0)dx[1][y1][*p1 - 4] = id;
						if (dx[1][y1][*p1 + 5] == 0)dx[1][y1][*p1 + 5] = id;
						if (dx[1][y1][*p1 - 5] == 0)dx[1][y1][*p1 - 5] = id;
						if (dx[1][y1][*p1 - 9] == 0)dx[1][y1][*p1 - 9] = id;
						if (dx[1][y1][*p1 + 9] == 0)dx[1][y1][*p1 + 9] = id;
						if (dx[1][y1][*p1 + 12] == 0)dx[1][y1][*p1 + 12] = id;
						if (dx[1][y1][*p1 - 12] == 0)dx[1][y1][*p1 - 12] = id;

						if (conmonst[id] < 0)//左
						{
							if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4) { if (dx[1][y1][*p1 - 20] == 0)dx[1][y1][*p1 - 20] = id + 1; }
							else if (actmonst[id] == 1)
							{
								if (dx[1][y1][*p1 - 12] == id)dx[1][y1][*p1 - 12] = 0;
								if (dx[1][y1][*p1 - 9] == id)dx[1][y1][*p1 - 9] = 0;
							}

						}
						else//右
						{
							if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4) {
								if (dx[1][y1][*p1 + 20] == 0)dx[1][y1][*p1 + 20] = id + 1;
							}
							else if (actmonst[id] == 1)
							{
								if (dx[1][y1][*p1 + 12] == id)dx[1][y1][*p1 + 12] = 0;
								if (dx[1][y1][*p1 + 9] == id)dx[1][y1][*p1 + 9] = 0;
							}
						}
						y1++;//10
						if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
						if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;

						if (dx[1][y1][*p1 + 4] == 0)dx[1][y1][*p1 + 4] = id;
						if (dx[1][y1][*p1 - 4] == 0)dx[1][y1][*p1 - 4] = id;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						if (dx[1][y1][*p1 - 8] == 0)dx[1][y1][*p1 - 8] = id;
						if (dx[1][y1][*p1 + 8] == 0)dx[1][y1][*p1 + 8] = id;
						if (dx[1][y1][*p1 - 9] == 0)dx[1][y1][*p1 - 9] = id;
						if (dx[1][y1][*p1 + 9] == 0)dx[1][y1][*p1 + 9] = id;
						if (dx[1][y1][*p1 + 12] == 0)dx[1][y1][*p1 + 12] = id;
						if (dx[1][y1][*p1 - 12] == 0)dx[1][y1][*p1 - 12] = id;
						if (dx[1][y1][*p1 - 13] == 0)dx[1][y1][*p1 - 13] = id;
						if (dx[1][y1][*p1 + 13] == 0)dx[1][y1][*p1 + 13] = id;

						if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4)
						{
							if (conmonst[id] < 0)//左
							{
								if (dx[1][y1][*p1 - 20] == 0)dx[1][y1][*p1 - 20] = id + 1;
								if (dx[1][y1][*p1 - 21] == 0)dx[1][y1][*p1 - 21] = id + 1;

							}
							else//右
							{

								if (dx[1][y1][*p1 + 20] == 0)dx[1][y1][*p1 + 20] = id + 1;
								if (dx[1][y1][*p1 + 21] == 0)dx[1][y1][*p1 + 21] = id + 1;


							}
						}

						if (actmonst[id] == 1)
						{
							if (conmonst[id] < 0) {
								if (dx[1][y1][*p1 - 12] == id)dx[1][y1][*p1 - 12] = 0;
								if (dx[1][y1][*p1 - 9] == id)dx[1][y1][*p1 - 9] = 0;
								if (dx[1][y1][*p1 - 13] == id)dx[1][y1][*p1 - 13] = 0;
								if (dx[1][y1][*p1 - 8] == id)dx[1][y1][*p1 - 8] = 0;
							}
							else {

								if (dx[1][y1][*p1 + 12] == id)dx[1][y1][*p1 + 12] = 0;
								if (dx[1][y1][*p1 + 9] == id)dx[1][y1][*p1 + 9] = 0;
								if (dx[1][y1][*p1 + 13] == id)dx[1][y1][*p1 + 13] = 0;
								if (dx[1][y1][*p1 + 8] == id)dx[1][y1][*p1 + 8] = 0;
							}
						}
						y1++;//11
						if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
						if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;

						if (dx[1][y1][*p1 - 7] == 0)dx[1][y1][*p1 - 7] = id;
						if (dx[1][y1][*p1 + 7] == 0)dx[1][y1][*p1 + 7] = id;
						if (dx[1][y1][*p1 - 8] == 0)dx[1][y1][*p1 - 8] = id;
						if (dx[1][y1][*p1 + 8] == 0)dx[1][y1][*p1 + 8] = id;
						if (dx[1][y1][*p1 - 9] == 0)dx[1][y1][*p1 - 9] = id;
						if (dx[1][y1][*p1 + 9] == 0)dx[1][y1][*p1 + 9] = id;
						if (dx[1][y1][*p1 + 10] == 0)dx[1][y1][*p1 + 10] = id;
						if (dx[1][y1][*p1 - 10] == 0)dx[1][y1][*p1 - 10] = id;
						if (dx[1][y1][*p1 + 11] == 0)dx[1][y1][*p1 + 11] = id;
						if (dx[1][y1][*p1 - 11] == 0)dx[1][y1][*p1 - 11] = id;
						if (dx[1][y1][*p1 + 12] == 0)dx[1][y1][*p1 + 12] = id;
						if (dx[1][y1][*p1 - 12] == 0)dx[1][y1][*p1 - 12] = id;
						if (dx[1][y1][*p1 - 13] == 0)dx[1][y1][*p1 - 13] = id;
						if (dx[1][y1][*p1 + 13] == 0)dx[1][y1][*p1 + 13] = id;
						if (dx[1][y1][*p1 - 14] == 0)dx[1][y1][*p1 - 14] = id;
						if (dx[1][y1][*p1 + 14] == 0)dx[1][y1][*p1 + 14] = id;

						if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4) {


							if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
							if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
							if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;
							if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
							if (dx[1][y1][*p1 + 4] == 0)dx[1][y1][*p1 + 4] = id;
							if (dx[1][y1][*p1 - 4] == 0)dx[1][y1][*p1 - 4] = id;
							if (dx[1][y1][*p1 + 5] == 0)dx[1][y1][*p1 + 5] = id;
							if (dx[1][y1][*p1 - 5] == 0)dx[1][y1][*p1 - 5] = id;
							if (dx[1][y1][*p1 + 6] == 0)dx[1][y1][*p1 + 6] = id;
							if (dx[1][y1][*p1 - 6] == 0)dx[1][y1][*p1 - 6] = id;


							//右
							if (conmonst[id] < 0)
							{
								if (dx[1][y1][*p1 - 15] == 0)dx[1][y1][*p1 - 15] = id + 1;
								if (dx[1][y1][*p1 - 16] == 0)dx[1][y1][*p1 - 16] = id + 1;
								if (dx[1][y1][*p1 - 17] == 0)dx[1][y1][*p1 - 17] = id + 1;
								if (dx[1][y1][*p1 - 18] == 0)dx[1][y1][*p1 - 18] = id + 1;
								if (dx[1][y1][*p1 - 19] == 0)dx[1][y1][*p1 - 19] = id + 1;
								if (dx[1][y1][*p1 - 20] == 0)dx[1][y1][*p1 - 20] = id + 1;
								if (dx[1][y1][*p1 - 21] == 0)dx[1][y1][*p1 - 21] = id + 1;
								if (dx[1][y1][*p1 - 22] == 0)dx[1][y1][*p1 - 22] = id + 1;
								if (dx[1][y1][*p1 - 23] == 0)dx[1][y1][*p1 - 23] = id + 1;
								if (dx[1][y1][*p1 - 24] == 0)dx[1][y1][*p1 - 24] = id + 1;
								if (dx[1][y1][*p1 - 25] == 0)dx[1][y1][*p1 - 25] = id + 1;
								if (dx[1][y1][*p1 - 26] == 0)dx[1][y1][*p1 - 26] = id + 1;
								if (dx[1][y1][*p1 - 27] == 0)dx[1][y1][*p1 - 27] = id + 1;
								if (dx[1][y1][*p1 - 28] == 0)dx[1][y1][*p1 - 28] = id + 1;
								if (dx[1][y1][*p1 - 29] == 0)dx[1][y1][*p1 - 29] = id + 1;
								if (dx[1][y1][*p1 - 30] == 0)dx[1][y1][*p1 - 30] = id + 1;
								if (dx[1][y1][*p1 - 31] == 0)dx[1][y1][*p1 - 31] = id + 1;
								if (dx[1][y1][*p1 - 32] == 0)dx[1][y1][*p1 - 32] = id + 1;
								if (dx[1][y1][*p1 - 33] == 0)dx[1][y1][*p1 - 33] = id + 1;
								if (dx[1][y1][*p1 - 34] == 0)dx[1][y1][*p1 - 34] = id + 1;
								if (dx[1][y1][*p1 - 35] == 0)dx[1][y1][*p1 - 35] = id + 1;
							}
							else
							{



								if (dx[1][y1][*p1 + 15] == 0)dx[1][y1][*p1 + 15] = id + 1;
								if (dx[1][y1][*p1 + 16] == 0)dx[1][y1][*p1 + 16] = id + 1;
								if (dx[1][y1][*p1 + 17] == 0)dx[1][y1][*p1 + 17] = id + 1;
								if (dx[1][y1][*p1 + 18] == 0)dx[1][y1][*p1 + 18] = id + 1;
								if (dx[1][y1][*p1 + 19] == 0)dx[1][y1][*p1 + 19] = id + 1;
								if (dx[1][y1][*p1 + 20] == 0)dx[1][y1][*p1 + 20] = id + 1;
								if (dx[1][y1][*p1 + 21] == 0)dx[1][y1][*p1 + 21] = id + 1;
								if (dx[1][y1][*p1 + 22] == 0)dx[1][y1][*p1 + 22] = id + 1;
								if (dx[1][y1][*p1 + 23] == 0)dx[1][y1][*p1 + 23] = id + 1;
								if (dx[1][y1][*p1 + 24] == 0)dx[1][y1][*p1 + 24] = id + 1;
								if (dx[1][y1][*p1 + 25] == 0)dx[1][y1][*p1 + 25] = id + 1;
								if (dx[1][y1][*p1 + 26] == 0)dx[1][y1][*p1 + 26] = id + 1;
								if (dx[1][y1][*p1 + 27] == 0)dx[1][y1][*p1 + 27] = id + 1;
								if (dx[1][y1][*p1 + 28] == 0)dx[1][y1][*p1 + 28] = id + 1;
								if (dx[1][y1][*p1 + 29] == 0)dx[1][y1][*p1 + 29] = id + 1;
								if (dx[1][y1][*p1 + 30] == 0)dx[1][y1][*p1 + 30] = id + 1;
								if (dx[1][y1][*p1 + 31] == 0)dx[1][y1][*p1 + 31] = id + 1;
								if (dx[1][y1][*p1 + 32] == 0)dx[1][y1][*p1 + 32] = id + 1;
								if (dx[1][y1][*p1 + 33] == 0)dx[1][y1][*p1 + 33] = id + 1;
								if (dx[1][y1][*p1 + 34] == 0)dx[1][y1][*p1 + 34] = id + 1;
								if (dx[1][y1][*p1 + 35] == 0)dx[1][y1][*p1 + 35] = id + 1;
							}
						}

						if (actmonst[id] == 1)
						{
							if (conmonst[id] < 0) {
								if (dx[1][y1][*p1 - 12] == id)dx[1][y1][*p1 - 12] = 0;
								if (dx[1][y1][*p1 - 9] == id)dx[1][y1][*p1 - 9] = 0;
								if (dx[1][y1][*p1 - 13] == id)dx[1][y1][*p1 - 13] = 0;
								if (dx[1][y1][*p1 - 8] == id)dx[1][y1][*p1 - 8] = 0;
								if (dx[1][y1][*p1 - 10] == id)dx[1][y1][*p1 - 10] = 0;
								if (dx[1][y1][*p1 - 11] == id)dx[1][y1][*p1 - 11] = 0;
								if (dx[1][y1][*p1 - 7] == id)dx[1][y1][*p1 - 7] = 0;
								if (dx[1][y1][*p1 - 14] == id)dx[1][y1][*p1 - 14] = 0;
							}
							else {

								if (dx[1][y1][*p1 + 12] == id)dx[1][y1][*p1 + 12] = 0;
								if (dx[1][y1][*p1 + 9] == id)dx[1][y1][*p1 + 9] = 0;
								if (dx[1][y1][*p1 + 13] == id)dx[1][y1][*p1 + 13] = 0;
								if (dx[1][y1][*p1 + 8] == id)dx[1][y1][*p1 + 8] = 0;
								if (dx[1][y1][*p1 + 10] == id)dx[1][y1][*p1 + 10] = 0;
								if (dx[1][y1][*p1 + 11] == id)dx[1][y1][*p1 + 11] = 0;
								if (dx[1][y1][*p1 + 7] == id)dx[1][y1][*p1 + 7] = 0;
								if (dx[1][y1][*p1 + 14] == id)dx[1][y1][*p1 + 14] = 0;
							}
						}




						y1++;//12
						if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;
						if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
						if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 - 8] == 0)dx[1][y1][*p1 - 8] = id;
						if (dx[1][y1][*p1 + 8] == 0)dx[1][y1][*p1 + 8] = id;
						if (dx[1][y1][*p1 - 9] == 0)dx[1][y1][*p1 - 9] = id;
						if (dx[1][y1][*p1 + 9] == 0)dx[1][y1][*p1 + 9] = id;
						if (dx[1][y1][*p1 + 10] == 0)dx[1][y1][*p1 + 10] = id;
						if (dx[1][y1][*p1 - 10] == 0)dx[1][y1][*p1 - 10] = id;
						if (dx[1][y1][*p1 + 11] == 0)dx[1][y1][*p1 + 11] = id;
						if (dx[1][y1][*p1 - 11] == 0)dx[1][y1][*p1 - 11] = id;
						if (dx[1][y1][*p1 + 12] == 0)dx[1][y1][*p1 + 12] = id;
						if (dx[1][y1][*p1 - 12] == 0)dx[1][y1][*p1 - 12] = id;
						if (dx[1][y1][*p1 - 13] == 0)dx[1][y1][*p1 - 13] = id;
						//右
						if (conmonst[id] < 0)
						{
							if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4)
							{
								if (dx[1][y1][*p1 - 20] == 0)dx[1][y1][*p1 - 20] = id + 1;
								if (dx[1][y1][*p1 - 21] == 0)dx[1][y1][*p1 - 21] = id + 1;
								if (dx[1][y1][*p1 - 24] == 0)dx[1][y1][*p1 - 24] = id + 1;
								if (dx[1][y1][*p1 - 25] == 0)dx[1][y1][*p1 - 25] = id + 1;
								if (dx[1][y1][*p1 - 26] == 0)dx[1][y1][*p1 - 26] = id + 1;
								if (dx[1][y1][*p1 - 27] == 0)dx[1][y1][*p1 - 27] = id + 1;
								if (dx[1][y1][*p1 - 28] == 0)dx[1][y1][*p1 - 28] = id + 1;
								if (dx[1][y1][*p1 - 29] == 0)dx[1][y1][*p1 - 29] = id + 1;
								if (dx[1][y1][*p1 - 30] == 0)dx[1][y1][*p1 - 30] = id + 1;
								if (dx[1][y1][*p1 - 31] == 0)dx[1][y1][*p1 - 31] = id + 1;
								if (dx[1][y1][*p1 - 32] == 0)dx[1][y1][*p1 - 32] = id + 1;
								if (dx[1][y1][*p1 - 33] == 0)dx[1][y1][*p1 - 33] = id + 1;
							}
						}
						else//左
						{
							if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4)
							{
								if (dx[1][y1][*p1 + 20] == 0)dx[1][y1][*p1 + 20] = id + 1;
								if (dx[1][y1][*p1 + 21] == 0)dx[1][y1][*p1 + 21] = id + 1;
								if (dx[1][y1][*p1 + 24] == 0)dx[1][y1][*p1 + 24] = id + 1;
								if (dx[1][y1][*p1 + 25] == 0)dx[1][y1][*p1 + 25] = id + 1;
								if (dx[1][y1][*p1 + 26] == 0)dx[1][y1][*p1 + 26] = id + 1;
								if (dx[1][y1][*p1 + 27] == 0)dx[1][y1][*p1 + 27] = id + 1;
								if (dx[1][y1][*p1 + 28] == 0)dx[1][y1][*p1 + 28] = id + 1;
								if (dx[1][y1][*p1 + 29] == 0)dx[1][y1][*p1 + 29] = id + 1;
								if (dx[1][y1][*p1 + 30] == 0)dx[1][y1][*p1 + 30] = id + 1;
								if (dx[1][y1][*p1 + 31] == 0)dx[1][y1][*p1 + 31] = id + 1;
								if (dx[1][y1][*p1 + 32] == 0)dx[1][y1][*p1 + 32] = id + 1;
								if (dx[1][y1][*p1 + 33] == 0)dx[1][y1][*p1 + 33] = id + 1;
							}
						}
						if (actmonst[id] == 1)
						{
							if (conmonst[id] < 0) {
								if (dx[1][y1][*p1 - 12] == id)dx[1][y1][*p1 - 12] = 0;
								if (dx[1][y1][*p1 - 9] == id)dx[1][y1][*p1 - 9] = 0;
								if (dx[1][y1][*p1 - 13] == id)dx[1][y1][*p1 - 13] = 0;
								if (dx[1][y1][*p1 - 8] == id)dx[1][y1][*p1 - 8] = 0;
								if (dx[1][y1][*p1 - 10] == id)dx[1][y1][*p1 - 10] = 0;
								if (dx[1][y1][*p1 - 11] == id)dx[1][y1][*p1 - 11] = 0;
							}
							else {

								if (dx[1][y1][*p1 + 12] == id)dx[1][y1][*p1 + 12] = 0;
								if (dx[1][y1][*p1 + 9] == id)dx[1][y1][*p1 + 9] = 0;
								if (dx[1][y1][*p1 + 13] == id)dx[1][y1][*p1 + 13] = 0;
								if (dx[1][y1][*p1 + 8] == id)dx[1][y1][*p1 + 8] = 0;
								if (dx[1][y1][*p1 + 10] == id)dx[1][y1][*p1 + 10] = 0;
								if (dx[1][y1][*p1 + 11] == id)dx[1][y1][*p1 + 11] = 0;
							}
						}
						y1++;//13
						if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;
						if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
						if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						//右
						if (conmonst[id] < 0)
						{
							if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4) {
								if (dx[1][y1][*p1 - 20] == 0)dx[1][y1][*p1 - 20] = id + 1;
								if (dx[1][y1][*p1 - 24] == 0)dx[1][y1][*p1 - 24] = id + 1;
								if (dx[1][y1][*p1 - 25] == 0)dx[1][y1][*p1 - 25] = id + 1;
								if (dx[1][y1][*p1 - 26] == 0)dx[1][y1][*p1 - 26] = id + 1;
								if (dx[1][y1][*p1 - 27] == 0)dx[1][y1][*p1 - 27] = id + 1;
								if (dx[1][y1][*p1 - 28] == 0)dx[1][y1][*p1 - 28] = id + 1;
								if (dx[1][y1][*p1 - 29] == 0)dx[1][y1][*p1 - 29] = id + 1;
							}
						}
						else//左
						{
							if (actmonst[id] == 0 || actmonst[id] == 2 || actmonst[id] == 4)
							{
								if (dx[1][y1][*p1 + 20] == 0)dx[1][y1][*p1 + 20] = id + 1;
								if (dx[1][y1][*p1 + 24] == 0)dx[1][y1][*p1 + 24] = id + 1;
								if (dx[1][y1][*p1 + 25] == 0)dx[1][y1][*p1 + 25] = id + 1;
								if (dx[1][y1][*p1 + 26] == 0)dx[1][y1][*p1 + 26] = id + 1;
								if (dx[1][y1][*p1 + 27] == 0)dx[1][y1][*p1 + 27] = id + 1;
								if (dx[1][y1][*p1 + 28] == 0)dx[1][y1][*p1 + 28] = id + 1;
								if (dx[1][y1][*p1 + 29] == 0)dx[1][y1][*p1 + 29] = id + 1;
							}
						}
						y1++;//14
						if (dx[1][y1][*p1] == 0)dx[1][y1][*p1] = id;
						if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
						if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						if (dx[1][y1][*p1 + 4] == 0)dx[1][y1][*p1 + 4] = id;
						if (dx[1][y1][*p1 - 4] == 0)dx[1][y1][*p1 - 4] = id;
						y1++;//15
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						if (dx[1][y1][*p1 + 4] == 0)dx[1][y1][*p1 + 4] = id;
						if (dx[1][y1][*p1 - 4] == 0)dx[1][y1][*p1 - 4] = id;
						y1++;//16
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						if (dx[1][y1][*p1 + 4] == 0)dx[1][y1][*p1 + 4] = id;
						if (dx[1][y1][*p1 - 4] == 0)dx[1][y1][*p1 - 4] = id;
						y1++;//17
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						if (dx[1][y1][*p1 + 4] == 0)dx[1][y1][*p1 + 4] = id;
						if (dx[1][y1][*p1 - 4] == 0)dx[1][y1][*p1 - 4] = id;
						y1++;//18
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						if (dx[1][y1][*p1 + 4] == 0)dx[1][y1][*p1 + 4] = id;
						if (dx[1][y1][*p1 - 4] == 0)dx[1][y1][*p1 - 4] = id;
						//右
						if (conmonst[id] < 0)
						{
							if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
							if (dx[1][y1][*p1 - 5] == 0)dx[1][y1][*p1 - 5] = id;
						}
						else//左 
						{
							if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
							if (dx[1][y1][*p1 + 5] == 0)dx[1][y1][*p1 + 5] = id;
						}
						y1++;//19
						if (dx[1][y1][*p1 + 2] == 0)dx[1][y1][*p1 + 2] = id;
						if (dx[1][y1][*p1 - 2] == 0)dx[1][y1][*p1 - 2] = id;
						if (dx[1][y1][*p1 + 3] == 0)dx[1][y1][*p1 + 3] = id;
						if (dx[1][y1][*p1 - 3] == 0)dx[1][y1][*p1 - 3] = id;
						if (dx[1][y1][*p1 + 4] == 0)dx[1][y1][*p1 + 4] = id;
						if (dx[1][y1][*p1 - 4] == 0)dx[1][y1][*p1 - 4] = id;
						//右
						if (conmonst[id] < 0)
						{
							if (dx[1][y1][*p1 + 1] == 0)dx[1][y1][*p1 + 1] = id;
							if (dx[1][y1][*p1 - 5] == 0)dx[1][y1][*p1 - 5] = id;
						}
						else//左 
						{
							if (dx[1][y1][*p1 - 1] == 0)dx[1][y1][*p1 - 1] = id;
							if (dx[1][y1][*p1 + 5] == 0)dx[1][y1][*p1 + 5] = id;
						}
					}
					if (actmonst[id] == 1)//持有的武器
					{
						yfork = ym[id];
						xfork = xm[id];
						yfork -= 2;
						if (conmonst[id] > 0)
						{
							//右

							if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;
							if (dx[1][yfork][xfork + 33] == 0)dx[1][yfork][xfork + 33] = id + 1;
							if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;
							if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;
							yfork++;
							//右
							if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;
							if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;
							if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;
							if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;
							if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;
							if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;
							yfork++;
							if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;//33
							if (dx[1][yfork][xfork + 33] == 0)dx[1][yfork][xfork + 33] = id + 1;//32
							if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;//31
							if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//30
							if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//29
							if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//28
							if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//27
							if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//26
							if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//25
							if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 33] == 0)dx[1][yfork][xfork + 33] = id + 1;//32
							if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;//31
							if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//30
							if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//29
							if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//28
							if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//27
							if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//26
							if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//24
							if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//23
							if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//22
							if (dx[1][yfork][xfork + 22] == 0)dx[1][yfork][xfork + 22] = id + 1;//21
							if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//30
							if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//29
							if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//28
							if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//27
							if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//26
							if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//25
							if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//24
							if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//23
							if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//22
							if (dx[1][yfork][xfork + 22] == 0)dx[1][yfork][xfork + 22] = id + 1;//21
							if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//20
							if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//19
							if (dx[1][yfork][xfork + 19] == 0)dx[1][yfork][xfork + 19] = id + 1;//18
							if (dx[1][yfork][xfork + 18] == 0)dx[1][yfork][xfork + 18] = id + 1;//17
							if (dx[1][yfork][xfork + 17] == 0)dx[1][yfork][xfork + 17] = id + 1;//16
							if (dx[1][yfork][xfork + 16] == 0)dx[1][yfork][xfork + 16] = id + 1;//15
							if (dx[1][yfork][xfork + 15] == 0)dx[1][yfork][xfork + 15] = id + 1;//14
							if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//13
							if (dx[1][yfork][xfork + 13] == 0)dx[1][yfork][xfork + 13] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//25
							if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//24
							if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//23
							if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//21
							if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//20
							if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//19
							if (dx[1][yfork][xfork + 19] == 0)dx[1][yfork][xfork + 19] = id + 1;//18
							if (dx[1][yfork][xfork + 18] == 0)dx[1][yfork][xfork + 18] = id + 1;//17
							if (dx[1][yfork][xfork + 17] == 0)dx[1][yfork][xfork + 17] = id + 1;//16
							if (dx[1][yfork][xfork + 16] == 0)dx[1][yfork][xfork + 16] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//15
							if (dx[1][yfork][xfork + 15] == 0)dx[1][yfork][xfork + 15] = id + 1;//16
							if (dx[1][yfork][xfork + 16] == 0)dx[1][yfork][xfork + 16] = id + 1;//18
							if (dx[1][yfork][xfork + 18] == 0)dx[1][yfork][xfork + 18] = id + 1;//19
							if (dx[1][yfork][xfork + 19] == 0)dx[1][yfork][xfork + 19] = id + 1;//20
							if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//21
							if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//11
							if (dx[1][yfork][xfork + 11] == 0)dx[1][yfork][xfork + 11] = id + 1;//12
							if (dx[1][yfork][xfork + 12] == 0)dx[1][yfork][xfork + 12] = id + 1;//20
							if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//21
							if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//22
							if (dx[1][yfork][xfork + 22] == 0)dx[1][yfork][xfork + 22] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 8] == 0)dx[1][yfork][xfork + 8] = id + 1;//9
							if (dx[1][yfork][xfork + 9] == 0)dx[1][yfork][xfork + 9] = id + 1;//10
							if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//22
							if (dx[1][yfork][xfork + 22] == 0)dx[1][yfork][xfork + 22] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 7] == 0)dx[1][yfork][xfork + 7] = id + 1;//
							yfork++;

						}
						else
						{
							//左

							if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;
							if (dx[1][yfork][xfork - 33] == 0)dx[1][yfork][xfork - 33] = id + 1;
							if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;
							if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;
							yfork++;
							//右
							if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;
							if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;
							if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;
							if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;
							if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;
							if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;
							yfork++;
							if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;//33
							if (dx[1][yfork][xfork - 33] == 0)dx[1][yfork][xfork - 33] = id + 1;//32
							if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;//31
							if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//30
							if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//29
							if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//28
							if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//27
							if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//26
							if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//25
							if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 33] == 0)dx[1][yfork][xfork - 33] = id + 1;//32
							if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;//31
							if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//30
							if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//29
							if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//28
							if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//27
							if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//26
							if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//24
							if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//23
							if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//22
							if (dx[1][yfork][xfork - 22] == 0)dx[1][yfork][xfork - 22] = id + 1;//21
							if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//30
							if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//29
							if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//28
							if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//27
							if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//26
							if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//25
							if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//24
							if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//23
							if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//22
							if (dx[1][yfork][xfork - 22] == 0)dx[1][yfork][xfork - 22] = id + 1;//21
							if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//20
							if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//19
							if (dx[1][yfork][xfork - 19] == 0)dx[1][yfork][xfork - 19] = id + 1;//18
							if (dx[1][yfork][xfork - 18] == 0)dx[1][yfork][xfork - 18] = id + 1;//17
							if (dx[1][yfork][xfork - 17] == 0)dx[1][yfork][xfork - 17] = id + 1;//16
							if (dx[1][yfork][xfork - 16] == 0)dx[1][yfork][xfork - 16] = id + 1;//15
							if (dx[1][yfork][xfork - 15] == 0)dx[1][yfork][xfork - 15] = id + 1;//14
							if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//13
							if (dx[1][yfork][xfork - 13] == 0)dx[1][yfork][xfork - 13] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//25
							if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//24
							if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//23
							if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//21
							if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//20
							if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//19
							if (dx[1][yfork][xfork - 19] == 0)dx[1][yfork][xfork - 19] = id + 1;//18
							if (dx[1][yfork][xfork - 18] == 0)dx[1][yfork][xfork - 18] = id + 1;//17
							if (dx[1][yfork][xfork - 17] == 0)dx[1][yfork][xfork - 17] = id + 1;//16
							if (dx[1][yfork][xfork - 16] == 0)dx[1][yfork][xfork - 16] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//15
							if (dx[1][yfork][xfork - 15] == 0)dx[1][yfork][xfork - 15] = id + 1;//16
							if (dx[1][yfork][xfork - 16] == 0)dx[1][yfork][xfork - 16] = id + 1;//18
							if (dx[1][yfork][xfork - 18] == 0)dx[1][yfork][xfork - 18] = id + 1;//19
							if (dx[1][yfork][xfork - 19] == 0)dx[1][yfork][xfork - 19] = id + 1;//20
							if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//21
							if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//11
							if (dx[1][yfork][xfork - 11] == 0)dx[1][yfork][xfork - 11] = id + 1;//12
							if (dx[1][yfork][xfork - 12] == 0)dx[1][yfork][xfork - 12] = id + 1;//20
							if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//21
							if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//22
							if (dx[1][yfork][xfork - 22] == 0)dx[1][yfork][xfork - 22] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 8] == 0)dx[1][yfork][xfork - 8] = id + 1;//9
							if (dx[1][yfork][xfork - 9] == 0)dx[1][yfork][xfork - 9] = id + 1;//10
							if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//22
							if (dx[1][yfork][xfork - 22] == 0)dx[1][yfork][xfork - 22] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 7] == 0)dx[1][yfork][xfork - 7] = id + 1;//
							yfork++;
						}
					}
					if (actmonst[id] == 3)//持有的武器
					{
						yfork = ym[id] + 8;
						xfork = xm[id];

						if (conmonst[id] > 0)
						{
							if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//15
							if (dx[1][yfork][xfork - 15] == 0)dx[1][yfork][xfork - 15] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 11] == 0)dx[1][yfork][xfork - 11] = id + 1;//10
							if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//14
							if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 3] == 0)dx[1][yfork][xfork - 3] = id + 1;//4
							if (dx[1][yfork][xfork - 4] == 0)dx[1][yfork][xfork - 4] = id + 1;//5
							if (dx[1][yfork][xfork - 5] == 0)dx[1][yfork][xfork - 5] = id + 1;//6
							if (dx[1][yfork][xfork - 6] == 0)dx[1][yfork][xfork - 6] = id + 1;//7
							if (dx[1][yfork][xfork - 7] == 0)dx[1][yfork][xfork - 7] = id + 1;//8
							if (dx[1][yfork][xfork - 8] == 0)dx[1][yfork][xfork - 8] = id + 1;//9
							if (dx[1][yfork][xfork - 9] == 0)dx[1][yfork][xfork - 9] = id + 1;//10
							if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//11
							if (dx[1][yfork][xfork - 11] == 0)dx[1][yfork][xfork - 11] = id + 1;//12
							if (dx[1][yfork][xfork - 12] == 0)dx[1][yfork][xfork - 12] = id + 1;//13
							if (dx[1][yfork][xfork - 13] == 0)dx[1][yfork][xfork - 13] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 3] == 0)dx[1][yfork][xfork - 3] = id + 1;//
							if (dx[1][yfork][xfork + 3] == 0)dx[1][yfork][xfork + 3] = id + 1;//-3
							if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//
							yfork++;

							if (dx[1][yfork][xfork + 5] == 0)dx[1][yfork][xfork + 5] = id + 1;//7
							if (dx[1][yfork][xfork + 7] == 0)dx[1][yfork][xfork + 7] = id + 1;//8
							if (dx[1][yfork][xfork + 8] == 0)dx[1][yfork][xfork + 8] = id + 1;//9
							if (dx[1][yfork][xfork + 9] == 0)dx[1][yfork][xfork + 9] = id + 1;//10
							if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//11
							if (dx[1][yfork][xfork + 11] == 0)dx[1][yfork][xfork + 11] = id + 1;//12
							if (dx[1][yfork][xfork + 12] == 0)dx[1][yfork][xfork + 12] = id + 1;//13
							if (dx[1][yfork][xfork + 13] == 0)dx[1][yfork][xfork + 13] = id + 1;//14
							if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//
							if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//25
							if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 9] == 0)dx[1][yfork][xfork + 9] = id + 1;//10
							if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//11
							if (dx[1][yfork][xfork + 11] == 0)dx[1][yfork][xfork + 11] = id + 1;//12
							if (dx[1][yfork][xfork + 12] == 0)dx[1][yfork][xfork + 12] = id + 1;//13
							if (dx[1][yfork][xfork + 13] == 0)dx[1][yfork][xfork + 13] = id + 1;//14
							if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//15
							if (dx[1][yfork][xfork + 15] == 0)dx[1][yfork][xfork + 15] = id + 1;//16
							if (dx[1][yfork][xfork + 16] == 0)dx[1][yfork][xfork + 16] = id + 1;//17
							if (dx[1][yfork][xfork + 17] == 0)dx[1][yfork][xfork + 17] = id + 1;//18
							if (dx[1][yfork][xfork + 18] == 0)dx[1][yfork][xfork + 18] = id + 1;//19
							if (dx[1][yfork][xfork + 19] == 0)dx[1][yfork][xfork + 19] = id + 1;//20
							if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//21
							if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//
							if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//24
							if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//21
							if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//22
							if (dx[1][yfork][xfork + 22] == 0)dx[1][yfork][xfork + 22] = id + 1;//23
							if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//24
							if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//25
							if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//26
							if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//27
							if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//28
							if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//21
							if (dx[1][yfork][xfork + 21] == 0)dx[1][yfork][xfork + 21] = id + 1;//
							if (dx[1][yfork][xfork + 23] == 0)dx[1][yfork][xfork + 23] = id + 1;//24
							if (dx[1][yfork][xfork + 24] == 0)dx[1][yfork][xfork + 24] = id + 1;//25
							if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//26
							if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//27
							if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//28
							if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//29
							if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//30
							if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//31
							if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//32
							if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;//33
							if (dx[1][yfork][xfork + 33] == 0)dx[1][yfork][xfork + 33] = id + 1;//34
							if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 18] == 0)dx[1][yfork][xfork + 18] = id + 1;//19
							if (dx[1][yfork][xfork + 19] == 0)dx[1][yfork][xfork + 19] = id + 1;//20
							if (dx[1][yfork][xfork + 20] == 0)dx[1][yfork][xfork + 20] = id + 1;//
							if (dx[1][yfork][xfork + 25] == 0)dx[1][yfork][xfork + 25] = id + 1;//26
							if (dx[1][yfork][xfork + 26] == 0)dx[1][yfork][xfork + 26] = id + 1;//27
							if (dx[1][yfork][xfork + 27] == 0)dx[1][yfork][xfork + 27] = id + 1;//28
							if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//29
							if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//30
							if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//31
							if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//32
							if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;//
							if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;//35
							if (dx[1][yfork][xfork + 35] == 0)dx[1][yfork][xfork + 35] = id + 1;//36
							if (dx[1][yfork][xfork + 36] == 0)dx[1][yfork][xfork + 36] = id + 1;//37
							if (dx[1][yfork][xfork + 37] == 0)dx[1][yfork][xfork + 37] = id + 1;//38
							if (dx[1][yfork][xfork + 38] == 0)dx[1][yfork][xfork + 38] = id + 1;//39
							if (dx[1][yfork][xfork + 39] == 0)dx[1][yfork][xfork + 39] = id + 1;//40
							if (dx[1][yfork][xfork + 40] == 0)dx[1][yfork][xfork + 40] = id + 1;//41
							if (dx[1][yfork][xfork + 41] == 0)dx[1][yfork][xfork + 41] = id + 1;//42
							if (dx[1][yfork][xfork + 42] == 0)dx[1][yfork][xfork + 42] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 28] == 0)dx[1][yfork][xfork + 28] = id + 1;//29
							if (dx[1][yfork][xfork + 29] == 0)dx[1][yfork][xfork + 29] = id + 1;//30
							if (dx[1][yfork][xfork + 30] == 0)dx[1][yfork][xfork + 30] = id + 1;//31
							if (dx[1][yfork][xfork + 31] == 0)dx[1][yfork][xfork + 31] = id + 1;//32
							if (dx[1][yfork][xfork + 32] == 0)dx[1][yfork][xfork + 32] = id + 1;//33
							if (dx[1][yfork][xfork + 33] == 0)dx[1][yfork][xfork + 33] = id + 1;//34
							if (dx[1][yfork][xfork + 34] == 0)dx[1][yfork][xfork + 34] = id + 1;//35
							if (dx[1][yfork][xfork + 35] == 0)dx[1][yfork][xfork + 35] = id + 1;//36
							if (dx[1][yfork][xfork + 36] == 0)dx[1][yfork][xfork + 36] = id + 1;//37
							if (dx[1][yfork][xfork + 37] == 0)dx[1][yfork][xfork + 37] = id + 1;//38
							if (dx[1][yfork][xfork + 38] == 0)dx[1][yfork][xfork + 38] = id + 1;//39
							if (dx[1][yfork][xfork + 39] == 0)dx[1][yfork][xfork + 39] = id + 1;//40
							if (dx[1][yfork][xfork + 40] == 0)dx[1][yfork][xfork + 40] = id + 1;//41
							if (dx[1][yfork][xfork + 41] == 0)dx[1][yfork][xfork + 41] = id + 1;//42
							if (dx[1][yfork][xfork + 42] == 0)dx[1][yfork][xfork + 42] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 35] == 0)dx[1][yfork][xfork + 35] = id + 1;//36
							if (dx[1][yfork][xfork + 36] == 0)dx[1][yfork][xfork + 36] = id + 1;//37
							if (dx[1][yfork][xfork + 37] == 0)dx[1][yfork][xfork + 37] = id + 1;//38
							if (dx[1][yfork][xfork + 38] == 0)dx[1][yfork][xfork + 38] = id + 1;//

						}
						else
						{
							if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//15
							if (dx[1][yfork][xfork + 15] == 0)dx[1][yfork][xfork + 15] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 11] == 0)dx[1][yfork][xfork + 11] = id + 1;//10
							if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//14
							if (dx[1][yfork][xfork + 14] == 0)dx[1][yfork][xfork + 14] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 3] == 0)dx[1][yfork][xfork + 3] = id + 1;//4
							if (dx[1][yfork][xfork + 4] == 0)dx[1][yfork][xfork + 4] = id + 1;//5
							if (dx[1][yfork][xfork + 5] == 0)dx[1][yfork][xfork + 5] = id + 1;//6
							if (dx[1][yfork][xfork + 6] == 0)dx[1][yfork][xfork + 6] = id + 1;//7
							if (dx[1][yfork][xfork + 7] == 0)dx[1][yfork][xfork + 7] = id + 1;//8
							if (dx[1][yfork][xfork + 8] == 0)dx[1][yfork][xfork + 8] = id + 1;//9
							if (dx[1][yfork][xfork + 9] == 0)dx[1][yfork][xfork + 9] = id + 1;//10
							if (dx[1][yfork][xfork + 10] == 0)dx[1][yfork][xfork + 10] = id + 1;//11
							if (dx[1][yfork][xfork + 11] == 0)dx[1][yfork][xfork + 11] = id + 1;//12
							if (dx[1][yfork][xfork + 12] == 0)dx[1][yfork][xfork + 12] = id + 1;//13
							if (dx[1][yfork][xfork + 13] == 0)dx[1][yfork][xfork + 13] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork + 3] == 0)dx[1][yfork][xfork + 3] = id + 1;//
							if (dx[1][yfork][xfork - 3] == 0)dx[1][yfork][xfork - 3] = id + 1;//-3
							if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//
							yfork++;

							if (dx[1][yfork][xfork - 5] == 0)dx[1][yfork][xfork - 5] = id + 1;//7
							if (dx[1][yfork][xfork - 7] == 0)dx[1][yfork][xfork - 7] = id + 1;//8
							if (dx[1][yfork][xfork - 8] == 0)dx[1][yfork][xfork - 8] = id + 1;//9
							if (dx[1][yfork][xfork - 9] == 0)dx[1][yfork][xfork - 9] = id + 1;//10
							if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//11
							if (dx[1][yfork][xfork - 11] == 0)dx[1][yfork][xfork - 11] = id + 1;//12
							if (dx[1][yfork][xfork - 12] == 0)dx[1][yfork][xfork - 12] = id + 1;//13
							if (dx[1][yfork][xfork - 13] == 0)dx[1][yfork][xfork - 13] = id + 1;//14
							if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//
							if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//25
							if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 9] == 0)dx[1][yfork][xfork - 9] = id + 1;//10
							if (dx[1][yfork][xfork - 10] == 0)dx[1][yfork][xfork - 10] = id + 1;//11
							if (dx[1][yfork][xfork - 11] == 0)dx[1][yfork][xfork - 11] = id + 1;//12
							if (dx[1][yfork][xfork - 12] == 0)dx[1][yfork][xfork - 12] = id + 1;//13
							if (dx[1][yfork][xfork - 13] == 0)dx[1][yfork][xfork - 13] = id + 1;//14
							if (dx[1][yfork][xfork - 14] == 0)dx[1][yfork][xfork - 14] = id + 1;//15
							if (dx[1][yfork][xfork - 15] == 0)dx[1][yfork][xfork - 15] = id + 1;//16
							if (dx[1][yfork][xfork - 16] == 0)dx[1][yfork][xfork - 16] = id + 1;//17
							if (dx[1][yfork][xfork - 17] == 0)dx[1][yfork][xfork - 17] = id + 1;//18
							if (dx[1][yfork][xfork - 18] == 0)dx[1][yfork][xfork - 18] = id + 1;//19
							if (dx[1][yfork][xfork - 19] == 0)dx[1][yfork][xfork - 19] = id + 1;//20
							if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//21
							if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//
							if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//24
							if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//21
							if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//22
							if (dx[1][yfork][xfork - 22] == 0)dx[1][yfork][xfork - 22] = id + 1;//23
							if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//24
							if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//25
							if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//26
							if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//27
							if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//28
							if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//21
							if (dx[1][yfork][xfork - 21] == 0)dx[1][yfork][xfork - 21] = id + 1;//
							if (dx[1][yfork][xfork - 23] == 0)dx[1][yfork][xfork - 23] = id + 1;//24
							if (dx[1][yfork][xfork - 24] == 0)dx[1][yfork][xfork - 24] = id + 1;//25
							if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//26
							if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//27
							if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//28
							if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//29
							if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//30
							if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//31
							if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//32
							if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;//33
							if (dx[1][yfork][xfork - 33] == 0)dx[1][yfork][xfork - 33] = id + 1;//34
							if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 18] == 0)dx[1][yfork][xfork - 18] = id + 1;//19
							if (dx[1][yfork][xfork - 19] == 0)dx[1][yfork][xfork - 19] = id + 1;//20
							if (dx[1][yfork][xfork - 20] == 0)dx[1][yfork][xfork - 20] = id + 1;//
							if (dx[1][yfork][xfork - 25] == 0)dx[1][yfork][xfork - 25] = id + 1;//26
							if (dx[1][yfork][xfork - 26] == 0)dx[1][yfork][xfork - 26] = id + 1;//27
							if (dx[1][yfork][xfork - 27] == 0)dx[1][yfork][xfork - 27] = id + 1;//28
							if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//29
							if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//30
							if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//31
							if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//32
							if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;//
							if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;//35
							if (dx[1][yfork][xfork - 35] == 0)dx[1][yfork][xfork - 35] = id + 1;//36
							if (dx[1][yfork][xfork - 36] == 0)dx[1][yfork][xfork - 36] = id + 1;//37
							if (dx[1][yfork][xfork - 37] == 0)dx[1][yfork][xfork - 37] = id + 1;//38
							if (dx[1][yfork][xfork - 38] == 0)dx[1][yfork][xfork - 38] = id + 1;//39
							if (dx[1][yfork][xfork - 39] == 0)dx[1][yfork][xfork - 39] = id + 1;//40
							if (dx[1][yfork][xfork - 40] == 0)dx[1][yfork][xfork - 40] = id + 1;//41
							if (dx[1][yfork][xfork - 41] == 0)dx[1][yfork][xfork - 41] = id + 1;//42
							if (dx[1][yfork][xfork - 42] == 0)dx[1][yfork][xfork - 42] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 28] == 0)dx[1][yfork][xfork - 28] = id + 1;//29
							if (dx[1][yfork][xfork - 29] == 0)dx[1][yfork][xfork - 29] = id + 1;//30
							if (dx[1][yfork][xfork - 30] == 0)dx[1][yfork][xfork - 30] = id + 1;//31
							if (dx[1][yfork][xfork - 31] == 0)dx[1][yfork][xfork - 31] = id + 1;//32
							if (dx[1][yfork][xfork - 32] == 0)dx[1][yfork][xfork - 32] = id + 1;//33
							if (dx[1][yfork][xfork - 33] == 0)dx[1][yfork][xfork - 33] = id + 1;//34
							if (dx[1][yfork][xfork - 34] == 0)dx[1][yfork][xfork - 34] = id + 1;//35
							if (dx[1][yfork][xfork - 35] == 0)dx[1][yfork][xfork - 35] = id + 1;//36
							if (dx[1][yfork][xfork - 36] == 0)dx[1][yfork][xfork - 36] = id + 1;//37
							if (dx[1][yfork][xfork - 37] == 0)dx[1][yfork][xfork - 37] = id + 1;//38
							if (dx[1][yfork][xfork - 38] == 0)dx[1][yfork][xfork - 38] = id + 1;//39
							if (dx[1][yfork][xfork - 39] == 0)dx[1][yfork][xfork - 39] = id + 1;//40
							if (dx[1][yfork][xfork - 40] == 0)dx[1][yfork][xfork - 40] = id + 1;//41
							if (dx[1][yfork][xfork - 41] == 0)dx[1][yfork][xfork - 41] = id + 1;//42
							if (dx[1][yfork][xfork - 42] == 0)dx[1][yfork][xfork - 42] = id + 1;//
							yfork++;
							if (dx[1][yfork][xfork - 35] == 0)dx[1][yfork][xfork - 35] = id + 1;//36
							if (dx[1][yfork][xfork - 36] == 0)dx[1][yfork][xfork - 36] = id + 1;//37
							if (dx[1][yfork][xfork - 37] == 0)dx[1][yfork][xfork - 37] = id + 1;//38
							if (dx[1][yfork][xfork - 38] == 0)dx[1][yfork][xfork - 38] = id + 1;//

						}
					}


				}
				//怪物图像
				else
				{
					if (i[id] < 10001) {
						i[id]++;die[id]++; mop[room]++;
					}
				}


				if (i[id] < h1 / 4 && ni[id] == -1) { dieword = id;nice[id] = 0;ni[id] = -2;mop[room]++; }//当怪物体力掉到一定程度求饶时,ni用来防止触发第二次



			}
			else//死亡触发
			{
				i[id] = 10000;
			}


			if (axmonst[id] != 0)
			{
				V1monst[id] = V1monst[id] + axmonst[id] / 10;V2monst[id] = V1monst[id];
				if (V1monst[id] <= -2) {
					V1monst[id] = -0;
				}
				else if (V1monst[id] >= 2) {
					V1monst[id] = 0;
				}
			}
			if (V2monst[id] > 0)
			{

				{for (a = 0;a < V2monst[id];a++)
				{
					if (
						dx[0][ym[id] - 8][xm[id] + 2] == 3 || dx[0][ym[id] - 7][xm[id] + 2] == 3 || dx[0][ym[id] - 6][xm[id] + 2] == 3 || dx[0][ym[id] - 5][xm[id] - 2] == 3 || dx[0][ym[id] - 4][xm[id] + 3] == 3 || dx[0][ym[id] - 3][xm[id] - 3] == 3 || dx[0][ym[id] - 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
						)
					{
						V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] - 3;break;
					}

					xm[id]++;
				}
				}

			}
			if (V2monst[id] < 0)
			{

				{for (a = 0;a + V2monst[id];a++)
				{
					if (
						dx[0][ym[id] - 8][xm[id] - 2] == 3 || dx[0][ym[id] - 7][xm[id] - 2] == 3 || dx[0][ym[id] - 6][xm[id] - 2] == 3 || dx[0][ym[id] - 5][xm[id] - 2] == 3 || dx[0][ym[id] - 4][xm[id] - 3] == 3 || dx[0][ym[id] - 3][xm[id] - 3] == 3 || dx[0][ym[id] - 1][xm[id] - 2] == 3 || dx[0][ym[id]][xm[id] - 2] == 3
						)
					{
						V1monst[id] = 0;V2monst[id] = 0;axmonst[id] = 0;xm[id] = xm[id] + 3;break;
					}

					xm[id]--;
				}
				}

			}
			//猛汉跳楼模拟器
			if (dx[0][ym[id] + 19][xm[id]] != 2 && dx[0][ym[id] + 19][xm[id] + 1] != 2 && dx[0][ym[id] + 19][xm[id] - 1] != 2)
			{

				if (aY[id] <= 2) { aY[id] += 0.5; }
				if (vY[id] < 8)vY[id] = vY[id] + aY[id] / 1.5;
				Vy2 = vY[id];

				for (a = 0;a < Vy2;a++)//下落检测
				{
					ym[id]++;
					if (dx[0][ym[id] + 19][xm[id]] == 2 || dx[0][ym[id] + 19][xm[id] + 1] == 2 || dx[0][ym[id] + 19][xm[id] - 1] == 2)
					{
						aY[id] = 0;vY[id] = 0;Vy2 = 0;fag[id][3] = 1;break;
					}
					else fag[id][3] = 0;
				}


			}

			if (fag[id][3] > 1)fag[id][3] = 0;//怪物动作状态







		}
		else//对话栏
		{
			if (nice[id] == 0)
			{
				if (nice[id] == 5)
				{


				}

				printf("#############################################################################################################################################\n");
				if (hdso == 1)
				{
					if (51 == room) {



						talkf(81, 86);

						//房间2特有剧情

						if (meun == 1)
						{
							hdso++;system("cls");talktime = 0;meun = '?'; mop[room]++;
						}
						if (meun == 3) { hdso = 3;system("cls");talktime = 0;meun = '?'; }
						if (meun == 0) { hdso--;hdso = 0;system("cls");talktime = 0;exit; }//如果talk=0则将不显示与商人对话}
					}
				}
				if (hdso == 2)
				{
					if (51 == room)
					{
						talktime++;
						if (talktime > 0)printf("                                 穿越者吗？有点意思。。。。。。                                                           \n");//
						if (talktime > 20)printf("                                 不过看你的样子也不像这片大陆上的人                                                           \n");//
						if (talktime > 40)printf("                                 小子，我姑且就信你一回                                                           \n");//
						if (talktime > 60)printf("                                 向我背后走去，那里便是出口                                                           \n");//
						if (talktime > 80)printf("                                 如果你见到国王，记得替我向他问好                                                           \n");//
						if (talktime > 100)printf("                                 咱有缘再见                                                           \n");//
						if (talktime > 120)printf("                                                     溜了溜了~~~（按0退出）\n");
						if (talktime > 120)talktime = 120;
						if (meun == 0) { hdso--;hdso = 0;system("cls");talktime = 0;talk = 0;nice[id] = 1;exit; }//如果talk=0则将不显示与商人对话}
					}
				}

				if (room == 51 && hdso == 3)
				{
					talktime++;
					if (talktime > 0)printf("                                 国王的亲信？                                                                                                                                                                                        \n");//printf("\n");小子，就凭你还想戏弄我？
					if (talktime > 20)printf("                                 小子，就凭你还想戏弄我？                                                                                                                                                                                        \n");//printf("\n");找死
					if (talktime > 40)printf("                                 找死                                                                                                                                                                                        \n");//printf("\n");
					if (talktime > 60) { hdso = 0;talktime = 0;system("cls");talk = 0;nice[id] = ni[id];meun = '?'; }





				}





				printf("#############################################################################################################################################\n");
			}
			if (nice[id] == 1) { printf("走吧，年轻人，不要忘记带上上面宝箱里的奖励"); }

		}

	}
}

#define 最大刷怪数 15
void product(int e)
{
	//e=0为怪物生成器
	//e=1为对话标志清除
    //e=2为对话剧情发生器
	switch (e)
	{case 0:
		/*关卡设计id表
	----------------------------------------------------------------------------------------
	|怪物                        monst[][]
	|史莱姆                      monst[1]
	|蝙蝠                        monst[2]
	|旗子                        monst[3]
	|韩德索                      monst[10][0]
	|守卫                        monst[12]
	|村民                        monst[11]
	|
	|
	|
	----------------------------------------------------------------------------------------
	*/
		if (monst[1][1] > 0)//刷怪史莱姆
			for (a = 1;a < 最大刷怪数;a++)
			{
				if (monst[1][a] > 0)
				{
					slim(xmonst[monst[1][a]], ymonst[monst[1][a]], 10, monst[1][a], 20);
				}
				else break;
			}
		if (monst[2][1] > 0)//刷怪慢百特
			for (a = 1;a < 最大刷怪数;a++)
			{
				if (monst[2][a] > 0)
				{
					manbat(xmonst[monst[2][a]], ymonst[monst[2][a]], 5, monst[2][a], 20);
				}
				else break;
			}
		
		if (monst[10][0] > 0)//刷npc哈德所
		{
			hardso(xmonst[24], ymonst[24], 50, 24, 50, 0);
		}
		if (monst[10][1] > 0)//刷怪普通巨人
			for (a = 1;a < 最大刷怪数;a++)
			{
				if (monst[10][a] > 0)
				{
					hardso(xmonst[monst[11][a]], ymonst[monst[11][a]], 65, monst[11][a], 50, 0);
				}
				else break;
			}
		if (monst[11][1] > 0)//刷怪村民
			for (a = 1;a < 最大刷怪数;a++)
			{
				if (monst[11][a] > 0)
				{
					villager(xmonst[monst[11][a]], ymonst[monst[11][a]], 30, monst[11][a], 50, 0);
				}
				else break;
			}
		if (monst[12][1] > 0)//刷怪卫兵
			for (a = 1;a < 最大刷怪数;a++)
			{
				if (monst[12][a] > 0)
				{
					gard(xmonst[monst[12][a]], ymonst[monst[12][a]], 30, monst[12][a], 50, 0);
				}
				else break;
			}
		if (monst[13][1] > 0)
			for (a = 1;a < 最大刷怪数;a++)
			{
				if (monst[13][a] > 0)
				{
					scp6789(xmonst[monst[13][a]], ymonst[monst[13][a]], 30, monst[13][a], 50, 0);
				}
				else break;
			}
		if(monst[14][1]>0)
			for (a = 1;a < 最大刷怪数;a++)
			{
				if (monst[14][a] > 0)
				{
					dionmondking(xmonst[monst[14][a]], ymonst[monst[14][a]], 30, monst[14][a], 50, 0);
				}
				else break;
			}
		/*管卡内显示
		----------------------------------------------------------------------------------------
		|elc                         按钮标志
		|trd                         商人标志
		|mison                       剧情探测器标志
		|cgrah                       过场动画标志
		|守卫                        monst[12]
		|村民                        monst[11]
		|
		|
		|
		----------------------------------------------------------------------------------------
		*/
		if (elc > 0) {
			elc = 1;pad(xbotton, ybotton, xauto, ydauto, xboxz, yboxz, eid);
		}
		

		break;

	case 1:
		/*关卡外重置*/
		if (elc != 2)elc = 0;//检测本关是否需要pad
		if (trd != 2)trd = 0;//检测是否有商人
		if (mison != 2)mison = 0;
		break;
	case 2:
		
		if (trd > 0)
		{
			trd = 1; trader(xtrd, ytrd, 0);
		}

		   if (mison > 0) 
		   {
			   mison = 1;

			   missionsector(missx, missy, missid, 0);
		   }
		   if (cgrah > 0) 
		   {
			   computergraphics(cgrah);
		   }
		   break;

	case 3:
		if (visual[3][1] > 0)//刷动态旗子
			for (a = 1;a < 最大刷怪数;a++)
			{
				if (visual[3][a] > 0)
				{
					Flag(visualx[3][a], visualy[3][a], a, visual[3][a]);
				}
				else break;
			}
		if (visual[4][1] > 0)//刷动态房屋
			for (a = 1;a < 最大刷怪数;a++)
			{
				
				if (visual[4][a] > 0)
				{
					thedoor(visualx[4][a], visualy[4][a]);
				}
				else break;
			}

		if (visual[5][1] > 0)//刷动态井水曲柄
			for (a = 1;a < 最大刷怪数;a++)
			{

				if (visual[5][a] > 0)
				{
					stick(visualx[5][a], visualy[5][a],&visualstep[5][a]);
				}
				else break;
			}
		
		break;

	}
	
}
/*关卡设计id表
----------------------------------------------------------------------------------------
|id                  怪物                        monst[][]顺序
|1                   玩家/箱子 
|2                   矩形平台/按钮
|3                   实体墙/活动门
|4                   宝箱
|5                   右门
|6                   左门
|7                   前门
|8                   后门
|10                  电脑
|15                  装饰背景
|19                  商人
|21                  史莱姆                      monst[1]
|22                  史莱姆                      monst[1]
|23                  蝙蝠                        monst[2]
|24                  韩德索                      monst[10][0]
|25                  韩德索武器                      
|26                  史莱姆                      monst[1]
|27                  史莱姆                      monst[1]
|28                  史莱姆                      monst[1]
|29                  守卫                        monst[12]
|30                  守卫                        monst[12]
|31                  守卫                        monst[12]
|32                  守卫                        monst[12]
|33                  钻石国王                    monst[13]
|40                  警笛人                      monst[13]
|9000                村民                        monst[11]
|9001                村民                        monst[11]
|
|
|
----------------------------------------------------------------------------------------
*/

void 关卡设计
{
	switch (room) {
		/*关卡设计规则
	----------------------------------------------------------------------------------------
	|room      房间id
	|eexit     从房间中进出                                      规则变换坐标
	|juxing   (横坐标x,长度，纵坐标y，高度)						 产生一个可以横向透过的平台
	|wall     (横坐标x,长度，纵坐标y，高度)						 产生一个无法穿过的区域
	|BOX      (横坐标x,纵坐标y,0)								 产生一个带奖励的盒子
	|doorr    (横坐标x, 纵坐标y)								 向右走的门
	|doorl    (横坐标x, 纵坐标y)								 向左走的门
	|doorf    (横坐标x, 纵坐标y)								 进来的门
	|doorb    (横坐标x, 纵坐标y)								 出去的门
	|xtrd =    商人横坐标                                        商人
	|ytrd =    商人纵坐标                                        商人
	|monst     [种类][第几个]                                    第几个什么怪物的id
	|xmonst    [id]                                              怪物横坐标x
	|ymonst    [id]                                              怪物横坐标x
	|trd=2     初始化一般为2                                     本关有商人的标志
	|elc=2     初始化一般为2									 本关有机关的标志
	|xbotton = 按钮横坐标										 机关的参数
	|ybotton = 按钮纵坐标 										 机关的参数
	|xauto =   自动门横坐标										 机关的参数
	|ydauto =  自动门纵坐标 									 机关的参数
	|xboxz =   重力物块位置 									 机关的参数
	|yboxz =   重力物块的位置									 机关的参数
	|eid = 	   重力物块的id									     机关的参数
	|userpc   (横坐标x, 纵坐标y)                                 玩家电脑
	|bookrack (横坐标x, 纵坐标y)                                 书架
	|house    (横坐标x, 纵坐标y)                                 村民小屋
	|tree     (横坐标x, 纵坐标y)                                （类似蘑菇云的）树
	|tip       门打开的条件，杀死怪物可达成                      门目前是否打开
	----------------------------------------------------------------------------------------
	*/

	case 15000://实验房子
		{
		tree(1300, 39);
		
		fence(1335, 7, 5);

		fence(1420, 7, 5);
		tree(1500, 39);
		
		fence(1420+116, 7, 5);
		tree(1500+116, 39);

		fence(1420 + 116*2, 7, 5);
		tree(1500 + 116*2, 39);

		well(1850+20, 13, 0);
		roadstore(1935+20, 12);
		sculpture(2035, 6);
		tree(2100, 39);
		fence(2050 + 17 * 2, 7, 4);
		storehouse(2200, 36, 0);
		tree(2300, 39);
		fence(2250+17*2, 7, 4);
		house3(2441,1);
		doublehouse(2500, 15);
		//house2(2700,30);
		juxing(0, 4000, 0, 4);
		citydoor(2570, 1);

		woodhouse(3000-200, 5);
		
		
		
		
		
		
		//kamihouse(1700, 14);
		visualt(1, 1400, 12, "thedoor");
	}break;
	case 0:
		{
		//需要转换时
			//mondt(13, 1, 40, 20, 33);

			juxing(0, 220, 0, 1);//地板
			juxing(19, 20, 12, 1);
			wall(45, 220 - 45, 13, 1);
			juxing(29, 5, 6, 1);
			wall(0, 2, 40, 40);
			wall(149, 2, 40, 40);
			BOX(142, 1, 0);
			//如果门在最左边一般为147
			tip = 2;//完成条件，杀怪数或者触发机关

			mondt(1, 1, 21, 80, 16);
			mondt(1, 2, 22, 80, 8);
			eexit(0,doorr(147, 14),0,0);


			tian = 'b';//时间
			h = 1;//箱子中的物品id
			u = 1;//给的物品数量

			if (jj1 == 0 && j3[1] == 0)//此房间有剧本
			{
				j3[1]++;//已经触发标识
				j2 = 0;
				j4 = 6;//对话文本数
			}
	}break;

	case 1:
		{
			
			juxing(0, 220, 0, 1);//地板
			juxing(80, 5, 6, 1);
			wall(0, 2, 40, 40);
			wall(149, 2, 40, 40);
			juxing(0, 100, 13, 1);
			
			
			
			wall(50, 1, 12, 12);
			tip = 0;
			mondt(2, 1, 23, 80, 20);
			BOX(40, 1, 0);
			eexit(doorl(3, 14), doorr(147, 1), doorf(10, 1),0);


		}break;

	case 2:
		{

			

			wall(0, 2, 40, 40);
			wall(500, 2, 40, 40);
			juxing(0, 3000, 0, 1);
			
			
			tip = 0;
			trd = 2;//出现商人
			xtrd = 50;ytrd = 9;
			if (jj1 == 0 && j3[2] == 0)//此房间有剧本
			{
				j3[2]++;//已经触发标识
				j2 = 6;
				j4 = 7;//对话文本数
			}
			eexit(doorl(3, 1),0, doorf(75, 1),0);
		}break;
	case 52:
		{

			
			wall(0, 2, 40, 40);
			wall(149, 2, 40, 40);
			juxing(0, 220, 0, 1);
			juxing(70, 20, 15, 1);
			juxing(98, 15, 15, 1);
			juxing(102, 5, 10, 1);
			juxing(102, 5, 5, 1);
			wall(0, 12, 11, 1);
			elc = 2;//使用机关
			xbotton = 140;ybotton = 1; xauto = 10; ydauto = 1; xboxz = 105; yboxz = 15; eid = 1;//机关的各个参数
			//juxing(30, 5, 3, 1);
			wall(30, 5, 3, 3);
			tip = 0;
			if (jj1 == 0 && j3[3] == 0)//此房间有剧本
			{
				j3[3]++;//已经触发标识
				j2 = 7;
				j4 = 8;//对话文本数
			}
			eexit(doorl(3, 1),0,0, doorb(75, 16));
		}break;
	case 51:
		{


			
			wall(0, 2, 40, 40);
			wall(149, 2, 40, 40);
			juxing(0, 220, 0, 1);
			juxing(8, 20, 15, 1);
			
			
			
			tip = 0;
			monst[10][0] = 24;//monst[10][x]是重甲兵[x][0]有对话的npc、boss
			xmonst[24] = 80;
			ymonst[24] = 24;//monst id=25已经被重甲兵的武器给占了
			eexit(doorl(3, 1), doorr(147, 1),0, doorb(10, 16));
			tip = 1;
		}break;
	case 50:
		{


			
			wall(0, 2, 40, 40);
			wall(149, 2, 40, 40);
			juxing(0, 220, 0, 1);



			tip = 0;
			if (jj1 == 0 && j3[4] == 0)//此房间有剧本
			{
				j3[4]++;//已经触发标识
				j2 = 8;
				j4 = 10;//对话文本数
			}
			eexit(0,0,0,0);
		}break;





	case 10000://安全屋
		{


			x = 250;y = 600 - 11;//重新定位人物出生时的坐标

			juxing(80, 220, 0, 1);

			wall(100, 2, 60, 45);

			wall(100, 2, 3, 400);

			wall(249, 2, 60, 400);
			juxing(100, 149, 20, 1);
			userpc(160, 9);
			bookrack(195, 12);
			system("cls");

		}break;
	case 4:
		{
		op:
			
			juxing(0, 2200, 0, 1);
			juxing(0, 2200, -1, 1);
			juxing(0, 2200, -2, 1);
			juxing(0, 2200, -3, 1);
			juxing(0, 2200, -4, 1);
			wall(0, 2, 40, 40);
			tree(200, 39);
			tian = 'w';
			trd = 2;//出现商人
			xtrd = 250;ytrd = 9;
			monst[1][1] = 26;//怪物的出场顺序与种类
			xmonst[monst[1][1]] = 600;//横坐标
			ymonst[monst[1][1]] = 8;//纵坐标
			monst[1][2] = 27;
			xmonst[monst[1][2]] = 800;
			ymonst[monst[1][2]] = 8;
			monst[1][3] = 28;
			xmonst[monst[1][3]] = 1000;
			ymonst[monst[1][3]] = 8;

			house(300, 28);
			tree(600, 39);
			tree(900, 39);
			tree(1200, 39);
			house(1300, 28);
			house(1500, 28);
			eexit(0,0,0,0);
			//house2(1100, 28);
			//dieman(1100, 4);
		}break;
	
	case 21: {
		juxing(0, 1080, 0, 4);
		juxing(1270, 1100, -40, 4);
		dimondstairs(1080, 7, 10, 1);
		wall(1400+10, 10, 16, 46);
		wall(2320, 120, 16, 60);
		celldoor(1500+130, -13);
		celldoor(1500+140 + 130, -13);
		celldoor(1500 + 140+140 + 130, -13);
		cross(1700 + 345+30, -24);
		headdown(1700 + 140,-12);
		hangdie(1700 + 280, -12);
		woodpie(1700, -24);
		hurtchair(1700 + 410, -28);
		xcross(1700+460,-26);
		/*celldoor(1500 + 140+280 + 130, -13);
		celldoor(1500 + 140 + 420 + 130, -13);*/
		elc = 2;//使用机关
		xbotton = 1395;ybotton = -39; xauto = 1405+10; ydauto = -39; 
		开发者调试{ xboxz = 1395; yboxz = 15; }
         else { xboxz = 500;yboxz = 300; } 
		 eid = 3;//机关的各个参数
		//juxing(30, 5, 3, 1);

		 mison = 2;
		 missid = 2;
		 missx = 1425+10;
		 missy = -34;
		eexit(0, 0, doorf(1020, 1),0 );
	}break;
	case 22: 
	{
	}break;


	case 54:
	{//eexit();op:
		juxing(279, 120, 0, 1);
		tian = 'b';
		wall(279, 2, 40, 40);
		wall(279 + 118, 2, 40, 40);
		doorb(329, 1);
		doorb(1329, 1);
		doorb(1532, 1);
		dieman(1545 + 35, 3);
		wall(279 + 1000, 2, 40, 40);
		wall(279 + 1000 + 118, 2, 40, 40);
		juxing(279 + 1000, 120, 0, 1);
		wall(1492, 2, 40, 40);
		wall(492 + 1000 + 118, 2, 40, 40);
		juxing(1492, 120, 0, 1);
		bookrack(370, 12);
		bookrack(1350, 12);
		mondt(11, 1, 9000, 300, 9);
		mondt(11, 2, 9001, 1300, 9);
		



		mison = 2;
		missid = 1;
		missx = 1532;
		missy = 5;


	}break;
	case 70:
	{
		wall(0 + 1850+140+30, 150, 40, 40);
		juxing(0, 2200, 0, 4);
		wall(1050, 150, 40, 40);
		dimondchair(1400, 38);
		//mondt(13, 1, 40, 1500, 35);
		mondt(14, 1, 33, 1450, 14);
		kingdomwindow(1600+30, 10);
		kingdomwindow(1650+70+30, 10);
		kingdomwindow(1700+140+30, 10);
		eexit(0, doorr(1847+140+30, 1), 0, 0);
	}break;
	case 71: 
	{
		juxing(0, 2200, 0, 4);
		wall(650, 149, 40, 40);
		
		
		well(1600, 13,0);
		well(1800, 13, 1);
		
		//flagdt(2, 1370, 9, 2);
		eexit(doorl(801, 1), 0, 0, doorb(1020, 1));
	}
			 break;
	case 72: 
	{ 

	}break;
	case 150:
	{
		juxing(0, 2200, 0, 4);
		roadstore(1900, 12);
		sculpture(2000, 6);
		fence(1400, 7, 5);
		doublehouse(2100, 15);
		storehouse(1300, 36, 0);
		kamihouse(1700, 14);
		visualt(1, 1500, 12, "thedoor");
	
	}	
		break;
	default:;
		}


	if (tian == 'w')//场景光照 
	{
		ch1 = day[0];
		ch2 = day[1];
		system("color 70");
	}
	else
	{
		ch1 = night[0];
		ch2 = night[1];
		system("color 07");
	}
	product(1);
}
